
export const cityData = [
    {
        "pid": -1,
        "id": 110000,
        "value": "110000",
        "label": "北京市",
        "children": [
            {
                "pid": 110000,
                "id": 110101,
                "value": "110101",
                "label": "东城区"
            },
            {
                "pid": 110000,
                "id": 110102,
                "value": "110102",
                "label": "西城区"
            },
            {
                "pid": 110000,
                "id": 110105,
                "value": "110105",
                "label": "朝阳区"
            },
            {
                "pid": 110000,
                "id": 110106,
                "value": "110106",
                "label": "丰台区"
            },
            {
                "pid": 110000,
                "id": 110107,
                "value": "110107",
                "label": "石景山区"
            },
            {
                "pid": 110000,
                "id": 110108,
                "value": "110108",
                "label": "海淀区"
            },
            {
                "pid": 110000,
                "id": 110109,
                "value": "110109",
                "label": "门头沟区"
            },
            {
                "pid": 110000,
                "id": 110111,
                "value": "110111",
                "label": "房山区"
            },
            {
                "pid": 110000,
                "id": 110112,
                "value": "110112",
                "label": "通州区"
            },
            {
                "pid": 110000,
                "id": 110113,
                "value": "110113",
                "label": "顺义区"
            },
            {
                "pid": 110000,
                "id": 110114,
                "value": "110114",
                "label": "昌平区"
            },
            {
                "pid": 110000,
                "id": 110115,
                "value": "110115",
                "label": "大兴区"
            },
            {
                "pid": 110000,
                "id": 110116,
                "value": "110116",
                "label": "怀柔区"
            },
            {
                "pid": 110000,
                "id": 110117,
                "value": "110117",
                "label": "平谷区"
            },
            {
                "pid": 110000,
                "id": 110118,
                "value": "110118",
                "label": "密云区"
            },
            {
                "pid": 110000,
                "id": 110119,
                "value": "110119",
                "label": "延庆区"
            }
        ]
    },
    {
        "pid": -1,
        "id": 120000,
        "value": "120000",
        "label": "天津市",
        "children": [
            {
                "pid": 120000,
                "id": 120101,
                "value": "120101",
                "label": "和平区"
            },
            {
                "pid": 120000,
                "id": 120102,
                "value": "120102",
                "label": "河东区"
            },
            {
                "pid": 120000,
                "id": 120103,
                "value": "120103",
                "label": "河西区"
            },
            {
                "pid": 120000,
                "id": 120104,
                "value": "120104",
                "label": "南开区"
            },
            {
                "pid": 120000,
                "id": 120105,
                "value": "120105",
                "label": "河北区"
            },
            {
                "pid": 120000,
                "id": 120106,
                "value": "120106",
                "label": "红桥区"
            },
            {
                "pid": 120000,
                "id": 120110,
                "value": "120110",
                "label": "东丽区"
            },
            {
                "pid": 120000,
                "id": 120111,
                "value": "120111",
                "label": "西青区"
            },
            {
                "pid": 120000,
                "id": 120112,
                "value": "120112",
                "label": "津南区"
            },
            {
                "pid": 120000,
                "id": 120113,
                "value": "120113",
                "label": "北辰区"
            },
            {
                "pid": 120000,
                "id": 120114,
                "value": "120114",
                "label": "武清区"
            },
            {
                "pid": 120000,
                "id": 120115,
                "value": "120115",
                "label": "宝坻区"
            },
            {
                "pid": 120000,
                "id": 120116,
                "value": "120116",
                "label": "滨海新区"
            },
            {
                "pid": 120000,
                "id": 120117,
                "value": "120117",
                "label": "宁河区"
            },
            {
                "pid": 120000,
                "id": 120118,
                "value": "120118",
                "label": "静海区"
            },
            {
                "pid": 120000,
                "id": 120119,
                "value": "120119",
                "label": "蓟州区"
            }
        ]
    },
    {
        "pid": -1,
        "id": 130000,
        "value": "130000",
        "label": "河北省",
        "children": [
            {
                "pid": 130000,
                "id": 130100,
                "value": "130100",
                "label": "石家庄市",
                "children": [
                    {
                        "pid": 130100,
                        "id": 130102,
                        "value": "130102",
                        "label": "长安区"
                    },
                    {
                        "pid": 130100,
                        "id": 130104,
                        "value": "130104",
                        "label": "桥西区"
                    },
                    {
                        "pid": 130100,
                        "id": 130105,
                        "value": "130105",
                        "label": "新华区"
                    },
                    {
                        "pid": 130100,
                        "id": 130107,
                        "value": "130107",
                        "label": "井陉矿区"
                    },
                    {
                        "pid": 130100,
                        "id": 130108,
                        "value": "130108",
                        "label": "裕华区"
                    },
                    {
                        "pid": 130100,
                        "id": 130109,
                        "value": "130109",
                        "label": "藁城区"
                    },
                    {
                        "pid": 130100,
                        "id": 130110,
                        "value": "130110",
                        "label": "鹿泉区"
                    },
                    {
                        "pid": 130100,
                        "id": 130111,
                        "value": "130111",
                        "label": "栾城区"
                    },
                    {
                        "pid": 130100,
                        "id": 130121,
                        "value": "130121",
                        "label": "井陉县"
                    },
                    {
                        "pid": 130100,
                        "id": 130123,
                        "value": "130123",
                        "label": "正定县"
                    },
                    {
                        "pid": 130100,
                        "id": 130125,
                        "value": "130125",
                        "label": "行唐县"
                    },
                    {
                        "pid": 130100,
                        "id": 130126,
                        "value": "130126",
                        "label": "灵寿县"
                    },
                    {
                        "pid": 130100,
                        "id": 130127,
                        "value": "130127",
                        "label": "高邑县"
                    },
                    {
                        "pid": 130100,
                        "id": 130128,
                        "value": "130128",
                        "label": "深泽县"
                    },
                    {
                        "pid": 130100,
                        "id": 130129,
                        "value": "130129",
                        "label": "赞皇县"
                    },
                    {
                        "pid": 130100,
                        "id": 130130,
                        "value": "130130",
                        "label": "无极县"
                    },
                    {
                        "pid": 130100,
                        "id": 130131,
                        "value": "130131",
                        "label": "平山县"
                    },
                    {
                        "pid": 130100,
                        "id": 130132,
                        "value": "130132",
                        "label": "元氏县"
                    },
                    {
                        "pid": 130100,
                        "id": 130133,
                        "value": "130133",
                        "label": "赵县"
                    },
                    {
                        "pid": 130100,
                        "id": 130181,
                        "value": "130181",
                        "label": "辛集市"
                    },
                    {
                        "pid": 130100,
                        "id": 130183,
                        "value": "130183",
                        "label": "晋州市"
                    },
                    {
                        "pid": 130100,
                        "id": 130184,
                        "value": "130184",
                        "label": "新乐市"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 130200,
                "value": "130200",
                "label": "唐山市",
                "children": [
                    {
                        "pid": 130200,
                        "id": 130202,
                        "value": "130202",
                        "label": "路南区"
                    },
                    {
                        "pid": 130200,
                        "id": 130203,
                        "value": "130203",
                        "label": "路北区"
                    },
                    {
                        "pid": 130200,
                        "id": 130204,
                        "value": "130204",
                        "label": "古冶区"
                    },
                    {
                        "pid": 130200,
                        "id": 130205,
                        "value": "130205",
                        "label": "开平区"
                    },
                    {
                        "pid": 130200,
                        "id": 130207,
                        "value": "130207",
                        "label": "丰南区"
                    },
                    {
                        "pid": 130200,
                        "id": 130208,
                        "value": "130208",
                        "label": "丰润区"
                    },
                    {
                        "pid": 130200,
                        "id": 130209,
                        "value": "130209",
                        "label": "曹妃甸区"
                    },
                    {
                        "pid": 130200,
                        "id": 130224,
                        "value": "130224",
                        "label": "滦南县"
                    },
                    {
                        "pid": 130200,
                        "id": 130225,
                        "value": "130225",
                        "label": "乐亭县"
                    },
                    {
                        "pid": 130200,
                        "id": 130227,
                        "value": "130227",
                        "label": "迁西县"
                    },
                    {
                        "pid": 130200,
                        "id": 130229,
                        "value": "130229",
                        "label": "玉田县"
                    },
                    {
                        "pid": 130200,
                        "id": 130281,
                        "value": "130281",
                        "label": "遵化市"
                    },
                    {
                        "pid": 130200,
                        "id": 130283,
                        "value": "130283",
                        "label": "迁安市"
                    },
                    {
                        "pid": 130200,
                        "id": 130284,
                        "value": "130284",
                        "label": "滦州市"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 130300,
                "value": "130300",
                "label": "秦皇岛市",
                "children": [
                    {
                        "pid": 130300,
                        "id": 130302,
                        "value": "130302",
                        "label": "海港区"
                    },
                    {
                        "pid": 130300,
                        "id": 130303,
                        "value": "130303",
                        "label": "山海关区"
                    },
                    {
                        "pid": 130300,
                        "id": 130304,
                        "value": "130304",
                        "label": "北戴河区"
                    },
                    {
                        "pid": 130300,
                        "id": 130306,
                        "value": "130306",
                        "label": "抚宁区"
                    },
                    {
                        "pid": 130300,
                        "id": 130321,
                        "value": "130321",
                        "label": "青龙满族自治县"
                    },
                    {
                        "pid": 130300,
                        "id": 130322,
                        "value": "130322",
                        "label": "昌黎县"
                    },
                    {
                        "pid": 130300,
                        "id": 130324,
                        "value": "130324",
                        "label": "卢龙县"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 130400,
                "value": "130400",
                "label": "邯郸市",
                "children": [
                    {
                        "pid": 130400,
                        "id": 130402,
                        "value": "130402",
                        "label": "邯山区"
                    },
                    {
                        "pid": 130400,
                        "id": 130403,
                        "value": "130403",
                        "label": "丛台区"
                    },
                    {
                        "pid": 130400,
                        "id": 130404,
                        "value": "130404",
                        "label": "复兴区"
                    },
                    {
                        "pid": 130400,
                        "id": 130406,
                        "value": "130406",
                        "label": "峰峰矿区"
                    },
                    {
                        "pid": 130400,
                        "id": 130407,
                        "value": "130407",
                        "label": "肥乡区"
                    },
                    {
                        "pid": 130400,
                        "id": 130408,
                        "value": "130408",
                        "label": "永年区"
                    },
                    {
                        "pid": 130400,
                        "id": 130423,
                        "value": "130423",
                        "label": "临漳县"
                    },
                    {
                        "pid": 130400,
                        "id": 130424,
                        "value": "130424",
                        "label": "成安县"
                    },
                    {
                        "pid": 130400,
                        "id": 130425,
                        "value": "130425",
                        "label": "大名县"
                    },
                    {
                        "pid": 130400,
                        "id": 130426,
                        "value": "130426",
                        "label": "涉县"
                    },
                    {
                        "pid": 130400,
                        "id": 130427,
                        "value": "130427",
                        "label": "磁县"
                    },
                    {
                        "pid": 130400,
                        "id": 130430,
                        "value": "130430",
                        "label": "邱县"
                    },
                    {
                        "pid": 130400,
                        "id": 130431,
                        "value": "130431",
                        "label": "鸡泽县"
                    },
                    {
                        "pid": 130400,
                        "id": 130432,
                        "value": "130432",
                        "label": "广平县"
                    },
                    {
                        "pid": 130400,
                        "id": 130433,
                        "value": "130433",
                        "label": "馆陶县"
                    },
                    {
                        "pid": 130400,
                        "id": 130434,
                        "value": "130434",
                        "label": "魏县"
                    },
                    {
                        "pid": 130400,
                        "id": 130435,
                        "value": "130435",
                        "label": "曲周县"
                    },
                    {
                        "pid": 130400,
                        "id": 130481,
                        "value": "130481",
                        "label": "武安市"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 130500,
                "value": "130500",
                "label": "邢台市",
                "children": [
                    {
                        "pid": 130500,
                        "id": 130502,
                        "value": "130502",
                        "label": "襄都区"
                    },
                    {
                        "pid": 130500,
                        "id": 130503,
                        "value": "130503",
                        "label": "信都区"
                    },
                    {
                        "pid": 130500,
                        "id": 130505,
                        "value": "130505",
                        "label": "任泽区"
                    },
                    {
                        "pid": 130500,
                        "id": 130506,
                        "value": "130506",
                        "label": "南和区"
                    },
                    {
                        "pid": 130500,
                        "id": 130522,
                        "value": "130522",
                        "label": "临城县"
                    },
                    {
                        "pid": 130500,
                        "id": 130523,
                        "value": "130523",
                        "label": "内丘县"
                    },
                    {
                        "pid": 130500,
                        "id": 130524,
                        "value": "130524",
                        "label": "柏乡县"
                    },
                    {
                        "pid": 130500,
                        "id": 130525,
                        "value": "130525",
                        "label": "隆尧县"
                    },
                    {
                        "pid": 130500,
                        "id": 130528,
                        "value": "130528",
                        "label": "宁晋县"
                    },
                    {
                        "pid": 130500,
                        "id": 130529,
                        "value": "130529",
                        "label": "巨鹿县"
                    },
                    {
                        "pid": 130500,
                        "id": 130530,
                        "value": "130530",
                        "label": "新河县"
                    },
                    {
                        "pid": 130500,
                        "id": 130531,
                        "value": "130531",
                        "label": "广宗县"
                    },
                    {
                        "pid": 130500,
                        "id": 130532,
                        "value": "130532",
                        "label": "平乡县"
                    },
                    {
                        "pid": 130500,
                        "id": 130533,
                        "value": "130533",
                        "label": "威县"
                    },
                    {
                        "pid": 130500,
                        "id": 130534,
                        "value": "130534",
                        "label": "清河县"
                    },
                    {
                        "pid": 130500,
                        "id": 130535,
                        "value": "130535",
                        "label": "临西县"
                    },
                    {
                        "pid": 130500,
                        "id": 130581,
                        "value": "130581",
                        "label": "南宫市"
                    },
                    {
                        "pid": 130500,
                        "id": 130582,
                        "value": "130582",
                        "label": "沙河市"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 130600,
                "value": "130600",
                "label": "保定市",
                "children": [
                    {
                        "pid": 130600,
                        "id": 130602,
                        "value": "130602",
                        "label": "竞秀区"
                    },
                    {
                        "pid": 130600,
                        "id": 130606,
                        "value": "130606",
                        "label": "莲池区"
                    },
                    {
                        "pid": 130600,
                        "id": 130607,
                        "value": "130607",
                        "label": "满城区"
                    },
                    {
                        "pid": 130600,
                        "id": 130608,
                        "value": "130608",
                        "label": "清苑区"
                    },
                    {
                        "pid": 130600,
                        "id": 130609,
                        "value": "130609",
                        "label": "徐水区"
                    },
                    {
                        "pid": 130600,
                        "id": 130623,
                        "value": "130623",
                        "label": "涞水县"
                    },
                    {
                        "pid": 130600,
                        "id": 130624,
                        "value": "130624",
                        "label": "阜平县"
                    },
                    {
                        "pid": 130600,
                        "id": 130626,
                        "value": "130626",
                        "label": "定兴县"
                    },
                    {
                        "pid": 130600,
                        "id": 130627,
                        "value": "130627",
                        "label": "唐县"
                    },
                    {
                        "pid": 130600,
                        "id": 130628,
                        "value": "130628",
                        "label": "高阳县"
                    },
                    {
                        "pid": 130600,
                        "id": 130629,
                        "value": "130629",
                        "label": "容城县"
                    },
                    {
                        "pid": 130600,
                        "id": 130630,
                        "value": "130630",
                        "label": "涞源县"
                    },
                    {
                        "pid": 130600,
                        "id": 130631,
                        "value": "130631",
                        "label": "望都县"
                    },
                    {
                        "pid": 130600,
                        "id": 130632,
                        "value": "130632",
                        "label": "安新县"
                    },
                    {
                        "pid": 130600,
                        "id": 130633,
                        "value": "130633",
                        "label": "易县"
                    },
                    {
                        "pid": 130600,
                        "id": 130634,
                        "value": "130634",
                        "label": "曲阳县"
                    },
                    {
                        "pid": 130600,
                        "id": 130635,
                        "value": "130635",
                        "label": "蠡县"
                    },
                    {
                        "pid": 130600,
                        "id": 130636,
                        "value": "130636",
                        "label": "顺平县"
                    },
                    {
                        "pid": 130600,
                        "id": 130637,
                        "value": "130637",
                        "label": "博野县"
                    },
                    {
                        "pid": 130600,
                        "id": 130638,
                        "value": "130638",
                        "label": "雄县"
                    },
                    {
                        "pid": 130600,
                        "id": 130681,
                        "value": "130681",
                        "label": "涿州市"
                    },
                    {
                        "pid": 130600,
                        "id": 130682,
                        "value": "130682",
                        "label": "定州市"
                    },
                    {
                        "pid": 130600,
                        "id": 130683,
                        "value": "130683",
                        "label": "安国市"
                    },
                    {
                        "pid": 130600,
                        "id": 130684,
                        "value": "130684",
                        "label": "高碑店市"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 130700,
                "value": "130700",
                "label": "张家口市",
                "children": [
                    {
                        "pid": 130700,
                        "id": 130702,
                        "value": "130702",
                        "label": "桥东区"
                    },
                    {
                        "pid": 130700,
                        "id": 130703,
                        "value": "130703",
                        "label": "桥西区"
                    },
                    {
                        "pid": 130700,
                        "id": 130705,
                        "value": "130705",
                        "label": "宣化区"
                    },
                    {
                        "pid": 130700,
                        "id": 130706,
                        "value": "130706",
                        "label": "下花园区"
                    },
                    {
                        "pid": 130700,
                        "id": 130708,
                        "value": "130708",
                        "label": "万全区"
                    },
                    {
                        "pid": 130700,
                        "id": 130709,
                        "value": "130709",
                        "label": "崇礼区"
                    },
                    {
                        "pid": 130700,
                        "id": 130722,
                        "value": "130722",
                        "label": "张北县"
                    },
                    {
                        "pid": 130700,
                        "id": 130723,
                        "value": "130723",
                        "label": "康保县"
                    },
                    {
                        "pid": 130700,
                        "id": 130724,
                        "value": "130724",
                        "label": "沽源县"
                    },
                    {
                        "pid": 130700,
                        "id": 130725,
                        "value": "130725",
                        "label": "尚义县"
                    },
                    {
                        "pid": 130700,
                        "id": 130726,
                        "value": "130726",
                        "label": "蔚县"
                    },
                    {
                        "pid": 130700,
                        "id": 130727,
                        "value": "130727",
                        "label": "阳原县"
                    },
                    {
                        "pid": 130700,
                        "id": 130728,
                        "value": "130728",
                        "label": "怀安县"
                    },
                    {
                        "pid": 130700,
                        "id": 130730,
                        "value": "130730",
                        "label": "怀来县"
                    },
                    {
                        "pid": 130700,
                        "id": 130731,
                        "value": "130731",
                        "label": "涿鹿县"
                    },
                    {
                        "pid": 130700,
                        "id": 130732,
                        "value": "130732",
                        "label": "赤城县"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 130800,
                "value": "130800",
                "label": "承德市",
                "children": [
                    {
                        "pid": 130800,
                        "id": 130802,
                        "value": "130802",
                        "label": "双桥区"
                    },
                    {
                        "pid": 130800,
                        "id": 130803,
                        "value": "130803",
                        "label": "双滦区"
                    },
                    {
                        "pid": 130800,
                        "id": 130804,
                        "value": "130804",
                        "label": "鹰手营子矿区"
                    },
                    {
                        "pid": 130800,
                        "id": 130821,
                        "value": "130821",
                        "label": "承德县"
                    },
                    {
                        "pid": 130800,
                        "id": 130822,
                        "value": "130822",
                        "label": "兴隆县"
                    },
                    {
                        "pid": 130800,
                        "id": 130824,
                        "value": "130824",
                        "label": "滦平县"
                    },
                    {
                        "pid": 130800,
                        "id": 130825,
                        "value": "130825",
                        "label": "隆化县"
                    },
                    {
                        "pid": 130800,
                        "id": 130826,
                        "value": "130826",
                        "label": "丰宁满族自治县"
                    },
                    {
                        "pid": 130800,
                        "id": 130827,
                        "value": "130827",
                        "label": "宽城满族自治县"
                    },
                    {
                        "pid": 130800,
                        "id": 130828,
                        "value": "130828",
                        "label": "围场满族蒙古族自治县"
                    },
                    {
                        "pid": 130800,
                        "id": 130881,
                        "value": "130881",
                        "label": "平泉市"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 130900,
                "value": "130900",
                "label": "沧州市",
                "children": [
                    {
                        "pid": 130900,
                        "id": 130902,
                        "value": "130902",
                        "label": "新华区"
                    },
                    {
                        "pid": 130900,
                        "id": 130903,
                        "value": "130903",
                        "label": "运河区"
                    },
                    {
                        "pid": 130900,
                        "id": 130921,
                        "value": "130921",
                        "label": "沧县"
                    },
                    {
                        "pid": 130900,
                        "id": 130922,
                        "value": "130922",
                        "label": "青县"
                    },
                    {
                        "pid": 130900,
                        "id": 130923,
                        "value": "130923",
                        "label": "东光县"
                    },
                    {
                        "pid": 130900,
                        "id": 130924,
                        "value": "130924",
                        "label": "海兴县"
                    },
                    {
                        "pid": 130900,
                        "id": 130925,
                        "value": "130925",
                        "label": "盐山县"
                    },
                    {
                        "pid": 130900,
                        "id": 130926,
                        "value": "130926",
                        "label": "肃宁县"
                    },
                    {
                        "pid": 130900,
                        "id": 130927,
                        "value": "130927",
                        "label": "南皮县"
                    },
                    {
                        "pid": 130900,
                        "id": 130928,
                        "value": "130928",
                        "label": "吴桥县"
                    },
                    {
                        "pid": 130900,
                        "id": 130929,
                        "value": "130929",
                        "label": "献县"
                    },
                    {
                        "pid": 130900,
                        "id": 130930,
                        "value": "130930",
                        "label": "孟村回族自治县"
                    },
                    {
                        "pid": 130900,
                        "id": 130981,
                        "value": "130981",
                        "label": "泊头市"
                    },
                    {
                        "pid": 130900,
                        "id": 130982,
                        "value": "130982",
                        "label": "任丘市"
                    },
                    {
                        "pid": 130900,
                        "id": 130983,
                        "value": "130983",
                        "label": "黄骅市"
                    },
                    {
                        "pid": 130900,
                        "id": 130984,
                        "value": "130984",
                        "label": "河间市"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 131000,
                "value": "131000",
                "label": "廊坊市",
                "children": [
                    {
                        "pid": 131000,
                        "id": 131002,
                        "value": "131002",
                        "label": "安次区"
                    },
                    {
                        "pid": 131000,
                        "id": 131003,
                        "value": "131003",
                        "label": "广阳区"
                    },
                    {
                        "pid": 131000,
                        "id": 131022,
                        "value": "131022",
                        "label": "固安县"
                    },
                    {
                        "pid": 131000,
                        "id": 131023,
                        "value": "131023",
                        "label": "永清县"
                    },
                    {
                        "pid": 131000,
                        "id": 131024,
                        "value": "131024",
                        "label": "香河县"
                    },
                    {
                        "pid": 131000,
                        "id": 131025,
                        "value": "131025",
                        "label": "大城县"
                    },
                    {
                        "pid": 131000,
                        "id": 131026,
                        "value": "131026",
                        "label": "文安县"
                    },
                    {
                        "pid": 131000,
                        "id": 131028,
                        "value": "131028",
                        "label": "大厂回族自治县"
                    },
                    {
                        "pid": 131000,
                        "id": 131081,
                        "value": "131081",
                        "label": "霸州市"
                    },
                    {
                        "pid": 131000,
                        "id": 131082,
                        "value": "131082",
                        "label": "三河市"
                    }
                ]
            },
            {
                "pid": 130000,
                "id": 131100,
                "value": "131100",
                "label": "衡水市",
                "children": [
                    {
                        "pid": 131100,
                        "id": 131102,
                        "value": "131102",
                        "label": "桃城区"
                    },
                    {
                        "pid": 131100,
                        "id": 131103,
                        "value": "131103",
                        "label": "冀州区"
                    },
                    {
                        "pid": 131100,
                        "id": 131121,
                        "value": "131121",
                        "label": "枣强县"
                    },
                    {
                        "pid": 131100,
                        "id": 131122,
                        "value": "131122",
                        "label": "武邑县"
                    },
                    {
                        "pid": 131100,
                        "id": 131123,
                        "value": "131123",
                        "label": "武强县"
                    },
                    {
                        "pid": 131100,
                        "id": 131124,
                        "value": "131124",
                        "label": "饶阳县"
                    },
                    {
                        "pid": 131100,
                        "id": 131125,
                        "value": "131125",
                        "label": "安平县"
                    },
                    {
                        "pid": 131100,
                        "id": 131126,
                        "value": "131126",
                        "label": "故城县"
                    },
                    {
                        "pid": 131100,
                        "id": 131127,
                        "value": "131127",
                        "label": "景县"
                    },
                    {
                        "pid": 131100,
                        "id": 131128,
                        "value": "131128",
                        "label": "阜城县"
                    },
                    {
                        "pid": 131100,
                        "id": 131182,
                        "value": "131182",
                        "label": "深州市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 140000,
        "value": "140000",
        "label": "山西省",
        "children": [
            {
                "pid": 140000,
                "id": 140100,
                "value": "140100",
                "label": "太原市",
                "children": [
                    {
                        "pid": 140100,
                        "id": 140105,
                        "value": "140105",
                        "label": "小店区"
                    },
                    {
                        "pid": 140100,
                        "id": 140106,
                        "value": "140106",
                        "label": "迎泽区"
                    },
                    {
                        "pid": 140100,
                        "id": 140107,
                        "value": "140107",
                        "label": "杏花岭区"
                    },
                    {
                        "pid": 140100,
                        "id": 140108,
                        "value": "140108",
                        "label": "尖草坪区"
                    },
                    {
                        "pid": 140100,
                        "id": 140109,
                        "value": "140109",
                        "label": "万柏林区"
                    },
                    {
                        "pid": 140100,
                        "id": 140110,
                        "value": "140110",
                        "label": "晋源区"
                    },
                    {
                        "pid": 140100,
                        "id": 140121,
                        "value": "140121",
                        "label": "清徐县"
                    },
                    {
                        "pid": 140100,
                        "id": 140122,
                        "value": "140122",
                        "label": "阳曲县"
                    },
                    {
                        "pid": 140100,
                        "id": 140123,
                        "value": "140123",
                        "label": "娄烦县"
                    },
                    {
                        "pid": 140100,
                        "id": 140181,
                        "value": "140181",
                        "label": "古交市"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 140200,
                "value": "140200",
                "label": "大同市",
                "children": [
                    {
                        "pid": 140200,
                        "id": 140212,
                        "value": "140212",
                        "label": "新荣区"
                    },
                    {
                        "pid": 140200,
                        "id": 140213,
                        "value": "140213",
                        "label": "平城区"
                    },
                    {
                        "pid": 140200,
                        "id": 140214,
                        "value": "140214",
                        "label": "云冈区"
                    },
                    {
                        "pid": 140200,
                        "id": 140215,
                        "value": "140215",
                        "label": "云州区"
                    },
                    {
                        "pid": 140200,
                        "id": 140221,
                        "value": "140221",
                        "label": "阳高县"
                    },
                    {
                        "pid": 140200,
                        "id": 140222,
                        "value": "140222",
                        "label": "天镇县"
                    },
                    {
                        "pid": 140200,
                        "id": 140223,
                        "value": "140223",
                        "label": "广灵县"
                    },
                    {
                        "pid": 140200,
                        "id": 140224,
                        "value": "140224",
                        "label": "灵丘县"
                    },
                    {
                        "pid": 140200,
                        "id": 140225,
                        "value": "140225",
                        "label": "浑源县"
                    },
                    {
                        "pid": 140200,
                        "id": 140226,
                        "value": "140226",
                        "label": "左云县"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 140300,
                "value": "140300",
                "label": "阳泉市",
                "children": [
                    {
                        "pid": 140300,
                        "id": 140302,
                        "value": "140302",
                        "label": "城区"
                    },
                    {
                        "pid": 140300,
                        "id": 140303,
                        "value": "140303",
                        "label": "矿区"
                    },
                    {
                        "pid": 140300,
                        "id": 140311,
                        "value": "140311",
                        "label": "郊区"
                    },
                    {
                        "pid": 140300,
                        "id": 140321,
                        "value": "140321",
                        "label": "平定县"
                    },
                    {
                        "pid": 140300,
                        "id": 140322,
                        "value": "140322",
                        "label": "盂县"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 140400,
                "value": "140400",
                "label": "长治市",
                "children": [
                    {
                        "pid": 140400,
                        "id": 140403,
                        "value": "140403",
                        "label": "潞州区"
                    },
                    {
                        "pid": 140400,
                        "id": 140404,
                        "value": "140404",
                        "label": "上党区"
                    },
                    {
                        "pid": 140400,
                        "id": 140405,
                        "value": "140405",
                        "label": "屯留区"
                    },
                    {
                        "pid": 140400,
                        "id": 140406,
                        "value": "140406",
                        "label": "潞城区"
                    },
                    {
                        "pid": 140400,
                        "id": 140423,
                        "value": "140423",
                        "label": "襄垣县"
                    },
                    {
                        "pid": 140400,
                        "id": 140425,
                        "value": "140425",
                        "label": "平顺县"
                    },
                    {
                        "pid": 140400,
                        "id": 140426,
                        "value": "140426",
                        "label": "黎城县"
                    },
                    {
                        "pid": 140400,
                        "id": 140427,
                        "value": "140427",
                        "label": "壶关县"
                    },
                    {
                        "pid": 140400,
                        "id": 140428,
                        "value": "140428",
                        "label": "长子县"
                    },
                    {
                        "pid": 140400,
                        "id": 140429,
                        "value": "140429",
                        "label": "武乡县"
                    },
                    {
                        "pid": 140400,
                        "id": 140430,
                        "value": "140430",
                        "label": "沁县"
                    },
                    {
                        "pid": 140400,
                        "id": 140431,
                        "value": "140431",
                        "label": "沁源县"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 140500,
                "value": "140500",
                "label": "晋城市",
                "children": [
                    {
                        "pid": 140500,
                        "id": 140502,
                        "value": "140502",
                        "label": "城区"
                    },
                    {
                        "pid": 140500,
                        "id": 140521,
                        "value": "140521",
                        "label": "沁水县"
                    },
                    {
                        "pid": 140500,
                        "id": 140522,
                        "value": "140522",
                        "label": "阳城县"
                    },
                    {
                        "pid": 140500,
                        "id": 140524,
                        "value": "140524",
                        "label": "陵川县"
                    },
                    {
                        "pid": 140500,
                        "id": 140525,
                        "value": "140525",
                        "label": "泽州县"
                    },
                    {
                        "pid": 140500,
                        "id": 140581,
                        "value": "140581",
                        "label": "高平市"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 140600,
                "value": "140600",
                "label": "朔州市",
                "children": [
                    {
                        "pid": 140600,
                        "id": 140602,
                        "value": "140602",
                        "label": "朔城区"
                    },
                    {
                        "pid": 140600,
                        "id": 140603,
                        "value": "140603",
                        "label": "平鲁区"
                    },
                    {
                        "pid": 140600,
                        "id": 140621,
                        "value": "140621",
                        "label": "山阴县"
                    },
                    {
                        "pid": 140600,
                        "id": 140622,
                        "value": "140622",
                        "label": "应县"
                    },
                    {
                        "pid": 140600,
                        "id": 140623,
                        "value": "140623",
                        "label": "右玉县"
                    },
                    {
                        "pid": 140600,
                        "id": 140681,
                        "value": "140681",
                        "label": "怀仁市"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 140700,
                "value": "140700",
                "label": "晋中市",
                "children": [
                    {
                        "pid": 140700,
                        "id": 140702,
                        "value": "140702",
                        "label": "榆次区"
                    },
                    {
                        "pid": 140700,
                        "id": 140703,
                        "value": "140703",
                        "label": "太谷区"
                    },
                    {
                        "pid": 140700,
                        "id": 140721,
                        "value": "140721",
                        "label": "榆社县"
                    },
                    {
                        "pid": 140700,
                        "id": 140722,
                        "value": "140722",
                        "label": "左权县"
                    },
                    {
                        "pid": 140700,
                        "id": 140723,
                        "value": "140723",
                        "label": "和顺县"
                    },
                    {
                        "pid": 140700,
                        "id": 140724,
                        "value": "140724",
                        "label": "昔阳县"
                    },
                    {
                        "pid": 140700,
                        "id": 140725,
                        "value": "140725",
                        "label": "寿阳县"
                    },
                    {
                        "pid": 140700,
                        "id": 140727,
                        "value": "140727",
                        "label": "祁县"
                    },
                    {
                        "pid": 140700,
                        "id": 140728,
                        "value": "140728",
                        "label": "平遥县"
                    },
                    {
                        "pid": 140700,
                        "id": 140729,
                        "value": "140729",
                        "label": "灵石县"
                    },
                    {
                        "pid": 140700,
                        "id": 140781,
                        "value": "140781",
                        "label": "介休市"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 140800,
                "value": "140800",
                "label": "运城市",
                "children": [
                    {
                        "pid": 140800,
                        "id": 140802,
                        "value": "140802",
                        "label": "盐湖区"
                    },
                    {
                        "pid": 140800,
                        "id": 140821,
                        "value": "140821",
                        "label": "临猗县"
                    },
                    {
                        "pid": 140800,
                        "id": 140822,
                        "value": "140822",
                        "label": "万荣县"
                    },
                    {
                        "pid": 140800,
                        "id": 140823,
                        "value": "140823",
                        "label": "闻喜县"
                    },
                    {
                        "pid": 140800,
                        "id": 140824,
                        "value": "140824",
                        "label": "稷山县"
                    },
                    {
                        "pid": 140800,
                        "id": 140825,
                        "value": "140825",
                        "label": "新绛县"
                    },
                    {
                        "pid": 140800,
                        "id": 140826,
                        "value": "140826",
                        "label": "绛县"
                    },
                    {
                        "pid": 140800,
                        "id": 140827,
                        "value": "140827",
                        "label": "垣曲县"
                    },
                    {
                        "pid": 140800,
                        "id": 140828,
                        "value": "140828",
                        "label": "夏县"
                    },
                    {
                        "pid": 140800,
                        "id": 140829,
                        "value": "140829",
                        "label": "平陆县"
                    },
                    {
                        "pid": 140800,
                        "id": 140830,
                        "value": "140830",
                        "label": "芮城县"
                    },
                    {
                        "pid": 140800,
                        "id": 140881,
                        "value": "140881",
                        "label": "永济市"
                    },
                    {
                        "pid": 140800,
                        "id": 140882,
                        "value": "140882",
                        "label": "河津市"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 140900,
                "value": "140900",
                "label": "忻州市",
                "children": [
                    {
                        "pid": 140900,
                        "id": 140902,
                        "value": "140902",
                        "label": "忻府区"
                    },
                    {
                        "pid": 140900,
                        "id": 140921,
                        "value": "140921",
                        "label": "定襄县"
                    },
                    {
                        "pid": 140900,
                        "id": 140922,
                        "value": "140922",
                        "label": "五台县"
                    },
                    {
                        "pid": 140900,
                        "id": 140923,
                        "value": "140923",
                        "label": "代县"
                    },
                    {
                        "pid": 140900,
                        "id": 140924,
                        "value": "140924",
                        "label": "繁峙县"
                    },
                    {
                        "pid": 140900,
                        "id": 140925,
                        "value": "140925",
                        "label": "宁武县"
                    },
                    {
                        "pid": 140900,
                        "id": 140926,
                        "value": "140926",
                        "label": "静乐县"
                    },
                    {
                        "pid": 140900,
                        "id": 140927,
                        "value": "140927",
                        "label": "神池县"
                    },
                    {
                        "pid": 140900,
                        "id": 140928,
                        "value": "140928",
                        "label": "五寨县"
                    },
                    {
                        "pid": 140900,
                        "id": 140929,
                        "value": "140929",
                        "label": "岢岚县"
                    },
                    {
                        "pid": 140900,
                        "id": 140930,
                        "value": "140930",
                        "label": "河曲县"
                    },
                    {
                        "pid": 140900,
                        "id": 140931,
                        "value": "140931",
                        "label": "保德县"
                    },
                    {
                        "pid": 140900,
                        "id": 140932,
                        "value": "140932",
                        "label": "偏关县"
                    },
                    {
                        "pid": 140900,
                        "id": 140981,
                        "value": "140981",
                        "label": "原平市"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 141000,
                "value": "141000",
                "label": "临汾市",
                "children": [
                    {
                        "pid": 141000,
                        "id": 141002,
                        "value": "141002",
                        "label": "尧都区"
                    },
                    {
                        "pid": 141000,
                        "id": 141021,
                        "value": "141021",
                        "label": "曲沃县"
                    },
                    {
                        "pid": 141000,
                        "id": 141022,
                        "value": "141022",
                        "label": "翼城县"
                    },
                    {
                        "pid": 141000,
                        "id": 141023,
                        "value": "141023",
                        "label": "襄汾县"
                    },
                    {
                        "pid": 141000,
                        "id": 141024,
                        "value": "141024",
                        "label": "洪洞县"
                    },
                    {
                        "pid": 141000,
                        "id": 141025,
                        "value": "141025",
                        "label": "古县"
                    },
                    {
                        "pid": 141000,
                        "id": 141026,
                        "value": "141026",
                        "label": "安泽县"
                    },
                    {
                        "pid": 141000,
                        "id": 141027,
                        "value": "141027",
                        "label": "浮山县"
                    },
                    {
                        "pid": 141000,
                        "id": 141028,
                        "value": "141028",
                        "label": "吉县"
                    },
                    {
                        "pid": 141000,
                        "id": 141029,
                        "value": "141029",
                        "label": "乡宁县"
                    },
                    {
                        "pid": 141000,
                        "id": 141030,
                        "value": "141030",
                        "label": "大宁县"
                    },
                    {
                        "pid": 141000,
                        "id": 141031,
                        "value": "141031",
                        "label": "隰县"
                    },
                    {
                        "pid": 141000,
                        "id": 141032,
                        "value": "141032",
                        "label": "永和县"
                    },
                    {
                        "pid": 141000,
                        "id": 141033,
                        "value": "141033",
                        "label": "蒲县"
                    },
                    {
                        "pid": 141000,
                        "id": 141034,
                        "value": "141034",
                        "label": "汾西县"
                    },
                    {
                        "pid": 141000,
                        "id": 141081,
                        "value": "141081",
                        "label": "侯马市"
                    },
                    {
                        "pid": 141000,
                        "id": 141082,
                        "value": "141082",
                        "label": "霍州市"
                    }
                ]
            },
            {
                "pid": 140000,
                "id": 141100,
                "value": "141100",
                "label": "吕梁市",
                "children": [
                    {
                        "pid": 141100,
                        "id": 141102,
                        "value": "141102",
                        "label": "离石区"
                    },
                    {
                        "pid": 141100,
                        "id": 141121,
                        "value": "141121",
                        "label": "文水县"
                    },
                    {
                        "pid": 141100,
                        "id": 141122,
                        "value": "141122",
                        "label": "交城县"
                    },
                    {
                        "pid": 141100,
                        "id": 141123,
                        "value": "141123",
                        "label": "兴县"
                    },
                    {
                        "pid": 141100,
                        "id": 141124,
                        "value": "141124",
                        "label": "临县"
                    },
                    {
                        "pid": 141100,
                        "id": 141125,
                        "value": "141125",
                        "label": "柳林县"
                    },
                    {
                        "pid": 141100,
                        "id": 141126,
                        "value": "141126",
                        "label": "石楼县"
                    },
                    {
                        "pid": 141100,
                        "id": 141127,
                        "value": "141127",
                        "label": "岚县"
                    },
                    {
                        "pid": 141100,
                        "id": 141128,
                        "value": "141128",
                        "label": "方山县"
                    },
                    {
                        "pid": 141100,
                        "id": 141129,
                        "value": "141129",
                        "label": "中阳县"
                    },
                    {
                        "pid": 141100,
                        "id": 141130,
                        "value": "141130",
                        "label": "交口县"
                    },
                    {
                        "pid": 141100,
                        "id": 141181,
                        "value": "141181",
                        "label": "孝义市"
                    },
                    {
                        "pid": 141100,
                        "id": 141182,
                        "value": "141182",
                        "label": "汾阳市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 150000,
        "value": "150000",
        "label": "内蒙古自治区",
        "children": [
            {
                "pid": 150000,
                "id": 150100,
                "value": "150100",
                "label": "呼和浩特市",
                "children": [
                    {
                        "pid": 150100,
                        "id": 150102,
                        "value": "150102",
                        "label": "新城区"
                    },
                    {
                        "pid": 150100,
                        "id": 150103,
                        "value": "150103",
                        "label": "回民区"
                    },
                    {
                        "pid": 150100,
                        "id": 150104,
                        "value": "150104",
                        "label": "玉泉区"
                    },
                    {
                        "pid": 150100,
                        "id": 150105,
                        "value": "150105",
                        "label": "赛罕区"
                    },
                    {
                        "pid": 150100,
                        "id": 150121,
                        "value": "150121",
                        "label": "土默特左旗"
                    },
                    {
                        "pid": 150100,
                        "id": 150122,
                        "value": "150122",
                        "label": "托克托县"
                    },
                    {
                        "pid": 150100,
                        "id": 150123,
                        "value": "150123",
                        "label": "和林格尔县"
                    },
                    {
                        "pid": 150100,
                        "id": 150124,
                        "value": "150124",
                        "label": "清水河县"
                    },
                    {
                        "pid": 150100,
                        "id": 150125,
                        "value": "150125",
                        "label": "武川县"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 150200,
                "value": "150200",
                "label": "包头市",
                "children": [
                    {
                        "pid": 150200,
                        "id": 150202,
                        "value": "150202",
                        "label": "东河区"
                    },
                    {
                        "pid": 150200,
                        "id": 150203,
                        "value": "150203",
                        "label": "昆都仑区"
                    },
                    {
                        "pid": 150200,
                        "id": 150204,
                        "value": "150204",
                        "label": "青山区"
                    },
                    {
                        "pid": 150200,
                        "id": 150205,
                        "value": "150205",
                        "label": "石拐区"
                    },
                    {
                        "pid": 150200,
                        "id": 150206,
                        "value": "150206",
                        "label": "白云鄂博矿区"
                    },
                    {
                        "pid": 150200,
                        "id": 150207,
                        "value": "150207",
                        "label": "九原区"
                    },
                    {
                        "pid": 150200,
                        "id": 150221,
                        "value": "150221",
                        "label": "土默特右旗"
                    },
                    {
                        "pid": 150200,
                        "id": 150222,
                        "value": "150222",
                        "label": "固阳县"
                    },
                    {
                        "pid": 150200,
                        "id": 150223,
                        "value": "150223",
                        "label": "达尔罕茂明安联合旗"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 150300,
                "value": "150300",
                "label": "乌海市",
                "children": [
                    {
                        "pid": 150300,
                        "id": 150302,
                        "value": "150302",
                        "label": "海勃湾区"
                    },
                    {
                        "pid": 150300,
                        "id": 150303,
                        "value": "150303",
                        "label": "海南区"
                    },
                    {
                        "pid": 150300,
                        "id": 150304,
                        "value": "150304",
                        "label": "乌达区"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 150400,
                "value": "150400",
                "label": "赤峰市",
                "children": [
                    {
                        "pid": 150400,
                        "id": 150402,
                        "value": "150402",
                        "label": "红山区"
                    },
                    {
                        "pid": 150400,
                        "id": 150403,
                        "value": "150403",
                        "label": "元宝山区"
                    },
                    {
                        "pid": 150400,
                        "id": 150404,
                        "value": "150404",
                        "label": "松山区"
                    },
                    {
                        "pid": 150400,
                        "id": 150421,
                        "value": "150421",
                        "label": "阿鲁科尔沁旗"
                    },
                    {
                        "pid": 150400,
                        "id": 150422,
                        "value": "150422",
                        "label": "巴林左旗"
                    },
                    {
                        "pid": 150400,
                        "id": 150423,
                        "value": "150423",
                        "label": "巴林右旗"
                    },
                    {
                        "pid": 150400,
                        "id": 150424,
                        "value": "150424",
                        "label": "林西县"
                    },
                    {
                        "pid": 150400,
                        "id": 150425,
                        "value": "150425",
                        "label": "克什克腾旗"
                    },
                    {
                        "pid": 150400,
                        "id": 150426,
                        "value": "150426",
                        "label": "翁牛特旗"
                    },
                    {
                        "pid": 150400,
                        "id": 150428,
                        "value": "150428",
                        "label": "喀喇沁旗"
                    },
                    {
                        "pid": 150400,
                        "id": 150429,
                        "value": "150429",
                        "label": "宁城县"
                    },
                    {
                        "pid": 150400,
                        "id": 150430,
                        "value": "150430",
                        "label": "敖汉旗"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 150500,
                "value": "150500",
                "label": "通辽市",
                "children": [
                    {
                        "pid": 150500,
                        "id": 150502,
                        "value": "150502",
                        "label": "科尔沁区"
                    },
                    {
                        "pid": 150500,
                        "id": 150521,
                        "value": "150521",
                        "label": "科尔沁左翼中旗"
                    },
                    {
                        "pid": 150500,
                        "id": 150522,
                        "value": "150522",
                        "label": "科尔沁左翼后旗"
                    },
                    {
                        "pid": 150500,
                        "id": 150523,
                        "value": "150523",
                        "label": "开鲁县"
                    },
                    {
                        "pid": 150500,
                        "id": 150524,
                        "value": "150524",
                        "label": "库伦旗"
                    },
                    {
                        "pid": 150500,
                        "id": 150525,
                        "value": "150525",
                        "label": "奈曼旗"
                    },
                    {
                        "pid": 150500,
                        "id": 150526,
                        "value": "150526",
                        "label": "扎鲁特旗"
                    },
                    {
                        "pid": 150500,
                        "id": 150581,
                        "value": "150581",
                        "label": "霍林郭勒市"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 150600,
                "value": "150600",
                "label": "鄂尔多斯市",
                "children": [
                    {
                        "pid": 150600,
                        "id": 150602,
                        "value": "150602",
                        "label": "东胜区"
                    },
                    {
                        "pid": 150600,
                        "id": 150603,
                        "value": "150603",
                        "label": "康巴什区"
                    },
                    {
                        "pid": 150600,
                        "id": 150621,
                        "value": "150621",
                        "label": "达拉特旗"
                    },
                    {
                        "pid": 150600,
                        "id": 150622,
                        "value": "150622",
                        "label": "准格尔旗"
                    },
                    {
                        "pid": 150600,
                        "id": 150623,
                        "value": "150623",
                        "label": "鄂托克前旗"
                    },
                    {
                        "pid": 150600,
                        "id": 150624,
                        "value": "150624",
                        "label": "鄂托克旗"
                    },
                    {
                        "pid": 150600,
                        "id": 150625,
                        "value": "150625",
                        "label": "杭锦旗"
                    },
                    {
                        "pid": 150600,
                        "id": 150626,
                        "value": "150626",
                        "label": "乌审旗"
                    },
                    {
                        "pid": 150600,
                        "id": 150627,
                        "value": "150627",
                        "label": "伊金霍洛旗"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 150700,
                "value": "150700",
                "label": "呼伦贝尔市",
                "children": [
                    {
                        "pid": 150700,
                        "id": 150702,
                        "value": "150702",
                        "label": "海拉尔区"
                    },
                    {
                        "pid": 150700,
                        "id": 150703,
                        "value": "150703",
                        "label": "扎赉诺尔区"
                    },
                    {
                        "pid": 150700,
                        "id": 150721,
                        "value": "150721",
                        "label": "阿荣旗"
                    },
                    {
                        "pid": 150700,
                        "id": 150722,
                        "value": "150722",
                        "label": "莫力达瓦达斡尔族自治旗"
                    },
                    {
                        "pid": 150700,
                        "id": 150723,
                        "value": "150723",
                        "label": "鄂伦春自治旗"
                    },
                    {
                        "pid": 150700,
                        "id": 150724,
                        "value": "150724",
                        "label": "鄂温克族自治旗"
                    },
                    {
                        "pid": 150700,
                        "id": 150725,
                        "value": "150725",
                        "label": "陈巴尔虎旗"
                    },
                    {
                        "pid": 150700,
                        "id": 150726,
                        "value": "150726",
                        "label": "新巴尔虎左旗"
                    },
                    {
                        "pid": 150700,
                        "id": 150727,
                        "value": "150727",
                        "label": "新巴尔虎右旗"
                    },
                    {
                        "pid": 150700,
                        "id": 150781,
                        "value": "150781",
                        "label": "满洲里市"
                    },
                    {
                        "pid": 150700,
                        "id": 150782,
                        "value": "150782",
                        "label": "牙克石市"
                    },
                    {
                        "pid": 150700,
                        "id": 150783,
                        "value": "150783",
                        "label": "扎兰屯市"
                    },
                    {
                        "pid": 150700,
                        "id": 150784,
                        "value": "150784",
                        "label": "额尔古纳市"
                    },
                    {
                        "pid": 150700,
                        "id": 150785,
                        "value": "150785",
                        "label": "根河市"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 150800,
                "value": "150800",
                "label": "巴彦淖尔市",
                "children": [
                    {
                        "pid": 150800,
                        "id": 150802,
                        "value": "150802",
                        "label": "临河区"
                    },
                    {
                        "pid": 150800,
                        "id": 150821,
                        "value": "150821",
                        "label": "五原县"
                    },
                    {
                        "pid": 150800,
                        "id": 150822,
                        "value": "150822",
                        "label": "磴口县"
                    },
                    {
                        "pid": 150800,
                        "id": 150823,
                        "value": "150823",
                        "label": "乌拉特前旗"
                    },
                    {
                        "pid": 150800,
                        "id": 150824,
                        "value": "150824",
                        "label": "乌拉特中旗"
                    },
                    {
                        "pid": 150800,
                        "id": 150825,
                        "value": "150825",
                        "label": "乌拉特后旗"
                    },
                    {
                        "pid": 150800,
                        "id": 150826,
                        "value": "150826",
                        "label": "杭锦后旗"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 150900,
                "value": "150900",
                "label": "乌兰察布市",
                "children": [
                    {
                        "pid": 150900,
                        "id": 150902,
                        "value": "150902",
                        "label": "集宁区"
                    },
                    {
                        "pid": 150900,
                        "id": 150921,
                        "value": "150921",
                        "label": "卓资县"
                    },
                    {
                        "pid": 150900,
                        "id": 150922,
                        "value": "150922",
                        "label": "化德县"
                    },
                    {
                        "pid": 150900,
                        "id": 150923,
                        "value": "150923",
                        "label": "商都县"
                    },
                    {
                        "pid": 150900,
                        "id": 150924,
                        "value": "150924",
                        "label": "兴和县"
                    },
                    {
                        "pid": 150900,
                        "id": 150925,
                        "value": "150925",
                        "label": "凉城县"
                    },
                    {
                        "pid": 150900,
                        "id": 150926,
                        "value": "150926",
                        "label": "察哈尔右翼前旗"
                    },
                    {
                        "pid": 150900,
                        "id": 150927,
                        "value": "150927",
                        "label": "察哈尔右翼中旗"
                    },
                    {
                        "pid": 150900,
                        "id": 150928,
                        "value": "150928",
                        "label": "察哈尔右翼后旗"
                    },
                    {
                        "pid": 150900,
                        "id": 150929,
                        "value": "150929",
                        "label": "四子王旗"
                    },
                    {
                        "pid": 150900,
                        "id": 150981,
                        "value": "150981",
                        "label": "丰镇市"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 152200,
                "value": "152200",
                "label": "兴安盟",
                "children": [
                    {
                        "pid": 152200,
                        "id": 152201,
                        "value": "152201",
                        "label": "乌兰浩特市"
                    },
                    {
                        "pid": 152200,
                        "id": 152202,
                        "value": "152202",
                        "label": "阿尔山市"
                    },
                    {
                        "pid": 152200,
                        "id": 152221,
                        "value": "152221",
                        "label": "科尔沁右翼前旗"
                    },
                    {
                        "pid": 152200,
                        "id": 152222,
                        "value": "152222",
                        "label": "科尔沁右翼中旗"
                    },
                    {
                        "pid": 152200,
                        "id": 152223,
                        "value": "152223",
                        "label": "扎赉特旗"
                    },
                    {
                        "pid": 152200,
                        "id": 152224,
                        "value": "152224",
                        "label": "突泉县"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 152500,
                "value": "152500",
                "label": "锡林郭勒盟",
                "children": [
                    {
                        "pid": 152500,
                        "id": 152501,
                        "value": "152501",
                        "label": "二连浩特市"
                    },
                    {
                        "pid": 152500,
                        "id": 152502,
                        "value": "152502",
                        "label": "锡林浩特市"
                    },
                    {
                        "pid": 152500,
                        "id": 152522,
                        "value": "152522",
                        "label": "阿巴嘎旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152523,
                        "value": "152523",
                        "label": "苏尼特左旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152524,
                        "value": "152524",
                        "label": "苏尼特右旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152525,
                        "value": "152525",
                        "label": "东乌珠穆沁旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152526,
                        "value": "152526",
                        "label": "西乌珠穆沁旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152527,
                        "value": "152527",
                        "label": "太仆寺旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152528,
                        "value": "152528",
                        "label": "镶黄旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152529,
                        "value": "152529",
                        "label": "正镶白旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152530,
                        "value": "152530",
                        "label": "正蓝旗"
                    },
                    {
                        "pid": 152500,
                        "id": 152531,
                        "value": "152531",
                        "label": "多伦县"
                    }
                ]
            },
            {
                "pid": 150000,
                "id": 152900,
                "value": "152900",
                "label": "阿拉善盟",
                "children": [
                    {
                        "pid": 152900,
                        "id": 152921,
                        "value": "152921",
                        "label": "阿拉善左旗"
                    },
                    {
                        "pid": 152900,
                        "id": 152922,
                        "value": "152922",
                        "label": "阿拉善右旗"
                    },
                    {
                        "pid": 152900,
                        "id": 152923,
                        "value": "152923",
                        "label": "额济纳旗"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 210000,
        "value": "210000",
        "label": "辽宁省",
        "children": [
            {
                "pid": 210000,
                "id": 210100,
                "value": "210100",
                "label": "沈阳市",
                "children": [
                    {
                        "pid": 210100,
                        "id": 210102,
                        "value": "210102",
                        "label": "和平区"
                    },
                    {
                        "pid": 210100,
                        "id": 210103,
                        "value": "210103",
                        "label": "沈河区"
                    },
                    {
                        "pid": 210100,
                        "id": 210104,
                        "value": "210104",
                        "label": "大东区"
                    },
                    {
                        "pid": 210100,
                        "id": 210105,
                        "value": "210105",
                        "label": "皇姑区"
                    },
                    {
                        "pid": 210100,
                        "id": 210106,
                        "value": "210106",
                        "label": "铁西区"
                    },
                    {
                        "pid": 210100,
                        "id": 210111,
                        "value": "210111",
                        "label": "苏家屯区"
                    },
                    {
                        "pid": 210100,
                        "id": 210112,
                        "value": "210112",
                        "label": "浑南区"
                    },
                    {
                        "pid": 210100,
                        "id": 210113,
                        "value": "210113",
                        "label": "沈北新区"
                    },
                    {
                        "pid": 210100,
                        "id": 210114,
                        "value": "210114",
                        "label": "于洪区"
                    },
                    {
                        "pid": 210100,
                        "id": 210115,
                        "value": "210115",
                        "label": "辽中区"
                    },
                    {
                        "pid": 210100,
                        "id": 210123,
                        "value": "210123",
                        "label": "康平县"
                    },
                    {
                        "pid": 210100,
                        "id": 210124,
                        "value": "210124",
                        "label": "法库县"
                    },
                    {
                        "pid": 210100,
                        "id": 210181,
                        "value": "210181",
                        "label": "新民市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 210200,
                "value": "210200",
                "label": "大连市",
                "children": [
                    {
                        "pid": 210200,
                        "id": 210202,
                        "value": "210202",
                        "label": "中山区"
                    },
                    {
                        "pid": 210200,
                        "id": 210203,
                        "value": "210203",
                        "label": "西岗区"
                    },
                    {
                        "pid": 210200,
                        "id": 210204,
                        "value": "210204",
                        "label": "沙河口区"
                    },
                    {
                        "pid": 210200,
                        "id": 210211,
                        "value": "210211",
                        "label": "甘井子区"
                    },
                    {
                        "pid": 210200,
                        "id": 210212,
                        "value": "210212",
                        "label": "旅顺口区"
                    },
                    {
                        "pid": 210200,
                        "id": 210213,
                        "value": "210213",
                        "label": "金州区"
                    },
                    {
                        "pid": 210200,
                        "id": 210214,
                        "value": "210214",
                        "label": "普兰店区"
                    },
                    {
                        "pid": 210200,
                        "id": 210224,
                        "value": "210224",
                        "label": "长海县"
                    },
                    {
                        "pid": 210200,
                        "id": 210281,
                        "value": "210281",
                        "label": "瓦房店市"
                    },
                    {
                        "pid": 210200,
                        "id": 210283,
                        "value": "210283",
                        "label": "庄河市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 210300,
                "value": "210300",
                "label": "鞍山市",
                "children": [
                    {
                        "pid": 210300,
                        "id": 210302,
                        "value": "210302",
                        "label": "铁东区"
                    },
                    {
                        "pid": 210300,
                        "id": 210303,
                        "value": "210303",
                        "label": "铁西区"
                    },
                    {
                        "pid": 210300,
                        "id": 210304,
                        "value": "210304",
                        "label": "立山区"
                    },
                    {
                        "pid": 210300,
                        "id": 210311,
                        "value": "210311",
                        "label": "千山区"
                    },
                    {
                        "pid": 210300,
                        "id": 210321,
                        "value": "210321",
                        "label": "台安县"
                    },
                    {
                        "pid": 210300,
                        "id": 210323,
                        "value": "210323",
                        "label": "岫岩满族自治县"
                    },
                    {
                        "pid": 210300,
                        "id": 210381,
                        "value": "210381",
                        "label": "海城市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 210400,
                "value": "210400",
                "label": "抚顺市",
                "children": [
                    {
                        "pid": 210400,
                        "id": 210402,
                        "value": "210402",
                        "label": "新抚区"
                    },
                    {
                        "pid": 210400,
                        "id": 210403,
                        "value": "210403",
                        "label": "东洲区"
                    },
                    {
                        "pid": 210400,
                        "id": 210404,
                        "value": "210404",
                        "label": "望花区"
                    },
                    {
                        "pid": 210400,
                        "id": 210411,
                        "value": "210411",
                        "label": "顺城区"
                    },
                    {
                        "pid": 210400,
                        "id": 210421,
                        "value": "210421",
                        "label": "抚顺县"
                    },
                    {
                        "pid": 210400,
                        "id": 210422,
                        "value": "210422",
                        "label": "新宾满族自治县"
                    },
                    {
                        "pid": 210400,
                        "id": 210423,
                        "value": "210423",
                        "label": "清原满族自治县"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 210500,
                "value": "210500",
                "label": "本溪市",
                "children": [
                    {
                        "pid": 210500,
                        "id": 210502,
                        "value": "210502",
                        "label": "平山区"
                    },
                    {
                        "pid": 210500,
                        "id": 210503,
                        "value": "210503",
                        "label": "溪湖区"
                    },
                    {
                        "pid": 210500,
                        "id": 210504,
                        "value": "210504",
                        "label": "明山区"
                    },
                    {
                        "pid": 210500,
                        "id": 210505,
                        "value": "210505",
                        "label": "南芬区"
                    },
                    {
                        "pid": 210500,
                        "id": 210521,
                        "value": "210521",
                        "label": "本溪满族自治县"
                    },
                    {
                        "pid": 210500,
                        "id": 210522,
                        "value": "210522",
                        "label": "桓仁满族自治县"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 210600,
                "value": "210600",
                "label": "丹东市",
                "children": [
                    {
                        "pid": 210600,
                        "id": 210602,
                        "value": "210602",
                        "label": "元宝区"
                    },
                    {
                        "pid": 210600,
                        "id": 210603,
                        "value": "210603",
                        "label": "振兴区"
                    },
                    {
                        "pid": 210600,
                        "id": 210604,
                        "value": "210604",
                        "label": "振安区"
                    },
                    {
                        "pid": 210600,
                        "id": 210624,
                        "value": "210624",
                        "label": "宽甸满族自治县"
                    },
                    {
                        "pid": 210600,
                        "id": 210681,
                        "value": "210681",
                        "label": "东港市"
                    },
                    {
                        "pid": 210600,
                        "id": 210682,
                        "value": "210682",
                        "label": "凤城市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 210700,
                "value": "210700",
                "label": "锦州市",
                "children": [
                    {
                        "pid": 210700,
                        "id": 210702,
                        "value": "210702",
                        "label": "古塔区"
                    },
                    {
                        "pid": 210700,
                        "id": 210703,
                        "value": "210703",
                        "label": "凌河区"
                    },
                    {
                        "pid": 210700,
                        "id": 210711,
                        "value": "210711",
                        "label": "太和区"
                    },
                    {
                        "pid": 210700,
                        "id": 210726,
                        "value": "210726",
                        "label": "黑山县"
                    },
                    {
                        "pid": 210700,
                        "id": 210727,
                        "value": "210727",
                        "label": "义县"
                    },
                    {
                        "pid": 210700,
                        "id": 210781,
                        "value": "210781",
                        "label": "凌海市"
                    },
                    {
                        "pid": 210700,
                        "id": 210782,
                        "value": "210782",
                        "label": "北镇市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 210800,
                "value": "210800",
                "label": "营口市",
                "children": [
                    {
                        "pid": 210800,
                        "id": 210802,
                        "value": "210802",
                        "label": "站前区"
                    },
                    {
                        "pid": 210800,
                        "id": 210803,
                        "value": "210803",
                        "label": "西市区"
                    },
                    {
                        "pid": 210800,
                        "id": 210804,
                        "value": "210804",
                        "label": "鲅鱼圈区"
                    },
                    {
                        "pid": 210800,
                        "id": 210811,
                        "value": "210811",
                        "label": "老边区"
                    },
                    {
                        "pid": 210800,
                        "id": 210881,
                        "value": "210881",
                        "label": "盖州市"
                    },
                    {
                        "pid": 210800,
                        "id": 210882,
                        "value": "210882",
                        "label": "大石桥市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 210900,
                "value": "210900",
                "label": "阜新市",
                "children": [
                    {
                        "pid": 210900,
                        "id": 210902,
                        "value": "210902",
                        "label": "海州区"
                    },
                    {
                        "pid": 210900,
                        "id": 210903,
                        "value": "210903",
                        "label": "新邱区"
                    },
                    {
                        "pid": 210900,
                        "id": 210904,
                        "value": "210904",
                        "label": "太平区"
                    },
                    {
                        "pid": 210900,
                        "id": 210905,
                        "value": "210905",
                        "label": "清河门区"
                    },
                    {
                        "pid": 210900,
                        "id": 210911,
                        "value": "210911",
                        "label": "细河区"
                    },
                    {
                        "pid": 210900,
                        "id": 210921,
                        "value": "210921",
                        "label": "阜新蒙古族自治县"
                    },
                    {
                        "pid": 210900,
                        "id": 210922,
                        "value": "210922",
                        "label": "彰武县"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 211000,
                "value": "211000",
                "label": "辽阳市",
                "children": [
                    {
                        "pid": 211000,
                        "id": 211002,
                        "value": "211002",
                        "label": "白塔区"
                    },
                    {
                        "pid": 211000,
                        "id": 211003,
                        "value": "211003",
                        "label": "文圣区"
                    },
                    {
                        "pid": 211000,
                        "id": 211004,
                        "value": "211004",
                        "label": "宏伟区"
                    },
                    {
                        "pid": 211000,
                        "id": 211005,
                        "value": "211005",
                        "label": "弓长岭区"
                    },
                    {
                        "pid": 211000,
                        "id": 211011,
                        "value": "211011",
                        "label": "太子河区"
                    },
                    {
                        "pid": 211000,
                        "id": 211021,
                        "value": "211021",
                        "label": "辽阳县"
                    },
                    {
                        "pid": 211000,
                        "id": 211081,
                        "value": "211081",
                        "label": "灯塔市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 211100,
                "value": "211100",
                "label": "盘锦市",
                "children": [
                    {
                        "pid": 211100,
                        "id": 211102,
                        "value": "211102",
                        "label": "双台子区"
                    },
                    {
                        "pid": 211100,
                        "id": 211103,
                        "value": "211103",
                        "label": "兴隆台区"
                    },
                    {
                        "pid": 211100,
                        "id": 211104,
                        "value": "211104",
                        "label": "大洼区"
                    },
                    {
                        "pid": 211100,
                        "id": 211122,
                        "value": "211122",
                        "label": "盘山县"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 211200,
                "value": "211200",
                "label": "铁岭市",
                "children": [
                    {
                        "pid": 211200,
                        "id": 211202,
                        "value": "211202",
                        "label": "银州区"
                    },
                    {
                        "pid": 211200,
                        "id": 211204,
                        "value": "211204",
                        "label": "清河区"
                    },
                    {
                        "pid": 211200,
                        "id": 211221,
                        "value": "211221",
                        "label": "铁岭县"
                    },
                    {
                        "pid": 211200,
                        "id": 211223,
                        "value": "211223",
                        "label": "西丰县"
                    },
                    {
                        "pid": 211200,
                        "id": 211224,
                        "value": "211224",
                        "label": "昌图县"
                    },
                    {
                        "pid": 211200,
                        "id": 211281,
                        "value": "211281",
                        "label": "调兵山市"
                    },
                    {
                        "pid": 211200,
                        "id": 211282,
                        "value": "211282",
                        "label": "开原市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 211300,
                "value": "211300",
                "label": "朝阳市",
                "children": [
                    {
                        "pid": 211300,
                        "id": 211302,
                        "value": "211302",
                        "label": "双塔区"
                    },
                    {
                        "pid": 211300,
                        "id": 211303,
                        "value": "211303",
                        "label": "龙城区"
                    },
                    {
                        "pid": 211300,
                        "id": 211321,
                        "value": "211321",
                        "label": "朝阳县"
                    },
                    {
                        "pid": 211300,
                        "id": 211322,
                        "value": "211322",
                        "label": "建平县"
                    },
                    {
                        "pid": 211300,
                        "id": 211324,
                        "value": "211324",
                        "label": "喀喇沁左翼蒙古族自治县"
                    },
                    {
                        "pid": 211300,
                        "id": 211381,
                        "value": "211381",
                        "label": "北票市"
                    },
                    {
                        "pid": 211300,
                        "id": 211382,
                        "value": "211382",
                        "label": "凌源市"
                    }
                ]
            },
            {
                "pid": 210000,
                "id": 211400,
                "value": "211400",
                "label": "葫芦岛市",
                "children": [
                    {
                        "pid": 211400,
                        "id": 211402,
                        "value": "211402",
                        "label": "连山区"
                    },
                    {
                        "pid": 211400,
                        "id": 211403,
                        "value": "211403",
                        "label": "龙港区"
                    },
                    {
                        "pid": 211400,
                        "id": 211404,
                        "value": "211404",
                        "label": "南票区"
                    },
                    {
                        "pid": 211400,
                        "id": 211421,
                        "value": "211421",
                        "label": "绥中县"
                    },
                    {
                        "pid": 211400,
                        "id": 211422,
                        "value": "211422",
                        "label": "建昌县"
                    },
                    {
                        "pid": 211400,
                        "id": 211481,
                        "value": "211481",
                        "label": "兴城市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 220000,
        "value": "220000",
        "label": "吉林省",
        "children": [
            {
                "pid": 220000,
                "id": 220100,
                "value": "220100",
                "label": "长春市",
                "children": [
                    {
                        "pid": 220100,
                        "id": 220102,
                        "value": "220102",
                        "label": "南关区"
                    },
                    {
                        "pid": 220100,
                        "id": 220103,
                        "value": "220103",
                        "label": "宽城区"
                    },
                    {
                        "pid": 220100,
                        "id": 220104,
                        "value": "220104",
                        "label": "朝阳区"
                    },
                    {
                        "pid": 220100,
                        "id": 220105,
                        "value": "220105",
                        "label": "二道区"
                    },
                    {
                        "pid": 220100,
                        "id": 220106,
                        "value": "220106",
                        "label": "绿园区"
                    },
                    {
                        "pid": 220100,
                        "id": 220112,
                        "value": "220112",
                        "label": "双阳区"
                    },
                    {
                        "pid": 220100,
                        "id": 220113,
                        "value": "220113",
                        "label": "九台区"
                    },
                    {
                        "pid": 220100,
                        "id": 220122,
                        "value": "220122",
                        "label": "农安县"
                    },
                    {
                        "pid": 220100,
                        "id": 220182,
                        "value": "220182",
                        "label": "榆树市"
                    },
                    {
                        "pid": 220100,
                        "id": 220183,
                        "value": "220183",
                        "label": "德惠市"
                    },
                    {
                        "pid": 220100,
                        "id": 220184,
                        "value": "220184",
                        "label": "公主岭市"
                    }
                ]
            },
            {
                "pid": 220000,
                "id": 220200,
                "value": "220200",
                "label": "吉林市",
                "children": [
                    {
                        "pid": 220200,
                        "id": 220202,
                        "value": "220202",
                        "label": "昌邑区"
                    },
                    {
                        "pid": 220200,
                        "id": 220203,
                        "value": "220203",
                        "label": "龙潭区"
                    },
                    {
                        "pid": 220200,
                        "id": 220204,
                        "value": "220204",
                        "label": "船营区"
                    },
                    {
                        "pid": 220200,
                        "id": 220211,
                        "value": "220211",
                        "label": "丰满区"
                    },
                    {
                        "pid": 220200,
                        "id": 220221,
                        "value": "220221",
                        "label": "永吉县"
                    },
                    {
                        "pid": 220200,
                        "id": 220281,
                        "value": "220281",
                        "label": "蛟河市"
                    },
                    {
                        "pid": 220200,
                        "id": 220282,
                        "value": "220282",
                        "label": "桦甸市"
                    },
                    {
                        "pid": 220200,
                        "id": 220283,
                        "value": "220283",
                        "label": "舒兰市"
                    },
                    {
                        "pid": 220200,
                        "id": 220284,
                        "value": "220284",
                        "label": "磐石市"
                    }
                ]
            },
            {
                "pid": 220000,
                "id": 220300,
                "value": "220300",
                "label": "四平市",
                "children": [
                    {
                        "pid": 220300,
                        "id": 220302,
                        "value": "220302",
                        "label": "铁西区"
                    },
                    {
                        "pid": 220300,
                        "id": 220303,
                        "value": "220303",
                        "label": "铁东区"
                    },
                    {
                        "pid": 220300,
                        "id": 220322,
                        "value": "220322",
                        "label": "梨树县"
                    },
                    {
                        "pid": 220300,
                        "id": 220323,
                        "value": "220323",
                        "label": "伊通满族自治县"
                    },
                    {
                        "pid": 220300,
                        "id": 220382,
                        "value": "220382",
                        "label": "双辽市"
                    }
                ]
            },
            {
                "pid": 220000,
                "id": 220400,
                "value": "220400",
                "label": "辽源市",
                "children": [
                    {
                        "pid": 220400,
                        "id": 220402,
                        "value": "220402",
                        "label": "龙山区"
                    },
                    {
                        "pid": 220400,
                        "id": 220403,
                        "value": "220403",
                        "label": "西安区"
                    },
                    {
                        "pid": 220400,
                        "id": 220421,
                        "value": "220421",
                        "label": "东丰县"
                    },
                    {
                        "pid": 220400,
                        "id": 220422,
                        "value": "220422",
                        "label": "东辽县"
                    }
                ]
            },
            {
                "pid": 220000,
                "id": 220500,
                "value": "220500",
                "label": "通化市",
                "children": [
                    {
                        "pid": 220500,
                        "id": 220502,
                        "value": "220502",
                        "label": "东昌区"
                    },
                    {
                        "pid": 220500,
                        "id": 220503,
                        "value": "220503",
                        "label": "二道江区"
                    },
                    {
                        "pid": 220500,
                        "id": 220521,
                        "value": "220521",
                        "label": "通化县"
                    },
                    {
                        "pid": 220500,
                        "id": 220523,
                        "value": "220523",
                        "label": "辉南县"
                    },
                    {
                        "pid": 220500,
                        "id": 220524,
                        "value": "220524",
                        "label": "柳河县"
                    },
                    {
                        "pid": 220500,
                        "id": 220581,
                        "value": "220581",
                        "label": "梅河口市"
                    },
                    {
                        "pid": 220500,
                        "id": 220582,
                        "value": "220582",
                        "label": "集安市"
                    }
                ]
            },
            {
                "pid": 220000,
                "id": 220600,
                "value": "220600",
                "label": "白山市",
                "children": [
                    {
                        "pid": 220600,
                        "id": 220602,
                        "value": "220602",
                        "label": "浑江区"
                    },
                    {
                        "pid": 220600,
                        "id": 220605,
                        "value": "220605",
                        "label": "江源区"
                    },
                    {
                        "pid": 220600,
                        "id": 220621,
                        "value": "220621",
                        "label": "抚松县"
                    },
                    {
                        "pid": 220600,
                        "id": 220622,
                        "value": "220622",
                        "label": "靖宇县"
                    },
                    {
                        "pid": 220600,
                        "id": 220623,
                        "value": "220623",
                        "label": "长白朝鲜族自治县"
                    },
                    {
                        "pid": 220600,
                        "id": 220681,
                        "value": "220681",
                        "label": "临江市"
                    }
                ]
            },
            {
                "pid": 220000,
                "id": 220700,
                "value": "220700",
                "label": "松原市",
                "children": [
                    {
                        "pid": 220700,
                        "id": 220702,
                        "value": "220702",
                        "label": "宁江区"
                    },
                    {
                        "pid": 220700,
                        "id": 220721,
                        "value": "220721",
                        "label": "前郭尔罗斯蒙古族自治县"
                    },
                    {
                        "pid": 220700,
                        "id": 220722,
                        "value": "220722",
                        "label": "长岭县"
                    },
                    {
                        "pid": 220700,
                        "id": 220723,
                        "value": "220723",
                        "label": "乾安县"
                    },
                    {
                        "pid": 220700,
                        "id": 220781,
                        "value": "220781",
                        "label": "扶余市"
                    }
                ]
            },
            {
                "pid": 220000,
                "id": 220800,
                "value": "220800",
                "label": "白城市",
                "children": [
                    {
                        "pid": 220800,
                        "id": 220802,
                        "value": "220802",
                        "label": "洮北区"
                    },
                    {
                        "pid": 220800,
                        "id": 220821,
                        "value": "220821",
                        "label": "镇赉县"
                    },
                    {
                        "pid": 220800,
                        "id": 220822,
                        "value": "220822",
                        "label": "通榆县"
                    },
                    {
                        "pid": 220800,
                        "id": 220881,
                        "value": "220881",
                        "label": "洮南市"
                    },
                    {
                        "pid": 220800,
                        "id": 220882,
                        "value": "220882",
                        "label": "大安市"
                    }
                ]
            },
            {
                "pid": 220000,
                "id": 222400,
                "value": "222400",
                "label": "延边朝鲜族自治州",
                "children": [
                    {
                        "pid": 222400,
                        "id": 222401,
                        "value": "222401",
                        "label": "延吉市"
                    },
                    {
                        "pid": 222400,
                        "id": 222402,
                        "value": "222402",
                        "label": "图们市"
                    },
                    {
                        "pid": 222400,
                        "id": 222403,
                        "value": "222403",
                        "label": "敦化市"
                    },
                    {
                        "pid": 222400,
                        "id": 222404,
                        "value": "222404",
                        "label": "珲春市"
                    },
                    {
                        "pid": 222400,
                        "id": 222405,
                        "value": "222405",
                        "label": "龙井市"
                    },
                    {
                        "pid": 222400,
                        "id": 222406,
                        "value": "222406",
                        "label": "和龙市"
                    },
                    {
                        "pid": 222400,
                        "id": 222424,
                        "value": "222424",
                        "label": "汪清县"
                    },
                    {
                        "pid": 222400,
                        "id": 222426,
                        "value": "222426",
                        "label": "安图县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 230000,
        "value": "230000",
        "label": "黑龙江省",
        "children": [
            {
                "pid": 230000,
                "id": 230100,
                "value": "230100",
                "label": "哈尔滨市",
                "children": [
                    {
                        "pid": 230100,
                        "id": 230102,
                        "value": "230102",
                        "label": "道里区"
                    },
                    {
                        "pid": 230100,
                        "id": 230103,
                        "value": "230103",
                        "label": "南岗区"
                    },
                    {
                        "pid": 230100,
                        "id": 230104,
                        "value": "230104",
                        "label": "道外区"
                    },
                    {
                        "pid": 230100,
                        "id": 230108,
                        "value": "230108",
                        "label": "平房区"
                    },
                    {
                        "pid": 230100,
                        "id": 230109,
                        "value": "230109",
                        "label": "松北区"
                    },
                    {
                        "pid": 230100,
                        "id": 230110,
                        "value": "230110",
                        "label": "香坊区"
                    },
                    {
                        "pid": 230100,
                        "id": 230111,
                        "value": "230111",
                        "label": "呼兰区"
                    },
                    {
                        "pid": 230100,
                        "id": 230112,
                        "value": "230112",
                        "label": "阿城区"
                    },
                    {
                        "pid": 230100,
                        "id": 230113,
                        "value": "230113",
                        "label": "双城区"
                    },
                    {
                        "pid": 230100,
                        "id": 230123,
                        "value": "230123",
                        "label": "依兰县"
                    },
                    {
                        "pid": 230100,
                        "id": 230124,
                        "value": "230124",
                        "label": "方正县"
                    },
                    {
                        "pid": 230100,
                        "id": 230125,
                        "value": "230125",
                        "label": "宾县"
                    },
                    {
                        "pid": 230100,
                        "id": 230126,
                        "value": "230126",
                        "label": "巴彦县"
                    },
                    {
                        "pid": 230100,
                        "id": 230127,
                        "value": "230127",
                        "label": "木兰县"
                    },
                    {
                        "pid": 230100,
                        "id": 230128,
                        "value": "230128",
                        "label": "通河县"
                    },
                    {
                        "pid": 230100,
                        "id": 230129,
                        "value": "230129",
                        "label": "延寿县"
                    },
                    {
                        "pid": 230100,
                        "id": 230183,
                        "value": "230183",
                        "label": "尚志市"
                    },
                    {
                        "pid": 230100,
                        "id": 230184,
                        "value": "230184",
                        "label": "五常市"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 230200,
                "value": "230200",
                "label": "齐齐哈尔市",
                "children": [
                    {
                        "pid": 230200,
                        "id": 230202,
                        "value": "230202",
                        "label": "龙沙区"
                    },
                    {
                        "pid": 230200,
                        "id": 230203,
                        "value": "230203",
                        "label": "建华区"
                    },
                    {
                        "pid": 230200,
                        "id": 230204,
                        "value": "230204",
                        "label": "铁锋区"
                    },
                    {
                        "pid": 230200,
                        "id": 230205,
                        "value": "230205",
                        "label": "昂昂溪区"
                    },
                    {
                        "pid": 230200,
                        "id": 230206,
                        "value": "230206",
                        "label": "富拉尔基区"
                    },
                    {
                        "pid": 230200,
                        "id": 230207,
                        "value": "230207",
                        "label": "碾子山区"
                    },
                    {
                        "pid": 230200,
                        "id": 230208,
                        "value": "230208",
                        "label": "梅里斯达斡尔族区"
                    },
                    {
                        "pid": 230200,
                        "id": 230221,
                        "value": "230221",
                        "label": "龙江县"
                    },
                    {
                        "pid": 230200,
                        "id": 230223,
                        "value": "230223",
                        "label": "依安县"
                    },
                    {
                        "pid": 230200,
                        "id": 230224,
                        "value": "230224",
                        "label": "泰来县"
                    },
                    {
                        "pid": 230200,
                        "id": 230225,
                        "value": "230225",
                        "label": "甘南县"
                    },
                    {
                        "pid": 230200,
                        "id": 230227,
                        "value": "230227",
                        "label": "富裕县"
                    },
                    {
                        "pid": 230200,
                        "id": 230229,
                        "value": "230229",
                        "label": "克山县"
                    },
                    {
                        "pid": 230200,
                        "id": 230230,
                        "value": "230230",
                        "label": "克东县"
                    },
                    {
                        "pid": 230200,
                        "id": 230231,
                        "value": "230231",
                        "label": "拜泉县"
                    },
                    {
                        "pid": 230200,
                        "id": 230281,
                        "value": "230281",
                        "label": "讷河市"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 230300,
                "value": "230300",
                "label": "鸡西市",
                "children": [
                    {
                        "pid": 230300,
                        "id": 230302,
                        "value": "230302",
                        "label": "鸡冠区"
                    },
                    {
                        "pid": 230300,
                        "id": 230303,
                        "value": "230303",
                        "label": "恒山区"
                    },
                    {
                        "pid": 230300,
                        "id": 230304,
                        "value": "230304",
                        "label": "滴道区"
                    },
                    {
                        "pid": 230300,
                        "id": 230305,
                        "value": "230305",
                        "label": "梨树区"
                    },
                    {
                        "pid": 230300,
                        "id": 230306,
                        "value": "230306",
                        "label": "城子河区"
                    },
                    {
                        "pid": 230300,
                        "id": 230307,
                        "value": "230307",
                        "label": "麻山区"
                    },
                    {
                        "pid": 230300,
                        "id": 230321,
                        "value": "230321",
                        "label": "鸡东县"
                    },
                    {
                        "pid": 230300,
                        "id": 230381,
                        "value": "230381",
                        "label": "虎林市"
                    },
                    {
                        "pid": 230300,
                        "id": 230382,
                        "value": "230382",
                        "label": "密山市"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 230400,
                "value": "230400",
                "label": "鹤岗市",
                "children": [
                    {
                        "pid": 230400,
                        "id": 230402,
                        "value": "230402",
                        "label": "向阳区"
                    },
                    {
                        "pid": 230400,
                        "id": 230403,
                        "value": "230403",
                        "label": "工农区"
                    },
                    {
                        "pid": 230400,
                        "id": 230404,
                        "value": "230404",
                        "label": "南山区"
                    },
                    {
                        "pid": 230400,
                        "id": 230405,
                        "value": "230405",
                        "label": "兴安区"
                    },
                    {
                        "pid": 230400,
                        "id": 230406,
                        "value": "230406",
                        "label": "东山区"
                    },
                    {
                        "pid": 230400,
                        "id": 230407,
                        "value": "230407",
                        "label": "兴山区"
                    },
                    {
                        "pid": 230400,
                        "id": 230421,
                        "value": "230421",
                        "label": "萝北县"
                    },
                    {
                        "pid": 230400,
                        "id": 230422,
                        "value": "230422",
                        "label": "绥滨县"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 230500,
                "value": "230500",
                "label": "双鸭山市",
                "children": [
                    {
                        "pid": 230500,
                        "id": 230502,
                        "value": "230502",
                        "label": "尖山区"
                    },
                    {
                        "pid": 230500,
                        "id": 230503,
                        "value": "230503",
                        "label": "岭东区"
                    },
                    {
                        "pid": 230500,
                        "id": 230505,
                        "value": "230505",
                        "label": "四方台区"
                    },
                    {
                        "pid": 230500,
                        "id": 230506,
                        "value": "230506",
                        "label": "宝山区"
                    },
                    {
                        "pid": 230500,
                        "id": 230521,
                        "value": "230521",
                        "label": "集贤县"
                    },
                    {
                        "pid": 230500,
                        "id": 230522,
                        "value": "230522",
                        "label": "友谊县"
                    },
                    {
                        "pid": 230500,
                        "id": 230523,
                        "value": "230523",
                        "label": "宝清县"
                    },
                    {
                        "pid": 230500,
                        "id": 230524,
                        "value": "230524",
                        "label": "饶河县"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 230600,
                "value": "230600",
                "label": "大庆市",
                "children": [
                    {
                        "pid": 230600,
                        "id": 230602,
                        "value": "230602",
                        "label": "萨尔图区"
                    },
                    {
                        "pid": 230600,
                        "id": 230603,
                        "value": "230603",
                        "label": "龙凤区"
                    },
                    {
                        "pid": 230600,
                        "id": 230604,
                        "value": "230604",
                        "label": "让胡路区"
                    },
                    {
                        "pid": 230600,
                        "id": 230605,
                        "value": "230605",
                        "label": "红岗区"
                    },
                    {
                        "pid": 230600,
                        "id": 230606,
                        "value": "230606",
                        "label": "大同区"
                    },
                    {
                        "pid": 230600,
                        "id": 230621,
                        "value": "230621",
                        "label": "肇州县"
                    },
                    {
                        "pid": 230600,
                        "id": 230622,
                        "value": "230622",
                        "label": "肇源县"
                    },
                    {
                        "pid": 230600,
                        "id": 230623,
                        "value": "230623",
                        "label": "林甸县"
                    },
                    {
                        "pid": 230600,
                        "id": 230624,
                        "value": "230624",
                        "label": "杜尔伯特蒙古族自治县"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 230700,
                "value": "230700",
                "label": "伊春市",
                "children": [
                    {
                        "pid": 230700,
                        "id": 230717,
                        "value": "230717",
                        "label": "伊美区"
                    },
                    {
                        "pid": 230700,
                        "id": 230718,
                        "value": "230718",
                        "label": "乌翠区"
                    },
                    {
                        "pid": 230700,
                        "id": 230719,
                        "value": "230719",
                        "label": "友好区"
                    },
                    {
                        "pid": 230700,
                        "id": 230722,
                        "value": "230722",
                        "label": "嘉荫县"
                    },
                    {
                        "pid": 230700,
                        "id": 230723,
                        "value": "230723",
                        "label": "汤旺县"
                    },
                    {
                        "pid": 230700,
                        "id": 230724,
                        "value": "230724",
                        "label": "丰林县"
                    },
                    {
                        "pid": 230700,
                        "id": 230725,
                        "value": "230725",
                        "label": "大箐山县"
                    },
                    {
                        "pid": 230700,
                        "id": 230726,
                        "value": "230726",
                        "label": "南岔县"
                    },
                    {
                        "pid": 230700,
                        "id": 230751,
                        "value": "230751",
                        "label": "金林区"
                    },
                    {
                        "pid": 230700,
                        "id": 230781,
                        "value": "230781",
                        "label": "铁力市"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 230800,
                "value": "230800",
                "label": "佳木斯市",
                "children": [
                    {
                        "pid": 230800,
                        "id": 230803,
                        "value": "230803",
                        "label": "向阳区"
                    },
                    {
                        "pid": 230800,
                        "id": 230804,
                        "value": "230804",
                        "label": "前进区"
                    },
                    {
                        "pid": 230800,
                        "id": 230805,
                        "value": "230805",
                        "label": "东风区"
                    },
                    {
                        "pid": 230800,
                        "id": 230811,
                        "value": "230811",
                        "label": "郊区"
                    },
                    {
                        "pid": 230800,
                        "id": 230822,
                        "value": "230822",
                        "label": "桦南县"
                    },
                    {
                        "pid": 230800,
                        "id": 230826,
                        "value": "230826",
                        "label": "桦川县"
                    },
                    {
                        "pid": 230800,
                        "id": 230828,
                        "value": "230828",
                        "label": "汤原县"
                    },
                    {
                        "pid": 230800,
                        "id": 230881,
                        "value": "230881",
                        "label": "同江市"
                    },
                    {
                        "pid": 230800,
                        "id": 230882,
                        "value": "230882",
                        "label": "富锦市"
                    },
                    {
                        "pid": 230800,
                        "id": 230883,
                        "value": "230883",
                        "label": "抚远市"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 230900,
                "value": "230900",
                "label": "七台河市",
                "children": [
                    {
                        "pid": 230900,
                        "id": 230902,
                        "value": "230902",
                        "label": "新兴区"
                    },
                    {
                        "pid": 230900,
                        "id": 230903,
                        "value": "230903",
                        "label": "桃山区"
                    },
                    {
                        "pid": 230900,
                        "id": 230904,
                        "value": "230904",
                        "label": "茄子河区"
                    },
                    {
                        "pid": 230900,
                        "id": 230921,
                        "value": "230921",
                        "label": "勃利县"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 231000,
                "value": "231000",
                "label": "牡丹江市",
                "children": [
                    {
                        "pid": 231000,
                        "id": 231002,
                        "value": "231002",
                        "label": "东安区"
                    },
                    {
                        "pid": 231000,
                        "id": 231003,
                        "value": "231003",
                        "label": "阳明区"
                    },
                    {
                        "pid": 231000,
                        "id": 231004,
                        "value": "231004",
                        "label": "爱民区"
                    },
                    {
                        "pid": 231000,
                        "id": 231005,
                        "value": "231005",
                        "label": "西安区"
                    },
                    {
                        "pid": 231000,
                        "id": 231025,
                        "value": "231025",
                        "label": "林口县"
                    },
                    {
                        "pid": 231000,
                        "id": 231081,
                        "value": "231081",
                        "label": "绥芬河市"
                    },
                    {
                        "pid": 231000,
                        "id": 231083,
                        "value": "231083",
                        "label": "海林市"
                    },
                    {
                        "pid": 231000,
                        "id": 231084,
                        "value": "231084",
                        "label": "宁安市"
                    },
                    {
                        "pid": 231000,
                        "id": 231085,
                        "value": "231085",
                        "label": "穆棱市"
                    },
                    {
                        "pid": 231000,
                        "id": 231086,
                        "value": "231086",
                        "label": "东宁市"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 231100,
                "value": "231100",
                "label": "黑河市",
                "children": [
                    {
                        "pid": 231100,
                        "id": 231102,
                        "value": "231102",
                        "label": "爱辉区"
                    },
                    {
                        "pid": 231100,
                        "id": 231123,
                        "value": "231123",
                        "label": "逊克县"
                    },
                    {
                        "pid": 231100,
                        "id": 231124,
                        "value": "231124",
                        "label": "孙吴县"
                    },
                    {
                        "pid": 231100,
                        "id": 231181,
                        "value": "231181",
                        "label": "北安市"
                    },
                    {
                        "pid": 231100,
                        "id": 231182,
                        "value": "231182",
                        "label": "五大连池市"
                    },
                    {
                        "pid": 231100,
                        "id": 231183,
                        "value": "231183",
                        "label": "嫩江市"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 231200,
                "value": "231200",
                "label": "绥化市",
                "children": [
                    {
                        "pid": 231200,
                        "id": 231202,
                        "value": "231202",
                        "label": "北林区"
                    },
                    {
                        "pid": 231200,
                        "id": 231221,
                        "value": "231221",
                        "label": "望奎县"
                    },
                    {
                        "pid": 231200,
                        "id": 231222,
                        "value": "231222",
                        "label": "兰西县"
                    },
                    {
                        "pid": 231200,
                        "id": 231223,
                        "value": "231223",
                        "label": "青冈县"
                    },
                    {
                        "pid": 231200,
                        "id": 231224,
                        "value": "231224",
                        "label": "庆安县"
                    },
                    {
                        "pid": 231200,
                        "id": 231225,
                        "value": "231225",
                        "label": "明水县"
                    },
                    {
                        "pid": 231200,
                        "id": 231226,
                        "value": "231226",
                        "label": "绥棱县"
                    },
                    {
                        "pid": 231200,
                        "id": 231281,
                        "value": "231281",
                        "label": "安达市"
                    },
                    {
                        "pid": 231200,
                        "id": 231282,
                        "value": "231282",
                        "label": "肇东市"
                    },
                    {
                        "pid": 231200,
                        "id": 231283,
                        "value": "231283",
                        "label": "海伦市"
                    }
                ]
            },
            {
                "pid": 230000,
                "id": 232700,
                "value": "232700",
                "label": "大兴安岭地区",
                "children": [
                    {
                        "pid": 232700,
                        "id": 232701,
                        "value": "232701",
                        "label": "漠河市"
                    },
                    {
                        "pid": 232700,
                        "id": 232721,
                        "value": "232721",
                        "label": "呼玛县"
                    },
                    {
                        "pid": 232700,
                        "id": 232722,
                        "value": "232722",
                        "label": "塔河县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 310000,
        "value": "310000",
        "label": "上海市",
        "children": [
            {
                "pid": 310000,
                "id": 310101,
                "value": "310101",
                "label": "黄浦区"
            },
            {
                "pid": 310000,
                "id": 310104,
                "value": "310104",
                "label": "徐汇区"
            },
            {
                "pid": 310000,
                "id": 310105,
                "value": "310105",
                "label": "长宁区"
            },
            {
                "pid": 310000,
                "id": 310106,
                "value": "310106",
                "label": "静安区"
            },
            {
                "pid": 310000,
                "id": 310107,
                "value": "310107",
                "label": "普陀区"
            },
            {
                "pid": 310000,
                "id": 310109,
                "value": "310109",
                "label": "虹口区"
            },
            {
                "pid": 310000,
                "id": 310110,
                "value": "310110",
                "label": "杨浦区"
            },
            {
                "pid": 310000,
                "id": 310112,
                "value": "310112",
                "label": "闵行区"
            },
            {
                "pid": 310000,
                "id": 310113,
                "value": "310113",
                "label": "宝山区"
            },
            {
                "pid": 310000,
                "id": 310114,
                "value": "310114",
                "label": "嘉定区"
            },
            {
                "pid": 310000,
                "id": 310115,
                "value": "310115",
                "label": "浦东新区"
            },
            {
                "pid": 310000,
                "id": 310116,
                "value": "310116",
                "label": "金山区"
            },
            {
                "pid": 310000,
                "id": 310117,
                "value": "310117",
                "label": "松江区"
            },
            {
                "pid": 310000,
                "id": 310118,
                "value": "310118",
                "label": "青浦区"
            },
            {
                "pid": 310000,
                "id": 310120,
                "value": "310120",
                "label": "奉贤区"
            },
            {
                "pid": 310000,
                "id": 310151,
                "value": "310151",
                "label": "崇明区"
            }
        ]
    },
    {
        "pid": -1,
        "id": 320000,
        "value": "320000",
        "label": "江苏省",
        "children": [
            {
                "pid": 320000,
                "id": 320100,
                "value": "320100",
                "label": "南京市",
                "children": [
                    {
                        "pid": 320100,
                        "id": 320102,
                        "value": "320102",
                        "label": "玄武区"
                    },
                    {
                        "pid": 320100,
                        "id": 320104,
                        "value": "320104",
                        "label": "秦淮区"
                    },
                    {
                        "pid": 320100,
                        "id": 320105,
                        "value": "320105",
                        "label": "建邺区"
                    },
                    {
                        "pid": 320100,
                        "id": 320106,
                        "value": "320106",
                        "label": "鼓楼区"
                    },
                    {
                        "pid": 320100,
                        "id": 320111,
                        "value": "320111",
                        "label": "浦口区"
                    },
                    {
                        "pid": 320100,
                        "id": 320113,
                        "value": "320113",
                        "label": "栖霞区"
                    },
                    {
                        "pid": 320100,
                        "id": 320114,
                        "value": "320114",
                        "label": "雨花台区"
                    },
                    {
                        "pid": 320100,
                        "id": 320115,
                        "value": "320115",
                        "label": "江宁区"
                    },
                    {
                        "pid": 320100,
                        "id": 320116,
                        "value": "320116",
                        "label": "六合区"
                    },
                    {
                        "pid": 320100,
                        "id": 320117,
                        "value": "320117",
                        "label": "溧水区"
                    },
                    {
                        "pid": 320100,
                        "id": 320118,
                        "value": "320118",
                        "label": "高淳区"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 320200,
                "value": "320200",
                "label": "无锡市",
                "children": [
                    {
                        "pid": 320200,
                        "id": 320205,
                        "value": "320205",
                        "label": "锡山区"
                    },
                    {
                        "pid": 320200,
                        "id": 320206,
                        "value": "320206",
                        "label": "惠山区"
                    },
                    {
                        "pid": 320200,
                        "id": 320211,
                        "value": "320211",
                        "label": "滨湖区"
                    },
                    {
                        "pid": 320200,
                        "id": 320213,
                        "value": "320213",
                        "label": "梁溪区"
                    },
                    {
                        "pid": 320200,
                        "id": 320214,
                        "value": "320214",
                        "label": "新吴区"
                    },
                    {
                        "pid": 320200,
                        "id": 320281,
                        "value": "320281",
                        "label": "江阴市"
                    },
                    {
                        "pid": 320200,
                        "id": 320282,
                        "value": "320282",
                        "label": "宜兴市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 320300,
                "value": "320300",
                "label": "徐州市",
                "children": [
                    {
                        "pid": 320300,
                        "id": 320302,
                        "value": "320302",
                        "label": "鼓楼区"
                    },
                    {
                        "pid": 320300,
                        "id": 320303,
                        "value": "320303",
                        "label": "云龙区"
                    },
                    {
                        "pid": 320300,
                        "id": 320305,
                        "value": "320305",
                        "label": "贾汪区"
                    },
                    {
                        "pid": 320300,
                        "id": 320311,
                        "value": "320311",
                        "label": "泉山区"
                    },
                    {
                        "pid": 320300,
                        "id": 320312,
                        "value": "320312",
                        "label": "铜山区"
                    },
                    {
                        "pid": 320300,
                        "id": 320321,
                        "value": "320321",
                        "label": "丰县"
                    },
                    {
                        "pid": 320300,
                        "id": 320322,
                        "value": "320322",
                        "label": "沛县"
                    },
                    {
                        "pid": 320300,
                        "id": 320324,
                        "value": "320324",
                        "label": "睢宁县"
                    },
                    {
                        "pid": 320300,
                        "id": 320381,
                        "value": "320381",
                        "label": "新沂市"
                    },
                    {
                        "pid": 320300,
                        "id": 320382,
                        "value": "320382",
                        "label": "邳州市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 320400,
                "value": "320400",
                "label": "常州市",
                "children": [
                    {
                        "pid": 320400,
                        "id": 320402,
                        "value": "320402",
                        "label": "天宁区"
                    },
                    {
                        "pid": 320400,
                        "id": 320404,
                        "value": "320404",
                        "label": "钟楼区"
                    },
                    {
                        "pid": 320400,
                        "id": 320411,
                        "value": "320411",
                        "label": "新北区"
                    },
                    {
                        "pid": 320400,
                        "id": 320412,
                        "value": "320412",
                        "label": "武进区"
                    },
                    {
                        "pid": 320400,
                        "id": 320413,
                        "value": "320413",
                        "label": "金坛区"
                    },
                    {
                        "pid": 320400,
                        "id": 320481,
                        "value": "320481",
                        "label": "溧阳市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 320500,
                "value": "320500",
                "label": "苏州市",
                "children": [
                    {
                        "pid": 320500,
                        "id": 320505,
                        "value": "320505",
                        "label": "虎丘区"
                    },
                    {
                        "pid": 320500,
                        "id": 320506,
                        "value": "320506",
                        "label": "吴中区"
                    },
                    {
                        "pid": 320500,
                        "id": 320507,
                        "value": "320507",
                        "label": "相城区"
                    },
                    {
                        "pid": 320500,
                        "id": 320508,
                        "value": "320508",
                        "label": "姑苏区"
                    },
                    {
                        "pid": 320500,
                        "id": 320509,
                        "value": "320509",
                        "label": "吴江区"
                    },
                    {
                        "pid": 320500,
                        "id": 320581,
                        "value": "320581",
                        "label": "常熟市"
                    },
                    {
                        "pid": 320500,
                        "id": 320582,
                        "value": "320582",
                        "label": "张家港市"
                    },
                    {
                        "pid": 320500,
                        "id": 320583,
                        "value": "320583",
                        "label": "昆山市"
                    },
                    {
                        "pid": 320500,
                        "id": 320585,
                        "value": "320585",
                        "label": "太仓市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 320600,
                "value": "320600",
                "label": "南通市",
                "children": [
                    {
                        "pid": 320600,
                        "id": 320602,
                        "value": "320602",
                        "label": "崇川区"
                    },
                    {
                        "pid": 320600,
                        "id": 320611,
                        "value": "320611",
                        "label": "港闸区"
                    },
                    {
                        "pid": 320600,
                        "id": 320612,
                        "value": "320612",
                        "label": "通州区"
                    },
                    {
                        "pid": 320600,
                        "id": 320623,
                        "value": "320623",
                        "label": "如东县"
                    },
                    {
                        "pid": 320600,
                        "id": 320681,
                        "value": "320681",
                        "label": "启东市"
                    },
                    {
                        "pid": 320600,
                        "id": 320682,
                        "value": "320682",
                        "label": "如皋市"
                    },
                    {
                        "pid": 320600,
                        "id": 320684,
                        "value": "320684",
                        "label": "海门市"
                    },
                    {
                        "pid": 320600,
                        "id": 320685,
                        "value": "320685",
                        "label": "海安市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 320700,
                "value": "320700",
                "label": "连云港市",
                "children": [
                    {
                        "pid": 320700,
                        "id": 320703,
                        "value": "320703",
                        "label": "连云区"
                    },
                    {
                        "pid": 320700,
                        "id": 320706,
                        "value": "320706",
                        "label": "海州区"
                    },
                    {
                        "pid": 320700,
                        "id": 320707,
                        "value": "320707",
                        "label": "赣榆区"
                    },
                    {
                        "pid": 320700,
                        "id": 320722,
                        "value": "320722",
                        "label": "东海县"
                    },
                    {
                        "pid": 320700,
                        "id": 320723,
                        "value": "320723",
                        "label": "灌云县"
                    },
                    {
                        "pid": 320700,
                        "id": 320724,
                        "value": "320724",
                        "label": "灌南县"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 320800,
                "value": "320800",
                "label": "淮安市",
                "children": [
                    {
                        "pid": 320800,
                        "id": 320803,
                        "value": "320803",
                        "label": "淮安区"
                    },
                    {
                        "pid": 320800,
                        "id": 320804,
                        "value": "320804",
                        "label": "淮阴区"
                    },
                    {
                        "pid": 320800,
                        "id": 320812,
                        "value": "320812",
                        "label": "清江浦区"
                    },
                    {
                        "pid": 320800,
                        "id": 320813,
                        "value": "320813",
                        "label": "洪泽区"
                    },
                    {
                        "pid": 320800,
                        "id": 320826,
                        "value": "320826",
                        "label": "涟水县"
                    },
                    {
                        "pid": 320800,
                        "id": 320830,
                        "value": "320830",
                        "label": "盱眙县"
                    },
                    {
                        "pid": 320800,
                        "id": 320831,
                        "value": "320831",
                        "label": "金湖县"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 320900,
                "value": "320900",
                "label": "盐城市",
                "children": [
                    {
                        "pid": 320900,
                        "id": 320902,
                        "value": "320902",
                        "label": "亭湖区"
                    },
                    {
                        "pid": 320900,
                        "id": 320903,
                        "value": "320903",
                        "label": "盐都区"
                    },
                    {
                        "pid": 320900,
                        "id": 320904,
                        "value": "320904",
                        "label": "大丰区"
                    },
                    {
                        "pid": 320900,
                        "id": 320921,
                        "value": "320921",
                        "label": "响水县"
                    },
                    {
                        "pid": 320900,
                        "id": 320922,
                        "value": "320922",
                        "label": "滨海县"
                    },
                    {
                        "pid": 320900,
                        "id": 320923,
                        "value": "320923",
                        "label": "阜宁县"
                    },
                    {
                        "pid": 320900,
                        "id": 320924,
                        "value": "320924",
                        "label": "射阳县"
                    },
                    {
                        "pid": 320900,
                        "id": 320925,
                        "value": "320925",
                        "label": "建湖县"
                    },
                    {
                        "pid": 320900,
                        "id": 320981,
                        "value": "320981",
                        "label": "东台市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 321000,
                "value": "321000",
                "label": "扬州市",
                "children": [
                    {
                        "pid": 321000,
                        "id": 321002,
                        "value": "321002",
                        "label": "广陵区"
                    },
                    {
                        "pid": 321000,
                        "id": 321003,
                        "value": "321003",
                        "label": "邗江区"
                    },
                    {
                        "pid": 321000,
                        "id": 321012,
                        "value": "321012",
                        "label": "江都区"
                    },
                    {
                        "pid": 321000,
                        "id": 321023,
                        "value": "321023",
                        "label": "宝应县"
                    },
                    {
                        "pid": 321000,
                        "id": 321081,
                        "value": "321081",
                        "label": "仪征市"
                    },
                    {
                        "pid": 321000,
                        "id": 321084,
                        "value": "321084",
                        "label": "高邮市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 321100,
                "value": "321100",
                "label": "镇江市",
                "children": [
                    {
                        "pid": 321100,
                        "id": 321102,
                        "value": "321102",
                        "label": "京口区"
                    },
                    {
                        "pid": 321100,
                        "id": 321111,
                        "value": "321111",
                        "label": "润州区"
                    },
                    {
                        "pid": 321100,
                        "id": 321112,
                        "value": "321112",
                        "label": "丹徒区"
                    },
                    {
                        "pid": 321100,
                        "id": 321181,
                        "value": "321181",
                        "label": "丹阳市"
                    },
                    {
                        "pid": 321100,
                        "id": 321182,
                        "value": "321182",
                        "label": "扬中市"
                    },
                    {
                        "pid": 321100,
                        "id": 321183,
                        "value": "321183",
                        "label": "句容市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 321200,
                "value": "321200",
                "label": "泰州市",
                "children": [
                    {
                        "pid": 321200,
                        "id": 321202,
                        "value": "321202",
                        "label": "海陵区"
                    },
                    {
                        "pid": 321200,
                        "id": 321203,
                        "value": "321203",
                        "label": "高港区"
                    },
                    {
                        "pid": 321200,
                        "id": 321204,
                        "value": "321204",
                        "label": "姜堰区"
                    },
                    {
                        "pid": 321200,
                        "id": 321281,
                        "value": "321281",
                        "label": "兴化市"
                    },
                    {
                        "pid": 321200,
                        "id": 321282,
                        "value": "321282",
                        "label": "靖江市"
                    },
                    {
                        "pid": 321200,
                        "id": 321283,
                        "value": "321283",
                        "label": "泰兴市"
                    }
                ]
            },
            {
                "pid": 320000,
                "id": 321300,
                "value": "321300",
                "label": "宿迁市",
                "children": [
                    {
                        "pid": 321300,
                        "id": 321302,
                        "value": "321302",
                        "label": "宿城区"
                    },
                    {
                        "pid": 321300,
                        "id": 321311,
                        "value": "321311",
                        "label": "宿豫区"
                    },
                    {
                        "pid": 321300,
                        "id": 321322,
                        "value": "321322",
                        "label": "沭阳县"
                    },
                    {
                        "pid": 321300,
                        "id": 321323,
                        "value": "321323",
                        "label": "泗阳县"
                    },
                    {
                        "pid": 321300,
                        "id": 321324,
                        "value": "321324",
                        "label": "泗洪县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 330000,
        "value": "330000",
        "label": "浙江省",
        "children": [
            {
                "pid": 330000,
                "id": 330100,
                "value": "330100",
                "label": "杭州市",
                "children": [
                    {
                        "pid": 330100,
                        "id": 330102,
                        "value": "330102",
                        "label": "上城区"
                    },
                    {
                        "pid": 330100,
                        "id": 330103,
                        "value": "330103",
                        "label": "下城区"
                    },
                    {
                        "pid": 330100,
                        "id": 330104,
                        "value": "330104",
                        "label": "江干区"
                    },
                    {
                        "pid": 330100,
                        "id": 330105,
                        "value": "330105",
                        "label": "拱墅区"
                    },
                    {
                        "pid": 330100,
                        "id": 330106,
                        "value": "330106",
                        "label": "西湖区"
                    },
                    {
                        "pid": 330100,
                        "id": 330108,
                        "value": "330108",
                        "label": "滨江区"
                    },
                    {
                        "pid": 330100,
                        "id": 330109,
                        "value": "330109",
                        "label": "萧山区"
                    },
                    {
                        "pid": 330100,
                        "id": 330110,
                        "value": "330110",
                        "label": "余杭区"
                    },
                    {
                        "pid": 330100,
                        "id": 330111,
                        "value": "330111",
                        "label": "富阳区"
                    },
                    {
                        "pid": 330100,
                        "id": 330112,
                        "value": "330112",
                        "label": "临安区"
                    },
                    {
                        "pid": 330100,
                        "id": 330122,
                        "value": "330122",
                        "label": "桐庐县"
                    },
                    {
                        "pid": 330100,
                        "id": 330127,
                        "value": "330127",
                        "label": "淳安县"
                    },
                    {
                        "pid": 330100,
                        "id": 330182,
                        "value": "330182",
                        "label": "建德市"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 330200,
                "value": "330200",
                "label": "宁波市",
                "children": [
                    {
                        "pid": 330200,
                        "id": 330203,
                        "value": "330203",
                        "label": "海曙区"
                    },
                    {
                        "pid": 330200,
                        "id": 330205,
                        "value": "330205",
                        "label": "江北区"
                    },
                    {
                        "pid": 330200,
                        "id": 330206,
                        "value": "330206",
                        "label": "北仑区"
                    },
                    {
                        "pid": 330200,
                        "id": 330211,
                        "value": "330211",
                        "label": "镇海区"
                    },
                    {
                        "pid": 330200,
                        "id": 330212,
                        "value": "330212",
                        "label": "鄞州区"
                    },
                    {
                        "pid": 330200,
                        "id": 330213,
                        "value": "330213",
                        "label": "奉化区"
                    },
                    {
                        "pid": 330200,
                        "id": 330225,
                        "value": "330225",
                        "label": "象山县"
                    },
                    {
                        "pid": 330200,
                        "id": 330226,
                        "value": "330226",
                        "label": "宁海县"
                    },
                    {
                        "pid": 330200,
                        "id": 330281,
                        "value": "330281",
                        "label": "余姚市"
                    },
                    {
                        "pid": 330200,
                        "id": 330282,
                        "value": "330282",
                        "label": "慈溪市"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 330300,
                "value": "330300",
                "label": "温州市",
                "children": [
                    {
                        "pid": 330300,
                        "id": 330302,
                        "value": "330302",
                        "label": "鹿城区"
                    },
                    {
                        "pid": 330300,
                        "id": 330303,
                        "value": "330303",
                        "label": "龙湾区"
                    },
                    {
                        "pid": 330300,
                        "id": 330304,
                        "value": "330304",
                        "label": "瓯海区"
                    },
                    {
                        "pid": 330300,
                        "id": 330305,
                        "value": "330305",
                        "label": "洞头区"
                    },
                    {
                        "pid": 330300,
                        "id": 330324,
                        "value": "330324",
                        "label": "永嘉县"
                    },
                    {
                        "pid": 330300,
                        "id": 330326,
                        "value": "330326",
                        "label": "平阳县"
                    },
                    {
                        "pid": 330300,
                        "id": 330327,
                        "value": "330327",
                        "label": "苍南县"
                    },
                    {
                        "pid": 330300,
                        "id": 330328,
                        "value": "330328",
                        "label": "文成县"
                    },
                    {
                        "pid": 330300,
                        "id": 330329,
                        "value": "330329",
                        "label": "泰顺县"
                    },
                    {
                        "pid": 330300,
                        "id": 330381,
                        "value": "330381",
                        "label": "瑞安市"
                    },
                    {
                        "pid": 330300,
                        "id": 330382,
                        "value": "330382",
                        "label": "乐清市"
                    },
                    {
                        "pid": 330300,
                        "id": 330383,
                        "value": "330383",
                        "label": "龙港市"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 330400,
                "value": "330400",
                "label": "嘉兴市",
                "children": [
                    {
                        "pid": 330400,
                        "id": 330402,
                        "value": "330402",
                        "label": "南湖区"
                    },
                    {
                        "pid": 330400,
                        "id": 330411,
                        "value": "330411",
                        "label": "秀洲区"
                    },
                    {
                        "pid": 330400,
                        "id": 330421,
                        "value": "330421",
                        "label": "嘉善县"
                    },
                    {
                        "pid": 330400,
                        "id": 330424,
                        "value": "330424",
                        "label": "海盐县"
                    },
                    {
                        "pid": 330400,
                        "id": 330481,
                        "value": "330481",
                        "label": "海宁市"
                    },
                    {
                        "pid": 330400,
                        "id": 330482,
                        "value": "330482",
                        "label": "平湖市"
                    },
                    {
                        "pid": 330400,
                        "id": 330483,
                        "value": "330483",
                        "label": "桐乡市"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 330500,
                "value": "330500",
                "label": "湖州市",
                "children": [
                    {
                        "pid": 330500,
                        "id": 330502,
                        "value": "330502",
                        "label": "吴兴区"
                    },
                    {
                        "pid": 330500,
                        "id": 330503,
                        "value": "330503",
                        "label": "南浔区"
                    },
                    {
                        "pid": 330500,
                        "id": 330521,
                        "value": "330521",
                        "label": "德清县"
                    },
                    {
                        "pid": 330500,
                        "id": 330522,
                        "value": "330522",
                        "label": "长兴县"
                    },
                    {
                        "pid": 330500,
                        "id": 330523,
                        "value": "330523",
                        "label": "安吉县"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 330600,
                "value": "330600",
                "label": "绍兴市",
                "children": [
                    {
                        "pid": 330600,
                        "id": 330602,
                        "value": "330602",
                        "label": "越城区"
                    },
                    {
                        "pid": 330600,
                        "id": 330603,
                        "value": "330603",
                        "label": "柯桥区"
                    },
                    {
                        "pid": 330600,
                        "id": 330604,
                        "value": "330604",
                        "label": "上虞区"
                    },
                    {
                        "pid": 330600,
                        "id": 330624,
                        "value": "330624",
                        "label": "新昌县"
                    },
                    {
                        "pid": 330600,
                        "id": 330681,
                        "value": "330681",
                        "label": "诸暨市"
                    },
                    {
                        "pid": 330600,
                        "id": 330683,
                        "value": "330683",
                        "label": "嵊州市"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 330700,
                "value": "330700",
                "label": "金华市",
                "children": [
                    {
                        "pid": 330700,
                        "id": 330702,
                        "value": "330702",
                        "label": "婺城区"
                    },
                    {
                        "pid": 330700,
                        "id": 330703,
                        "value": "330703",
                        "label": "金东区"
                    },
                    {
                        "pid": 330700,
                        "id": 330723,
                        "value": "330723",
                        "label": "武义县"
                    },
                    {
                        "pid": 330700,
                        "id": 330726,
                        "value": "330726",
                        "label": "浦江县"
                    },
                    {
                        "pid": 330700,
                        "id": 330727,
                        "value": "330727",
                        "label": "磐安县"
                    },
                    {
                        "pid": 330700,
                        "id": 330781,
                        "value": "330781",
                        "label": "兰溪市"
                    },
                    {
                        "pid": 330700,
                        "id": 330782,
                        "value": "330782",
                        "label": "义乌市"
                    },
                    {
                        "pid": 330700,
                        "id": 330783,
                        "value": "330783",
                        "label": "东阳市"
                    },
                    {
                        "pid": 330700,
                        "id": 330784,
                        "value": "330784",
                        "label": "永康市"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 330800,
                "value": "330800",
                "label": "衢州市",
                "children": [
                    {
                        "pid": 330800,
                        "id": 330802,
                        "value": "330802",
                        "label": "柯城区"
                    },
                    {
                        "pid": 330800,
                        "id": 330803,
                        "value": "330803",
                        "label": "衢江区"
                    },
                    {
                        "pid": 330800,
                        "id": 330822,
                        "value": "330822",
                        "label": "常山县"
                    },
                    {
                        "pid": 330800,
                        "id": 330824,
                        "value": "330824",
                        "label": "开化县"
                    },
                    {
                        "pid": 330800,
                        "id": 330825,
                        "value": "330825",
                        "label": "龙游县"
                    },
                    {
                        "pid": 330800,
                        "id": 330881,
                        "value": "330881",
                        "label": "江山市"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 330900,
                "value": "330900",
                "label": "舟山市",
                "children": [
                    {
                        "pid": 330900,
                        "id": 330902,
                        "value": "330902",
                        "label": "定海区"
                    },
                    {
                        "pid": 330900,
                        "id": 330903,
                        "value": "330903",
                        "label": "普陀区"
                    },
                    {
                        "pid": 330900,
                        "id": 330921,
                        "value": "330921",
                        "label": "岱山县"
                    },
                    {
                        "pid": 330900,
                        "id": 330922,
                        "value": "330922",
                        "label": "嵊泗县"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 331000,
                "value": "331000",
                "label": "台州市",
                "children": [
                    {
                        "pid": 331000,
                        "id": 331002,
                        "value": "331002",
                        "label": "椒江区"
                    },
                    {
                        "pid": 331000,
                        "id": 331003,
                        "value": "331003",
                        "label": "黄岩区"
                    },
                    {
                        "pid": 331000,
                        "id": 331004,
                        "value": "331004",
                        "label": "路桥区"
                    },
                    {
                        "pid": 331000,
                        "id": 331022,
                        "value": "331022",
                        "label": "三门县"
                    },
                    {
                        "pid": 331000,
                        "id": 331023,
                        "value": "331023",
                        "label": "天台县"
                    },
                    {
                        "pid": 331000,
                        "id": 331024,
                        "value": "331024",
                        "label": "仙居县"
                    },
                    {
                        "pid": 331000,
                        "id": 331081,
                        "value": "331081",
                        "label": "温岭市"
                    },
                    {
                        "pid": 331000,
                        "id": 331082,
                        "value": "331082",
                        "label": "临海市"
                    },
                    {
                        "pid": 331000,
                        "id": 331083,
                        "value": "331083",
                        "label": "玉环市"
                    }
                ]
            },
            {
                "pid": 330000,
                "id": 331100,
                "value": "331100",
                "label": "丽水市",
                "children": [
                    {
                        "pid": 331100,
                        "id": 331102,
                        "value": "331102",
                        "label": "莲都区"
                    },
                    {
                        "pid": 331100,
                        "id": 331121,
                        "value": "331121",
                        "label": "青田县"
                    },
                    {
                        "pid": 331100,
                        "id": 331122,
                        "value": "331122",
                        "label": "缙云县"
                    },
                    {
                        "pid": 331100,
                        "id": 331123,
                        "value": "331123",
                        "label": "遂昌县"
                    },
                    {
                        "pid": 331100,
                        "id": 331124,
                        "value": "331124",
                        "label": "松阳县"
                    },
                    {
                        "pid": 331100,
                        "id": 331125,
                        "value": "331125",
                        "label": "云和县"
                    },
                    {
                        "pid": 331100,
                        "id": 331126,
                        "value": "331126",
                        "label": "庆元县"
                    },
                    {
                        "pid": 331100,
                        "id": 331127,
                        "value": "331127",
                        "label": "景宁畲族自治县"
                    },
                    {
                        "pid": 331100,
                        "id": 331181,
                        "value": "331181",
                        "label": "龙泉市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 340000,
        "value": "340000",
        "label": "安徽省",
        "children": [
            {
                "pid": 340000,
                "id": 340100,
                "value": "340100",
                "label": "合肥市",
                "children": [
                    {
                        "pid": 340100,
                        "id": 340102,
                        "value": "340102",
                        "label": "瑶海区"
                    },
                    {
                        "pid": 340100,
                        "id": 340103,
                        "value": "340103",
                        "label": "庐阳区"
                    },
                    {
                        "pid": 340100,
                        "id": 340104,
                        "value": "340104",
                        "label": "蜀山区"
                    },
                    {
                        "pid": 340100,
                        "id": 340111,
                        "value": "340111",
                        "label": "包河区"
                    },
                    {
                        "pid": 340100,
                        "id": 340121,
                        "value": "340121",
                        "label": "长丰县"
                    },
                    {
                        "pid": 340100,
                        "id": 340122,
                        "value": "340122",
                        "label": "肥东县"
                    },
                    {
                        "pid": 340100,
                        "id": 340123,
                        "value": "340123",
                        "label": "肥西县"
                    },
                    {
                        "pid": 340100,
                        "id": 340124,
                        "value": "340124",
                        "label": "庐江县"
                    },
                    {
                        "pid": 340100,
                        "id": 340181,
                        "value": "340181",
                        "label": "巢湖市"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 340200,
                "value": "340200",
                "label": "芜湖市",
                "children": [
                    {
                        "pid": 340200,
                        "id": 340202,
                        "value": "340202",
                        "label": "镜湖区"
                    },
                    {
                        "pid": 340200,
                        "id": 340207,
                        "value": "340207",
                        "label": "鸠江区"
                    },
                    {
                        "pid": 340200,
                        "id": 340209,
                        "value": "340209",
                        "label": "弋江区"
                    },
                    {
                        "pid": 340200,
                        "id": 340210,
                        "value": "340210",
                        "label": "湾沚区"
                    },
                    {
                        "pid": 340200,
                        "id": 340211,
                        "value": "340211",
                        "label": "繁昌区"
                    },
                    {
                        "pid": 340200,
                        "id": 340223,
                        "value": "340223",
                        "label": "南陵县"
                    },
                    {
                        "pid": 340200,
                        "id": 340281,
                        "value": "340281",
                        "label": "无为市"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 340300,
                "value": "340300",
                "label": "蚌埠市",
                "children": [
                    {
                        "pid": 340300,
                        "id": 340302,
                        "value": "340302",
                        "label": "龙子湖区"
                    },
                    {
                        "pid": 340300,
                        "id": 340303,
                        "value": "340303",
                        "label": "蚌山区"
                    },
                    {
                        "pid": 340300,
                        "id": 340304,
                        "value": "340304",
                        "label": "禹会区"
                    },
                    {
                        "pid": 340300,
                        "id": 340311,
                        "value": "340311",
                        "label": "淮上区"
                    },
                    {
                        "pid": 340300,
                        "id": 340321,
                        "value": "340321",
                        "label": "怀远县"
                    },
                    {
                        "pid": 340300,
                        "id": 340322,
                        "value": "340322",
                        "label": "五河县"
                    },
                    {
                        "pid": 340300,
                        "id": 340323,
                        "value": "340323",
                        "label": "固镇县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 340400,
                "value": "340400",
                "label": "淮南市",
                "children": [
                    {
                        "pid": 340400,
                        "id": 340402,
                        "value": "340402",
                        "label": "大通区"
                    },
                    {
                        "pid": 340400,
                        "id": 340403,
                        "value": "340403",
                        "label": "田家庵区"
                    },
                    {
                        "pid": 340400,
                        "id": 340404,
                        "value": "340404",
                        "label": "谢家集区"
                    },
                    {
                        "pid": 340400,
                        "id": 340405,
                        "value": "340405",
                        "label": "八公山区"
                    },
                    {
                        "pid": 340400,
                        "id": 340406,
                        "value": "340406",
                        "label": "潘集区"
                    },
                    {
                        "pid": 340400,
                        "id": 340421,
                        "value": "340421",
                        "label": "凤台县"
                    },
                    {
                        "pid": 340400,
                        "id": 340422,
                        "value": "340422",
                        "label": "寿县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 340500,
                "value": "340500",
                "label": "马鞍山市",
                "children": [
                    {
                        "pid": 340500,
                        "id": 340503,
                        "value": "340503",
                        "label": "花山区"
                    },
                    {
                        "pid": 340500,
                        "id": 340504,
                        "value": "340504",
                        "label": "雨山区"
                    },
                    {
                        "pid": 340500,
                        "id": 340506,
                        "value": "340506",
                        "label": "博望区"
                    },
                    {
                        "pid": 340500,
                        "id": 340521,
                        "value": "340521",
                        "label": "当涂县"
                    },
                    {
                        "pid": 340500,
                        "id": 340522,
                        "value": "340522",
                        "label": "含山县"
                    },
                    {
                        "pid": 340500,
                        "id": 340523,
                        "value": "340523",
                        "label": "和县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 340600,
                "value": "340600",
                "label": "淮北市",
                "children": [
                    {
                        "pid": 340600,
                        "id": 340602,
                        "value": "340602",
                        "label": "杜集区"
                    },
                    {
                        "pid": 340600,
                        "id": 340603,
                        "value": "340603",
                        "label": "相山区"
                    },
                    {
                        "pid": 340600,
                        "id": 340604,
                        "value": "340604",
                        "label": "烈山区"
                    },
                    {
                        "pid": 340600,
                        "id": 340621,
                        "value": "340621",
                        "label": "濉溪县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 340700,
                "value": "340700",
                "label": "铜陵市",
                "children": [
                    {
                        "pid": 340700,
                        "id": 340705,
                        "value": "340705",
                        "label": "铜官区"
                    },
                    {
                        "pid": 340700,
                        "id": 340706,
                        "value": "340706",
                        "label": "义安区"
                    },
                    {
                        "pid": 340700,
                        "id": 340711,
                        "value": "340711",
                        "label": "郊区"
                    },
                    {
                        "pid": 340700,
                        "id": 340722,
                        "value": "340722",
                        "label": "枞阳县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 340800,
                "value": "340800",
                "label": "安庆市",
                "children": [
                    {
                        "pid": 340800,
                        "id": 340802,
                        "value": "340802",
                        "label": "迎江区"
                    },
                    {
                        "pid": 340800,
                        "id": 340803,
                        "value": "340803",
                        "label": "大观区"
                    },
                    {
                        "pid": 340800,
                        "id": 340811,
                        "value": "340811",
                        "label": "宜秀区"
                    },
                    {
                        "pid": 340800,
                        "id": 340822,
                        "value": "340822",
                        "label": "怀宁县"
                    },
                    {
                        "pid": 340800,
                        "id": 340825,
                        "value": "340825",
                        "label": "太湖县"
                    },
                    {
                        "pid": 340800,
                        "id": 340826,
                        "value": "340826",
                        "label": "宿松县"
                    },
                    {
                        "pid": 340800,
                        "id": 340827,
                        "value": "340827",
                        "label": "望江县"
                    },
                    {
                        "pid": 340800,
                        "id": 340828,
                        "value": "340828",
                        "label": "岳西县"
                    },
                    {
                        "pid": 340800,
                        "id": 340881,
                        "value": "340881",
                        "label": "桐城市"
                    },
                    {
                        "pid": 340800,
                        "id": 340882,
                        "value": "340882",
                        "label": "潜山市"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 341000,
                "value": "341000",
                "label": "黄山市",
                "children": [
                    {
                        "pid": 341000,
                        "id": 341002,
                        "value": "341002",
                        "label": "屯溪区"
                    },
                    {
                        "pid": 341000,
                        "id": 341003,
                        "value": "341003",
                        "label": "黄山区"
                    },
                    {
                        "pid": 341000,
                        "id": 341004,
                        "value": "341004",
                        "label": "徽州区"
                    },
                    {
                        "pid": 341000,
                        "id": 341021,
                        "value": "341021",
                        "label": "歙县"
                    },
                    {
                        "pid": 341000,
                        "id": 341022,
                        "value": "341022",
                        "label": "休宁县"
                    },
                    {
                        "pid": 341000,
                        "id": 341023,
                        "value": "341023",
                        "label": "黟县"
                    },
                    {
                        "pid": 341000,
                        "id": 341024,
                        "value": "341024",
                        "label": "祁门县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 341100,
                "value": "341100",
                "label": "滁州市",
                "children": [
                    {
                        "pid": 341100,
                        "id": 341102,
                        "value": "341102",
                        "label": "琅琊区"
                    },
                    {
                        "pid": 341100,
                        "id": 341103,
                        "value": "341103",
                        "label": "南谯区"
                    },
                    {
                        "pid": 341100,
                        "id": 341122,
                        "value": "341122",
                        "label": "来安县"
                    },
                    {
                        "pid": 341100,
                        "id": 341124,
                        "value": "341124",
                        "label": "全椒县"
                    },
                    {
                        "pid": 341100,
                        "id": 341125,
                        "value": "341125",
                        "label": "定远县"
                    },
                    {
                        "pid": 341100,
                        "id": 341126,
                        "value": "341126",
                        "label": "凤阳县"
                    },
                    {
                        "pid": 341100,
                        "id": 341181,
                        "value": "341181",
                        "label": "天长市"
                    },
                    {
                        "pid": 341100,
                        "id": 341182,
                        "value": "341182",
                        "label": "明光市"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 341200,
                "value": "341200",
                "label": "阜阳市",
                "children": [
                    {
                        "pid": 341200,
                        "id": 341202,
                        "value": "341202",
                        "label": "颍州区"
                    },
                    {
                        "pid": 341200,
                        "id": 341203,
                        "value": "341203",
                        "label": "颍东区"
                    },
                    {
                        "pid": 341200,
                        "id": 341204,
                        "value": "341204",
                        "label": "颍泉区"
                    },
                    {
                        "pid": 341200,
                        "id": 341221,
                        "value": "341221",
                        "label": "临泉县"
                    },
                    {
                        "pid": 341200,
                        "id": 341222,
                        "value": "341222",
                        "label": "太和县"
                    },
                    {
                        "pid": 341200,
                        "id": 341225,
                        "value": "341225",
                        "label": "阜南县"
                    },
                    {
                        "pid": 341200,
                        "id": 341226,
                        "value": "341226",
                        "label": "颍上县"
                    },
                    {
                        "pid": 341200,
                        "id": 341282,
                        "value": "341282",
                        "label": "界首市"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 341300,
                "value": "341300",
                "label": "宿州市",
                "children": [
                    {
                        "pid": 341300,
                        "id": 341302,
                        "value": "341302",
                        "label": "埇桥区"
                    },
                    {
                        "pid": 341300,
                        "id": 341321,
                        "value": "341321",
                        "label": "砀山县"
                    },
                    {
                        "pid": 341300,
                        "id": 341322,
                        "value": "341322",
                        "label": "萧县"
                    },
                    {
                        "pid": 341300,
                        "id": 341323,
                        "value": "341323",
                        "label": "灵璧县"
                    },
                    {
                        "pid": 341300,
                        "id": 341324,
                        "value": "341324",
                        "label": "泗县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 341500,
                "value": "341500",
                "label": "六安市",
                "children": [
                    {
                        "pid": 341500,
                        "id": 341502,
                        "value": "341502",
                        "label": "金安区"
                    },
                    {
                        "pid": 341500,
                        "id": 341503,
                        "value": "341503",
                        "label": "裕安区"
                    },
                    {
                        "pid": 341500,
                        "id": 341504,
                        "value": "341504",
                        "label": "叶集区"
                    },
                    {
                        "pid": 341500,
                        "id": 341522,
                        "value": "341522",
                        "label": "霍邱县"
                    },
                    {
                        "pid": 341500,
                        "id": 341523,
                        "value": "341523",
                        "label": "舒城县"
                    },
                    {
                        "pid": 341500,
                        "id": 341524,
                        "value": "341524",
                        "label": "金寨县"
                    },
                    {
                        "pid": 341500,
                        "id": 341525,
                        "value": "341525",
                        "label": "霍山县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 341600,
                "value": "341600",
                "label": "亳州市",
                "children": [
                    {
                        "pid": 341600,
                        "id": 341602,
                        "value": "341602",
                        "label": "谯城区"
                    },
                    {
                        "pid": 341600,
                        "id": 341621,
                        "value": "341621",
                        "label": "涡阳县"
                    },
                    {
                        "pid": 341600,
                        "id": 341622,
                        "value": "341622",
                        "label": "蒙城县"
                    },
                    {
                        "pid": 341600,
                        "id": 341623,
                        "value": "341623",
                        "label": "利辛县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 341700,
                "value": "341700",
                "label": "池州市",
                "children": [
                    {
                        "pid": 341700,
                        "id": 341702,
                        "value": "341702",
                        "label": "贵池区"
                    },
                    {
                        "pid": 341700,
                        "id": 341721,
                        "value": "341721",
                        "label": "东至县"
                    },
                    {
                        "pid": 341700,
                        "id": 341722,
                        "value": "341722",
                        "label": "石台县"
                    },
                    {
                        "pid": 341700,
                        "id": 341723,
                        "value": "341723",
                        "label": "青阳县"
                    }
                ]
            },
            {
                "pid": 340000,
                "id": 341800,
                "value": "341800",
                "label": "宣城市",
                "children": [
                    {
                        "pid": 341800,
                        "id": 341802,
                        "value": "341802",
                        "label": "宣州区"
                    },
                    {
                        "pid": 341800,
                        "id": 341821,
                        "value": "341821",
                        "label": "郎溪县"
                    },
                    {
                        "pid": 341800,
                        "id": 341823,
                        "value": "341823",
                        "label": "泾县"
                    },
                    {
                        "pid": 341800,
                        "id": 341824,
                        "value": "341824",
                        "label": "绩溪县"
                    },
                    {
                        "pid": 341800,
                        "id": 341825,
                        "value": "341825",
                        "label": "旌德县"
                    },
                    {
                        "pid": 341800,
                        "id": 341881,
                        "value": "341881",
                        "label": "宁国市"
                    },
                    {
                        "pid": 341800,
                        "id": 341882,
                        "value": "341882",
                        "label": "广德市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 350000,
        "value": "350000",
        "label": "福建省",
        "children": [
            {
                "pid": 350000,
                "id": 350100,
                "value": "350100",
                "label": "福州市",
                "children": [
                    {
                        "pid": 350100,
                        "id": 350102,
                        "value": "350102",
                        "label": "鼓楼区"
                    },
                    {
                        "pid": 350100,
                        "id": 350103,
                        "value": "350103",
                        "label": "台江区"
                    },
                    {
                        "pid": 350100,
                        "id": 350104,
                        "value": "350104",
                        "label": "仓山区"
                    },
                    {
                        "pid": 350100,
                        "id": 350105,
                        "value": "350105",
                        "label": "马尾区"
                    },
                    {
                        "pid": 350100,
                        "id": 350111,
                        "value": "350111",
                        "label": "晋安区"
                    },
                    {
                        "pid": 350100,
                        "id": 350112,
                        "value": "350112",
                        "label": "长乐区"
                    },
                    {
                        "pid": 350100,
                        "id": 350121,
                        "value": "350121",
                        "label": "闽侯县"
                    },
                    {
                        "pid": 350100,
                        "id": 350122,
                        "value": "350122",
                        "label": "连江县"
                    },
                    {
                        "pid": 350100,
                        "id": 350123,
                        "value": "350123",
                        "label": "罗源县"
                    },
                    {
                        "pid": 350100,
                        "id": 350124,
                        "value": "350124",
                        "label": "闽清县"
                    },
                    {
                        "pid": 350100,
                        "id": 350125,
                        "value": "350125",
                        "label": "永泰县"
                    },
                    {
                        "pid": 350100,
                        "id": 350128,
                        "value": "350128",
                        "label": "平潭县"
                    },
                    {
                        "pid": 350100,
                        "id": 350181,
                        "value": "350181",
                        "label": "福清市"
                    }
                ]
            },
            {
                "pid": 350000,
                "id": 350200,
                "value": "350200",
                "label": "厦门市",
                "children": [
                    {
                        "pid": 350200,
                        "id": 350203,
                        "value": "350203",
                        "label": "思明区"
                    },
                    {
                        "pid": 350200,
                        "id": 350205,
                        "value": "350205",
                        "label": "海沧区"
                    },
                    {
                        "pid": 350200,
                        "id": 350206,
                        "value": "350206",
                        "label": "湖里区"
                    },
                    {
                        "pid": 350200,
                        "id": 350211,
                        "value": "350211",
                        "label": "集美区"
                    },
                    {
                        "pid": 350200,
                        "id": 350212,
                        "value": "350212",
                        "label": "同安区"
                    },
                    {
                        "pid": 350200,
                        "id": 350213,
                        "value": "350213",
                        "label": "翔安区"
                    }
                ]
            },
            {
                "pid": 350000,
                "id": 350300,
                "value": "350300",
                "label": "莆田市",
                "children": [
                    {
                        "pid": 350300,
                        "id": 350302,
                        "value": "350302",
                        "label": "城厢区"
                    },
                    {
                        "pid": 350300,
                        "id": 350303,
                        "value": "350303",
                        "label": "涵江区"
                    },
                    {
                        "pid": 350300,
                        "id": 350304,
                        "value": "350304",
                        "label": "荔城区"
                    },
                    {
                        "pid": 350300,
                        "id": 350305,
                        "value": "350305",
                        "label": "秀屿区"
                    },
                    {
                        "pid": 350300,
                        "id": 350322,
                        "value": "350322",
                        "label": "仙游县"
                    }
                ]
            },
            {
                "pid": 350000,
                "id": 350400,
                "value": "350400",
                "label": "三明市",
                "children": [
                    {
                        "pid": 350400,
                        "id": 350402,
                        "value": "350402",
                        "label": "梅列区"
                    },
                    {
                        "pid": 350400,
                        "id": 350403,
                        "value": "350403",
                        "label": "三元区"
                    },
                    {
                        "pid": 350400,
                        "id": 350421,
                        "value": "350421",
                        "label": "明溪县"
                    },
                    {
                        "pid": 350400,
                        "id": 350423,
                        "value": "350423",
                        "label": "清流县"
                    },
                    {
                        "pid": 350400,
                        "id": 350424,
                        "value": "350424",
                        "label": "宁化县"
                    },
                    {
                        "pid": 350400,
                        "id": 350425,
                        "value": "350425",
                        "label": "大田县"
                    },
                    {
                        "pid": 350400,
                        "id": 350426,
                        "value": "350426",
                        "label": "尤溪县"
                    },
                    {
                        "pid": 350400,
                        "id": 350427,
                        "value": "350427",
                        "label": "沙县"
                    },
                    {
                        "pid": 350400,
                        "id": 350428,
                        "value": "350428",
                        "label": "将乐县"
                    },
                    {
                        "pid": 350400,
                        "id": 350429,
                        "value": "350429",
                        "label": "泰宁县"
                    },
                    {
                        "pid": 350400,
                        "id": 350430,
                        "value": "350430",
                        "label": "建宁县"
                    },
                    {
                        "pid": 350400,
                        "id": 350481,
                        "value": "350481",
                        "label": "永安市"
                    }
                ]
            },
            {
                "pid": 350000,
                "id": 350500,
                "value": "350500",
                "label": "泉州市",
                "children": [
                    {
                        "pid": 350500,
                        "id": 350502,
                        "value": "350502",
                        "label": "鲤城区"
                    },
                    {
                        "pid": 350500,
                        "id": 350503,
                        "value": "350503",
                        "label": "丰泽区"
                    },
                    {
                        "pid": 350500,
                        "id": 350504,
                        "value": "350504",
                        "label": "洛江区"
                    },
                    {
                        "pid": 350500,
                        "id": 350505,
                        "value": "350505",
                        "label": "泉港区"
                    },
                    {
                        "pid": 350500,
                        "id": 350521,
                        "value": "350521",
                        "label": "惠安县"
                    },
                    {
                        "pid": 350500,
                        "id": 350524,
                        "value": "350524",
                        "label": "安溪县"
                    },
                    {
                        "pid": 350500,
                        "id": 350525,
                        "value": "350525",
                        "label": "永春县"
                    },
                    {
                        "pid": 350500,
                        "id": 350526,
                        "value": "350526",
                        "label": "德化县"
                    },
                    {
                        "pid": 350500,
                        "id": 350527,
                        "value": "350527",
                        "label": "金门县"
                    },
                    {
                        "pid": 350500,
                        "id": 350581,
                        "value": "350581",
                        "label": "石狮市"
                    },
                    {
                        "pid": 350500,
                        "id": 350582,
                        "value": "350582",
                        "label": "晋江市"
                    },
                    {
                        "pid": 350500,
                        "id": 350583,
                        "value": "350583",
                        "label": "南安市"
                    }
                ]
            },
            {
                "pid": 350000,
                "id": 350600,
                "value": "350600",
                "label": "漳州市",
                "children": [
                    {
                        "pid": 350600,
                        "id": 350602,
                        "value": "350602",
                        "label": "芗城区"
                    },
                    {
                        "pid": 350600,
                        "id": 350603,
                        "value": "350603",
                        "label": "龙文区"
                    },
                    {
                        "pid": 350600,
                        "id": 350622,
                        "value": "350622",
                        "label": "云霄县"
                    },
                    {
                        "pid": 350600,
                        "id": 350623,
                        "value": "350623",
                        "label": "漳浦县"
                    },
                    {
                        "pid": 350600,
                        "id": 350624,
                        "value": "350624",
                        "label": "诏安县"
                    },
                    {
                        "pid": 350600,
                        "id": 350625,
                        "value": "350625",
                        "label": "长泰县"
                    },
                    {
                        "pid": 350600,
                        "id": 350626,
                        "value": "350626",
                        "label": "东山县"
                    },
                    {
                        "pid": 350600,
                        "id": 350627,
                        "value": "350627",
                        "label": "南靖县"
                    },
                    {
                        "pid": 350600,
                        "id": 350628,
                        "value": "350628",
                        "label": "平和县"
                    },
                    {
                        "pid": 350600,
                        "id": 350629,
                        "value": "350629",
                        "label": "华安县"
                    },
                    {
                        "pid": 350600,
                        "id": 350681,
                        "value": "350681",
                        "label": "龙海市"
                    }
                ]
            },
            {
                "pid": 350000,
                "id": 350700,
                "value": "350700",
                "label": "南平市",
                "children": [
                    {
                        "pid": 350700,
                        "id": 350702,
                        "value": "350702",
                        "label": "延平区"
                    },
                    {
                        "pid": 350700,
                        "id": 350703,
                        "value": "350703",
                        "label": "建阳区"
                    },
                    {
                        "pid": 350700,
                        "id": 350721,
                        "value": "350721",
                        "label": "顺昌县"
                    },
                    {
                        "pid": 350700,
                        "id": 350722,
                        "value": "350722",
                        "label": "浦城县"
                    },
                    {
                        "pid": 350700,
                        "id": 350723,
                        "value": "350723",
                        "label": "光泽县"
                    },
                    {
                        "pid": 350700,
                        "id": 350724,
                        "value": "350724",
                        "label": "松溪县"
                    },
                    {
                        "pid": 350700,
                        "id": 350725,
                        "value": "350725",
                        "label": "政和县"
                    },
                    {
                        "pid": 350700,
                        "id": 350781,
                        "value": "350781",
                        "label": "邵武市"
                    },
                    {
                        "pid": 350700,
                        "id": 350782,
                        "value": "350782",
                        "label": "武夷山市"
                    },
                    {
                        "pid": 350700,
                        "id": 350783,
                        "value": "350783",
                        "label": "建瓯市"
                    }
                ]
            },
            {
                "pid": 350000,
                "id": 350800,
                "value": "350800",
                "label": "龙岩市",
                "children": [
                    {
                        "pid": 350800,
                        "id": 350802,
                        "value": "350802",
                        "label": "新罗区"
                    },
                    {
                        "pid": 350800,
                        "id": 350803,
                        "value": "350803",
                        "label": "永定区"
                    },
                    {
                        "pid": 350800,
                        "id": 350821,
                        "value": "350821",
                        "label": "长汀县"
                    },
                    {
                        "pid": 350800,
                        "id": 350823,
                        "value": "350823",
                        "label": "上杭县"
                    },
                    {
                        "pid": 350800,
                        "id": 350824,
                        "value": "350824",
                        "label": "武平县"
                    },
                    {
                        "pid": 350800,
                        "id": 350825,
                        "value": "350825",
                        "label": "连城县"
                    },
                    {
                        "pid": 350800,
                        "id": 350881,
                        "value": "350881",
                        "label": "漳平市"
                    }
                ]
            },
            {
                "pid": 350000,
                "id": 350900,
                "value": "350900",
                "label": "宁德市",
                "children": [
                    {
                        "pid": 350900,
                        "id": 350902,
                        "value": "350902",
                        "label": "蕉城区"
                    },
                    {
                        "pid": 350900,
                        "id": 350921,
                        "value": "350921",
                        "label": "霞浦县"
                    },
                    {
                        "pid": 350900,
                        "id": 350922,
                        "value": "350922",
                        "label": "古田县"
                    },
                    {
                        "pid": 350900,
                        "id": 350923,
                        "value": "350923",
                        "label": "屏南县"
                    },
                    {
                        "pid": 350900,
                        "id": 350924,
                        "value": "350924",
                        "label": "寿宁县"
                    },
                    {
                        "pid": 350900,
                        "id": 350925,
                        "value": "350925",
                        "label": "周宁县"
                    },
                    {
                        "pid": 350900,
                        "id": 350926,
                        "value": "350926",
                        "label": "柘荣县"
                    },
                    {
                        "pid": 350900,
                        "id": 350981,
                        "value": "350981",
                        "label": "福安市"
                    },
                    {
                        "pid": 350900,
                        "id": 350982,
                        "value": "350982",
                        "label": "福鼎市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 360000,
        "value": "360000",
        "label": "江西省",
        "children": [
            {
                "pid": 360000,
                "id": 360100,
                "value": "360100",
                "label": "南昌市",
                "children": [
                    {
                        "pid": 360100,
                        "id": 360102,
                        "value": "360102",
                        "label": "东湖区"
                    },
                    {
                        "pid": 360100,
                        "id": 360103,
                        "value": "360103",
                        "label": "西湖区"
                    },
                    {
                        "pid": 360100,
                        "id": 360104,
                        "value": "360104",
                        "label": "青云谱区"
                    },
                    {
                        "pid": 360100,
                        "id": 360111,
                        "value": "360111",
                        "label": "青山湖区"
                    },
                    {
                        "pid": 360100,
                        "id": 360112,
                        "value": "360112",
                        "label": "新建区"
                    },
                    {
                        "pid": 360100,
                        "id": 360113,
                        "value": "360113",
                        "label": "红谷滩区"
                    },
                    {
                        "pid": 360100,
                        "id": 360121,
                        "value": "360121",
                        "label": "南昌县"
                    },
                    {
                        "pid": 360100,
                        "id": 360123,
                        "value": "360123",
                        "label": "安义县"
                    },
                    {
                        "pid": 360100,
                        "id": 360124,
                        "value": "360124",
                        "label": "进贤县"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 360200,
                "value": "360200",
                "label": "景德镇市",
                "children": [
                    {
                        "pid": 360200,
                        "id": 360202,
                        "value": "360202",
                        "label": "昌江区"
                    },
                    {
                        "pid": 360200,
                        "id": 360203,
                        "value": "360203",
                        "label": "珠山区"
                    },
                    {
                        "pid": 360200,
                        "id": 360222,
                        "value": "360222",
                        "label": "浮梁县"
                    },
                    {
                        "pid": 360200,
                        "id": 360281,
                        "value": "360281",
                        "label": "乐平市"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 360300,
                "value": "360300",
                "label": "萍乡市",
                "children": [
                    {
                        "pid": 360300,
                        "id": 360302,
                        "value": "360302",
                        "label": "安源区"
                    },
                    {
                        "pid": 360300,
                        "id": 360313,
                        "value": "360313",
                        "label": "湘东区"
                    },
                    {
                        "pid": 360300,
                        "id": 360321,
                        "value": "360321",
                        "label": "莲花县"
                    },
                    {
                        "pid": 360300,
                        "id": 360322,
                        "value": "360322",
                        "label": "上栗县"
                    },
                    {
                        "pid": 360300,
                        "id": 360323,
                        "value": "360323",
                        "label": "芦溪县"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 360400,
                "value": "360400",
                "label": "九江市",
                "children": [
                    {
                        "pid": 360400,
                        "id": 360402,
                        "value": "360402",
                        "label": "濂溪区"
                    },
                    {
                        "pid": 360400,
                        "id": 360403,
                        "value": "360403",
                        "label": "浔阳区"
                    },
                    {
                        "pid": 360400,
                        "id": 360404,
                        "value": "360404",
                        "label": "柴桑区"
                    },
                    {
                        "pid": 360400,
                        "id": 360423,
                        "value": "360423",
                        "label": "武宁县"
                    },
                    {
                        "pid": 360400,
                        "id": 360424,
                        "value": "360424",
                        "label": "修水县"
                    },
                    {
                        "pid": 360400,
                        "id": 360425,
                        "value": "360425",
                        "label": "永修县"
                    },
                    {
                        "pid": 360400,
                        "id": 360426,
                        "value": "360426",
                        "label": "德安县"
                    },
                    {
                        "pid": 360400,
                        "id": 360428,
                        "value": "360428",
                        "label": "都昌县"
                    },
                    {
                        "pid": 360400,
                        "id": 360429,
                        "value": "360429",
                        "label": "湖口县"
                    },
                    {
                        "pid": 360400,
                        "id": 360430,
                        "value": "360430",
                        "label": "彭泽县"
                    },
                    {
                        "pid": 360400,
                        "id": 360481,
                        "value": "360481",
                        "label": "瑞昌市"
                    },
                    {
                        "pid": 360400,
                        "id": 360482,
                        "value": "360482",
                        "label": "共青城市"
                    },
                    {
                        "pid": 360400,
                        "id": 360483,
                        "value": "360483",
                        "label": "庐山市"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 360500,
                "value": "360500",
                "label": "新余市",
                "children": [
                    {
                        "pid": 360500,
                        "id": 360502,
                        "value": "360502",
                        "label": "渝水区"
                    },
                    {
                        "pid": 360500,
                        "id": 360521,
                        "value": "360521",
                        "label": "分宜县"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 360600,
                "value": "360600",
                "label": "鹰潭市",
                "children": [
                    {
                        "pid": 360600,
                        "id": 360602,
                        "value": "360602",
                        "label": "月湖区"
                    },
                    {
                        "pid": 360600,
                        "id": 360603,
                        "value": "360603",
                        "label": "余江区"
                    },
                    {
                        "pid": 360600,
                        "id": 360681,
                        "value": "360681",
                        "label": "贵溪市"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 360700,
                "value": "360700",
                "label": "赣州市",
                "children": [
                    {
                        "pid": 360700,
                        "id": 360702,
                        "value": "360702",
                        "label": "章贡区"
                    },
                    {
                        "pid": 360700,
                        "id": 360703,
                        "value": "360703",
                        "label": "南康区"
                    },
                    {
                        "pid": 360700,
                        "id": 360704,
                        "value": "360704",
                        "label": "赣县区"
                    },
                    {
                        "pid": 360700,
                        "id": 360722,
                        "value": "360722",
                        "label": "信丰县"
                    },
                    {
                        "pid": 360700,
                        "id": 360723,
                        "value": "360723",
                        "label": "大余县"
                    },
                    {
                        "pid": 360700,
                        "id": 360724,
                        "value": "360724",
                        "label": "上犹县"
                    },
                    {
                        "pid": 360700,
                        "id": 360725,
                        "value": "360725",
                        "label": "崇义县"
                    },
                    {
                        "pid": 360700,
                        "id": 360726,
                        "value": "360726",
                        "label": "安远县"
                    },
                    {
                        "pid": 360700,
                        "id": 360728,
                        "value": "360728",
                        "label": "定南县"
                    },
                    {
                        "pid": 360700,
                        "id": 360729,
                        "value": "360729",
                        "label": "全南县"
                    },
                    {
                        "pid": 360700,
                        "id": 360730,
                        "value": "360730",
                        "label": "宁都县"
                    },
                    {
                        "pid": 360700,
                        "id": 360731,
                        "value": "360731",
                        "label": "于都县"
                    },
                    {
                        "pid": 360700,
                        "id": 360732,
                        "value": "360732",
                        "label": "兴国县"
                    },
                    {
                        "pid": 360700,
                        "id": 360733,
                        "value": "360733",
                        "label": "会昌县"
                    },
                    {
                        "pid": 360700,
                        "id": 360734,
                        "value": "360734",
                        "label": "寻乌县"
                    },
                    {
                        "pid": 360700,
                        "id": 360735,
                        "value": "360735",
                        "label": "石城县"
                    },
                    {
                        "pid": 360700,
                        "id": 360781,
                        "value": "360781",
                        "label": "瑞金市"
                    },
                    {
                        "pid": 360700,
                        "id": 360783,
                        "value": "360783",
                        "label": "龙南市"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 360800,
                "value": "360800",
                "label": "吉安市",
                "children": [
                    {
                        "pid": 360800,
                        "id": 360802,
                        "value": "360802",
                        "label": "吉州区"
                    },
                    {
                        "pid": 360800,
                        "id": 360803,
                        "value": "360803",
                        "label": "青原区"
                    },
                    {
                        "pid": 360800,
                        "id": 360821,
                        "value": "360821",
                        "label": "吉安县"
                    },
                    {
                        "pid": 360800,
                        "id": 360822,
                        "value": "360822",
                        "label": "吉水县"
                    },
                    {
                        "pid": 360800,
                        "id": 360823,
                        "value": "360823",
                        "label": "峡江县"
                    },
                    {
                        "pid": 360800,
                        "id": 360824,
                        "value": "360824",
                        "label": "新干县"
                    },
                    {
                        "pid": 360800,
                        "id": 360825,
                        "value": "360825",
                        "label": "永丰县"
                    },
                    {
                        "pid": 360800,
                        "id": 360826,
                        "value": "360826",
                        "label": "泰和县"
                    },
                    {
                        "pid": 360800,
                        "id": 360827,
                        "value": "360827",
                        "label": "遂川县"
                    },
                    {
                        "pid": 360800,
                        "id": 360828,
                        "value": "360828",
                        "label": "万安县"
                    },
                    {
                        "pid": 360800,
                        "id": 360829,
                        "value": "360829",
                        "label": "安福县"
                    },
                    {
                        "pid": 360800,
                        "id": 360830,
                        "value": "360830",
                        "label": "永新县"
                    },
                    {
                        "pid": 360800,
                        "id": 360881,
                        "value": "360881",
                        "label": "井冈山市"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 360900,
                "value": "360900",
                "label": "宜春市",
                "children": [
                    {
                        "pid": 360900,
                        "id": 360902,
                        "value": "360902",
                        "label": "袁州区"
                    },
                    {
                        "pid": 360900,
                        "id": 360921,
                        "value": "360921",
                        "label": "奉新县"
                    },
                    {
                        "pid": 360900,
                        "id": 360922,
                        "value": "360922",
                        "label": "万载县"
                    },
                    {
                        "pid": 360900,
                        "id": 360923,
                        "value": "360923",
                        "label": "上高县"
                    },
                    {
                        "pid": 360900,
                        "id": 360924,
                        "value": "360924",
                        "label": "宜丰县"
                    },
                    {
                        "pid": 360900,
                        "id": 360925,
                        "value": "360925",
                        "label": "靖安县"
                    },
                    {
                        "pid": 360900,
                        "id": 360926,
                        "value": "360926",
                        "label": "铜鼓县"
                    },
                    {
                        "pid": 360900,
                        "id": 360981,
                        "value": "360981",
                        "label": "丰城市"
                    },
                    {
                        "pid": 360900,
                        "id": 360982,
                        "value": "360982",
                        "label": "樟树市"
                    },
                    {
                        "pid": 360900,
                        "id": 360983,
                        "value": "360983",
                        "label": "高安市"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 361000,
                "value": "361000",
                "label": "抚州市",
                "children": [
                    {
                        "pid": 361000,
                        "id": 361002,
                        "value": "361002",
                        "label": "临川区"
                    },
                    {
                        "pid": 361000,
                        "id": 361003,
                        "value": "361003",
                        "label": "东乡区"
                    },
                    {
                        "pid": 361000,
                        "id": 361021,
                        "value": "361021",
                        "label": "南城县"
                    },
                    {
                        "pid": 361000,
                        "id": 361022,
                        "value": "361022",
                        "label": "黎川县"
                    },
                    {
                        "pid": 361000,
                        "id": 361023,
                        "value": "361023",
                        "label": "南丰县"
                    },
                    {
                        "pid": 361000,
                        "id": 361024,
                        "value": "361024",
                        "label": "崇仁县"
                    },
                    {
                        "pid": 361000,
                        "id": 361025,
                        "value": "361025",
                        "label": "乐安县"
                    },
                    {
                        "pid": 361000,
                        "id": 361026,
                        "value": "361026",
                        "label": "宜黄县"
                    },
                    {
                        "pid": 361000,
                        "id": 361027,
                        "value": "361027",
                        "label": "金溪县"
                    },
                    {
                        "pid": 361000,
                        "id": 361028,
                        "value": "361028",
                        "label": "资溪县"
                    },
                    {
                        "pid": 361000,
                        "id": 361030,
                        "value": "361030",
                        "label": "广昌县"
                    }
                ]
            },
            {
                "pid": 360000,
                "id": 361100,
                "value": "361100",
                "label": "上饶市",
                "children": [
                    {
                        "pid": 361100,
                        "id": 361102,
                        "value": "361102",
                        "label": "信州区"
                    },
                    {
                        "pid": 361100,
                        "id": 361103,
                        "value": "361103",
                        "label": "广丰区"
                    },
                    {
                        "pid": 361100,
                        "id": 361104,
                        "value": "361104",
                        "label": "广信区"
                    },
                    {
                        "pid": 361100,
                        "id": 361123,
                        "value": "361123",
                        "label": "玉山县"
                    },
                    {
                        "pid": 361100,
                        "id": 361124,
                        "value": "361124",
                        "label": "铅山县"
                    },
                    {
                        "pid": 361100,
                        "id": 361125,
                        "value": "361125",
                        "label": "横峰县"
                    },
                    {
                        "pid": 361100,
                        "id": 361126,
                        "value": "361126",
                        "label": "弋阳县"
                    },
                    {
                        "pid": 361100,
                        "id": 361127,
                        "value": "361127",
                        "label": "余干县"
                    },
                    {
                        "pid": 361100,
                        "id": 361128,
                        "value": "361128",
                        "label": "鄱阳县"
                    },
                    {
                        "pid": 361100,
                        "id": 361129,
                        "value": "361129",
                        "label": "万年县"
                    },
                    {
                        "pid": 361100,
                        "id": 361130,
                        "value": "361130",
                        "label": "婺源县"
                    },
                    {
                        "pid": 361100,
                        "id": 361181,
                        "value": "361181",
                        "label": "德兴市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 370000,
        "value": "370000",
        "label": "山东省",
        "children": [
            {
                "pid": 370000,
                "id": 370100,
                "value": "370100",
                "label": "济南市",
                "children": [
                    {
                        "pid": 370100,
                        "id": 370102,
                        "value": "370102",
                        "label": "历下区"
                    },
                    {
                        "pid": 370100,
                        "id": 370103,
                        "value": "370103",
                        "label": "市中区"
                    },
                    {
                        "pid": 370100,
                        "id": 370104,
                        "value": "370104",
                        "label": "槐荫区"
                    },
                    {
                        "pid": 370100,
                        "id": 370105,
                        "value": "370105",
                        "label": "天桥区"
                    },
                    {
                        "pid": 370100,
                        "id": 370112,
                        "value": "370112",
                        "label": "历城区"
                    },
                    {
                        "pid": 370100,
                        "id": 370113,
                        "value": "370113",
                        "label": "长清区"
                    },
                    {
                        "pid": 370100,
                        "id": 370114,
                        "value": "370114",
                        "label": "章丘区"
                    },
                    {
                        "pid": 370100,
                        "id": 370115,
                        "value": "370115",
                        "label": "济阳区"
                    },
                    {
                        "pid": 370100,
                        "id": 370116,
                        "value": "370116",
                        "label": "莱芜区"
                    },
                    {
                        "pid": 370100,
                        "id": 370117,
                        "value": "370117",
                        "label": "钢城区"
                    },
                    {
                        "pid": 370100,
                        "id": 370124,
                        "value": "370124",
                        "label": "平阴县"
                    },
                    {
                        "pid": 370100,
                        "id": 370126,
                        "value": "370126",
                        "label": "商河县"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 370200,
                "value": "370200",
                "label": "青岛市",
                "children": [
                    {
                        "pid": 370200,
                        "id": 370202,
                        "value": "370202",
                        "label": "市南区"
                    },
                    {
                        "pid": 370200,
                        "id": 370203,
                        "value": "370203",
                        "label": "市北区"
                    },
                    {
                        "pid": 370200,
                        "id": 370211,
                        "value": "370211",
                        "label": "黄岛区"
                    },
                    {
                        "pid": 370200,
                        "id": 370212,
                        "value": "370212",
                        "label": "崂山区"
                    },
                    {
                        "pid": 370200,
                        "id": 370213,
                        "value": "370213",
                        "label": "李沧区"
                    },
                    {
                        "pid": 370200,
                        "id": 370214,
                        "value": "370214",
                        "label": "城阳区"
                    },
                    {
                        "pid": 370200,
                        "id": 370215,
                        "value": "370215",
                        "label": "即墨区"
                    },
                    {
                        "pid": 370200,
                        "id": 370281,
                        "value": "370281",
                        "label": "胶州市"
                    },
                    {
                        "pid": 370200,
                        "id": 370283,
                        "value": "370283",
                        "label": "平度市"
                    },
                    {
                        "pid": 370200,
                        "id": 370285,
                        "value": "370285",
                        "label": "莱西市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 370300,
                "value": "370300",
                "label": "淄博市",
                "children": [
                    {
                        "pid": 370300,
                        "id": 370302,
                        "value": "370302",
                        "label": "淄川区"
                    },
                    {
                        "pid": 370300,
                        "id": 370303,
                        "value": "370303",
                        "label": "张店区"
                    },
                    {
                        "pid": 370300,
                        "id": 370304,
                        "value": "370304",
                        "label": "博山区"
                    },
                    {
                        "pid": 370300,
                        "id": 370305,
                        "value": "370305",
                        "label": "临淄区"
                    },
                    {
                        "pid": 370300,
                        "id": 370306,
                        "value": "370306",
                        "label": "周村区"
                    },
                    {
                        "pid": 370300,
                        "id": 370321,
                        "value": "370321",
                        "label": "桓台县"
                    },
                    {
                        "pid": 370300,
                        "id": 370322,
                        "value": "370322",
                        "label": "高青县"
                    },
                    {
                        "pid": 370300,
                        "id": 370323,
                        "value": "370323",
                        "label": "沂源县"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 370400,
                "value": "370400",
                "label": "枣庄市",
                "children": [
                    {
                        "pid": 370400,
                        "id": 370402,
                        "value": "370402",
                        "label": "市中区"
                    },
                    {
                        "pid": 370400,
                        "id": 370403,
                        "value": "370403",
                        "label": "薛城区"
                    },
                    {
                        "pid": 370400,
                        "id": 370404,
                        "value": "370404",
                        "label": "峄城区"
                    },
                    {
                        "pid": 370400,
                        "id": 370405,
                        "value": "370405",
                        "label": "台儿庄区"
                    },
                    {
                        "pid": 370400,
                        "id": 370406,
                        "value": "370406",
                        "label": "山亭区"
                    },
                    {
                        "pid": 370400,
                        "id": 370481,
                        "value": "370481",
                        "label": "滕州市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 370500,
                "value": "370500",
                "label": "东营市",
                "children": [
                    {
                        "pid": 370500,
                        "id": 370502,
                        "value": "370502",
                        "label": "东营区"
                    },
                    {
                        "pid": 370500,
                        "id": 370503,
                        "value": "370503",
                        "label": "河口区"
                    },
                    {
                        "pid": 370500,
                        "id": 370505,
                        "value": "370505",
                        "label": "垦利区"
                    },
                    {
                        "pid": 370500,
                        "id": 370522,
                        "value": "370522",
                        "label": "利津县"
                    },
                    {
                        "pid": 370500,
                        "id": 370523,
                        "value": "370523",
                        "label": "广饶县"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 370600,
                "value": "370600",
                "label": "烟台市",
                "children": [
                    {
                        "pid": 370600,
                        "id": 370602,
                        "value": "370602",
                        "label": "芝罘区"
                    },
                    {
                        "pid": 370600,
                        "id": 370611,
                        "value": "370611",
                        "label": "福山区"
                    },
                    {
                        "pid": 370600,
                        "id": 370612,
                        "value": "370612",
                        "label": "牟平区"
                    },
                    {
                        "pid": 370600,
                        "id": 370613,
                        "value": "370613",
                        "label": "莱山区"
                    },
                    {
                        "pid": 370600,
                        "id": 370614,
                        "value": "370614",
                        "label": "蓬莱区"
                    },
                    {
                        "pid": 370600,
                        "id": 370681,
                        "value": "370681",
                        "label": "龙口市"
                    },
                    {
                        "pid": 370600,
                        "id": 370682,
                        "value": "370682",
                        "label": "莱阳市"
                    },
                    {
                        "pid": 370600,
                        "id": 370683,
                        "value": "370683",
                        "label": "莱州市"
                    },
                    {
                        "pid": 370600,
                        "id": 370685,
                        "value": "370685",
                        "label": "招远市"
                    },
                    {
                        "pid": 370600,
                        "id": 370686,
                        "value": "370686",
                        "label": "栖霞市"
                    },
                    {
                        "pid": 370600,
                        "id": 370687,
                        "value": "370687",
                        "label": "海阳市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 370700,
                "value": "370700",
                "label": "潍坊市",
                "children": [
                    {
                        "pid": 370700,
                        "id": 370702,
                        "value": "370702",
                        "label": "潍城区"
                    },
                    {
                        "pid": 370700,
                        "id": 370703,
                        "value": "370703",
                        "label": "寒亭区"
                    },
                    {
                        "pid": 370700,
                        "id": 370704,
                        "value": "370704",
                        "label": "坊子区"
                    },
                    {
                        "pid": 370700,
                        "id": 370705,
                        "value": "370705",
                        "label": "奎文区"
                    },
                    {
                        "pid": 370700,
                        "id": 370724,
                        "value": "370724",
                        "label": "临朐县"
                    },
                    {
                        "pid": 370700,
                        "id": 370725,
                        "value": "370725",
                        "label": "昌乐县"
                    },
                    {
                        "pid": 370700,
                        "id": 370781,
                        "value": "370781",
                        "label": "青州市"
                    },
                    {
                        "pid": 370700,
                        "id": 370782,
                        "value": "370782",
                        "label": "诸城市"
                    },
                    {
                        "pid": 370700,
                        "id": 370783,
                        "value": "370783",
                        "label": "寿光市"
                    },
                    {
                        "pid": 370700,
                        "id": 370784,
                        "value": "370784",
                        "label": "安丘市"
                    },
                    {
                        "pid": 370700,
                        "id": 370785,
                        "value": "370785",
                        "label": "高密市"
                    },
                    {
                        "pid": 370700,
                        "id": 370786,
                        "value": "370786",
                        "label": "昌邑市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 370800,
                "value": "370800",
                "label": "济宁市",
                "children": [
                    {
                        "pid": 370800,
                        "id": 370811,
                        "value": "370811",
                        "label": "任城区"
                    },
                    {
                        "pid": 370800,
                        "id": 370812,
                        "value": "370812",
                        "label": "兖州区"
                    },
                    {
                        "pid": 370800,
                        "id": 370826,
                        "value": "370826",
                        "label": "微山县"
                    },
                    {
                        "pid": 370800,
                        "id": 370827,
                        "value": "370827",
                        "label": "鱼台县"
                    },
                    {
                        "pid": 370800,
                        "id": 370828,
                        "value": "370828",
                        "label": "金乡县"
                    },
                    {
                        "pid": 370800,
                        "id": 370829,
                        "value": "370829",
                        "label": "嘉祥县"
                    },
                    {
                        "pid": 370800,
                        "id": 370830,
                        "value": "370830",
                        "label": "汶上县"
                    },
                    {
                        "pid": 370800,
                        "id": 370831,
                        "value": "370831",
                        "label": "泗水县"
                    },
                    {
                        "pid": 370800,
                        "id": 370832,
                        "value": "370832",
                        "label": "梁山县"
                    },
                    {
                        "pid": 370800,
                        "id": 370881,
                        "value": "370881",
                        "label": "曲阜市"
                    },
                    {
                        "pid": 370800,
                        "id": 370883,
                        "value": "370883",
                        "label": "邹城市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 370900,
                "value": "370900",
                "label": "泰安市",
                "children": [
                    {
                        "pid": 370900,
                        "id": 370902,
                        "value": "370902",
                        "label": "泰山区"
                    },
                    {
                        "pid": 370900,
                        "id": 370911,
                        "value": "370911",
                        "label": "岱岳区"
                    },
                    {
                        "pid": 370900,
                        "id": 370921,
                        "value": "370921",
                        "label": "宁阳县"
                    },
                    {
                        "pid": 370900,
                        "id": 370923,
                        "value": "370923",
                        "label": "东平县"
                    },
                    {
                        "pid": 370900,
                        "id": 370982,
                        "value": "370982",
                        "label": "新泰市"
                    },
                    {
                        "pid": 370900,
                        "id": 370983,
                        "value": "370983",
                        "label": "肥城市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 371000,
                "value": "371000",
                "label": "威海市",
                "children": [
                    {
                        "pid": 371000,
                        "id": 371002,
                        "value": "371002",
                        "label": "环翠区"
                    },
                    {
                        "pid": 371000,
                        "id": 371003,
                        "value": "371003",
                        "label": "文登区"
                    },
                    {
                        "pid": 371000,
                        "id": 371082,
                        "value": "371082",
                        "label": "荣成市"
                    },
                    {
                        "pid": 371000,
                        "id": 371083,
                        "value": "371083",
                        "label": "乳山市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 371100,
                "value": "371100",
                "label": "日照市",
                "children": [
                    {
                        "pid": 371100,
                        "id": 371102,
                        "value": "371102",
                        "label": "东港区"
                    },
                    {
                        "pid": 371100,
                        "id": 371103,
                        "value": "371103",
                        "label": "岚山区"
                    },
                    {
                        "pid": 371100,
                        "id": 371121,
                        "value": "371121",
                        "label": "五莲县"
                    },
                    {
                        "pid": 371100,
                        "id": 371122,
                        "value": "371122",
                        "label": "莒县"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 371300,
                "value": "371300",
                "label": "临沂市",
                "children": [
                    {
                        "pid": 371300,
                        "id": 371302,
                        "value": "371302",
                        "label": "兰山区"
                    },
                    {
                        "pid": 371300,
                        "id": 371311,
                        "value": "371311",
                        "label": "罗庄区"
                    },
                    {
                        "pid": 371300,
                        "id": 371312,
                        "value": "371312",
                        "label": "河东区"
                    },
                    {
                        "pid": 371300,
                        "id": 371321,
                        "value": "371321",
                        "label": "沂南县"
                    },
                    {
                        "pid": 371300,
                        "id": 371322,
                        "value": "371322",
                        "label": "郯城县"
                    },
                    {
                        "pid": 371300,
                        "id": 371323,
                        "value": "371323",
                        "label": "沂水县"
                    },
                    {
                        "pid": 371300,
                        "id": 371324,
                        "value": "371324",
                        "label": "兰陵县"
                    },
                    {
                        "pid": 371300,
                        "id": 371325,
                        "value": "371325",
                        "label": "费县"
                    },
                    {
                        "pid": 371300,
                        "id": 371326,
                        "value": "371326",
                        "label": "平邑县"
                    },
                    {
                        "pid": 371300,
                        "id": 371327,
                        "value": "371327",
                        "label": "莒南县"
                    },
                    {
                        "pid": 371300,
                        "id": 371328,
                        "value": "371328",
                        "label": "蒙阴县"
                    },
                    {
                        "pid": 371300,
                        "id": 371329,
                        "value": "371329",
                        "label": "临沭县"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 371400,
                "value": "371400",
                "label": "德州市",
                "children": [
                    {
                        "pid": 371400,
                        "id": 371402,
                        "value": "371402",
                        "label": "德城区"
                    },
                    {
                        "pid": 371400,
                        "id": 371403,
                        "value": "371403",
                        "label": "陵城区"
                    },
                    {
                        "pid": 371400,
                        "id": 371422,
                        "value": "371422",
                        "label": "宁津县"
                    },
                    {
                        "pid": 371400,
                        "id": 371423,
                        "value": "371423",
                        "label": "庆云县"
                    },
                    {
                        "pid": 371400,
                        "id": 371424,
                        "value": "371424",
                        "label": "临邑县"
                    },
                    {
                        "pid": 371400,
                        "id": 371425,
                        "value": "371425",
                        "label": "齐河县"
                    },
                    {
                        "pid": 371400,
                        "id": 371426,
                        "value": "371426",
                        "label": "平原县"
                    },
                    {
                        "pid": 371400,
                        "id": 371427,
                        "value": "371427",
                        "label": "夏津县"
                    },
                    {
                        "pid": 371400,
                        "id": 371428,
                        "value": "371428",
                        "label": "武城县"
                    },
                    {
                        "pid": 371400,
                        "id": 371481,
                        "value": "371481",
                        "label": "乐陵市"
                    },
                    {
                        "pid": 371400,
                        "id": 371482,
                        "value": "371482",
                        "label": "禹城市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 371500,
                "value": "371500",
                "label": "聊城市",
                "children": [
                    {
                        "pid": 371500,
                        "id": 371502,
                        "value": "371502",
                        "label": "东昌府区"
                    },
                    {
                        "pid": 371500,
                        "id": 371503,
                        "value": "371503",
                        "label": "茌平区"
                    },
                    {
                        "pid": 371500,
                        "id": 371521,
                        "value": "371521",
                        "label": "阳谷县"
                    },
                    {
                        "pid": 371500,
                        "id": 371522,
                        "value": "371522",
                        "label": "莘县"
                    },
                    {
                        "pid": 371500,
                        "id": 371524,
                        "value": "371524",
                        "label": "东阿县"
                    },
                    {
                        "pid": 371500,
                        "id": 371525,
                        "value": "371525",
                        "label": "冠县"
                    },
                    {
                        "pid": 371500,
                        "id": 371526,
                        "value": "371526",
                        "label": "高唐县"
                    },
                    {
                        "pid": 371500,
                        "id": 371581,
                        "value": "371581",
                        "label": "临清市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 371600,
                "value": "371600",
                "label": "滨州市",
                "children": [
                    {
                        "pid": 371600,
                        "id": 371602,
                        "value": "371602",
                        "label": "滨城区"
                    },
                    {
                        "pid": 371600,
                        "id": 371603,
                        "value": "371603",
                        "label": "沾化区"
                    },
                    {
                        "pid": 371600,
                        "id": 371621,
                        "value": "371621",
                        "label": "惠民县"
                    },
                    {
                        "pid": 371600,
                        "id": 371622,
                        "value": "371622",
                        "label": "阳信县"
                    },
                    {
                        "pid": 371600,
                        "id": 371623,
                        "value": "371623",
                        "label": "无棣县"
                    },
                    {
                        "pid": 371600,
                        "id": 371625,
                        "value": "371625",
                        "label": "博兴县"
                    },
                    {
                        "pid": 371600,
                        "id": 371681,
                        "value": "371681",
                        "label": "邹平市"
                    }
                ]
            },
            {
                "pid": 370000,
                "id": 371700,
                "value": "371700",
                "label": "菏泽市",
                "children": [
                    {
                        "pid": 371700,
                        "id": 371702,
                        "value": "371702",
                        "label": "牡丹区"
                    },
                    {
                        "pid": 371700,
                        "id": 371703,
                        "value": "371703",
                        "label": "定陶区"
                    },
                    {
                        "pid": 371700,
                        "id": 371721,
                        "value": "371721",
                        "label": "曹县"
                    },
                    {
                        "pid": 371700,
                        "id": 371722,
                        "value": "371722",
                        "label": "单县"
                    },
                    {
                        "pid": 371700,
                        "id": 371723,
                        "value": "371723",
                        "label": "成武县"
                    },
                    {
                        "pid": 371700,
                        "id": 371724,
                        "value": "371724",
                        "label": "巨野县"
                    },
                    {
                        "pid": 371700,
                        "id": 371725,
                        "value": "371725",
                        "label": "郓城县"
                    },
                    {
                        "pid": 371700,
                        "id": 371726,
                        "value": "371726",
                        "label": "鄄城县"
                    },
                    {
                        "pid": 371700,
                        "id": 371728,
                        "value": "371728",
                        "label": "东明县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 410000,
        "value": "410000",
        "label": "河南省",
        "children": [
            {
                "pid": 410000,
                "id": 410100,
                "value": "410100",
                "label": "郑州市",
                "children": [
                    {
                        "pid": 410100,
                        "id": 410102,
                        "value": "410102",
                        "label": "中原区"
                    },
                    {
                        "pid": 410100,
                        "id": 410103,
                        "value": "410103",
                        "label": "二七区"
                    },
                    {
                        "pid": 410100,
                        "id": 410104,
                        "value": "410104",
                        "label": "管城回族区"
                    },
                    {
                        "pid": 410100,
                        "id": 410105,
                        "value": "410105",
                        "label": "金水区"
                    },
                    {
                        "pid": 410100,
                        "id": 410106,
                        "value": "410106",
                        "label": "上街区"
                    },
                    {
                        "pid": 410100,
                        "id": 410108,
                        "value": "410108",
                        "label": "惠济区"
                    },
                    {
                        "pid": 410100,
                        "id": 410122,
                        "value": "410122",
                        "label": "中牟县"
                    },
                    {
                        "pid": 410100,
                        "id": 410181,
                        "value": "410181",
                        "label": "巩义市"
                    },
                    {
                        "pid": 410100,
                        "id": 410182,
                        "value": "410182",
                        "label": "荥阳市"
                    },
                    {
                        "pid": 410100,
                        "id": 410183,
                        "value": "410183",
                        "label": "新密市"
                    },
                    {
                        "pid": 410100,
                        "id": 410184,
                        "value": "410184",
                        "label": "新郑市"
                    },
                    {
                        "pid": 410100,
                        "id": 410185,
                        "value": "410185",
                        "label": "登封市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 410200,
                "value": "410200",
                "label": "开封市",
                "children": [
                    {
                        "pid": 410200,
                        "id": 410202,
                        "value": "410202",
                        "label": "龙亭区"
                    },
                    {
                        "pid": 410200,
                        "id": 410203,
                        "value": "410203",
                        "label": "顺河回族区"
                    },
                    {
                        "pid": 410200,
                        "id": 410204,
                        "value": "410204",
                        "label": "鼓楼区"
                    },
                    {
                        "pid": 410200,
                        "id": 410205,
                        "value": "410205",
                        "label": "禹王台区"
                    },
                    {
                        "pid": 410200,
                        "id": 410212,
                        "value": "410212",
                        "label": "祥符区"
                    },
                    {
                        "pid": 410200,
                        "id": 410221,
                        "value": "410221",
                        "label": "杞县"
                    },
                    {
                        "pid": 410200,
                        "id": 410222,
                        "value": "410222",
                        "label": "通许县"
                    },
                    {
                        "pid": 410200,
                        "id": 410223,
                        "value": "410223",
                        "label": "尉氏县"
                    },
                    {
                        "pid": 410200,
                        "id": 410225,
                        "value": "410225",
                        "label": "兰考县"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 410300,
                "value": "410300",
                "label": "洛阳市",
                "children": [
                    {
                        "pid": 410300,
                        "id": 410302,
                        "value": "410302",
                        "label": "老城区"
                    },
                    {
                        "pid": 410300,
                        "id": 410303,
                        "value": "410303",
                        "label": "西工区"
                    },
                    {
                        "pid": 410300,
                        "id": 410304,
                        "value": "410304",
                        "label": "瀍河回族区"
                    },
                    {
                        "pid": 410300,
                        "id": 410305,
                        "value": "410305",
                        "label": "涧西区"
                    },
                    {
                        "pid": 410300,
                        "id": 410306,
                        "value": "410306",
                        "label": "吉利区"
                    },
                    {
                        "pid": 410300,
                        "id": 410311,
                        "value": "410311",
                        "label": "洛龙区"
                    },
                    {
                        "pid": 410300,
                        "id": 410322,
                        "value": "410322",
                        "label": "孟津县"
                    },
                    {
                        "pid": 410300,
                        "id": 410323,
                        "value": "410323",
                        "label": "新安县"
                    },
                    {
                        "pid": 410300,
                        "id": 410324,
                        "value": "410324",
                        "label": "栾川县"
                    },
                    {
                        "pid": 410300,
                        "id": 410325,
                        "value": "410325",
                        "label": "嵩县"
                    },
                    {
                        "pid": 410300,
                        "id": 410326,
                        "value": "410326",
                        "label": "汝阳县"
                    },
                    {
                        "pid": 410300,
                        "id": 410327,
                        "value": "410327",
                        "label": "宜阳县"
                    },
                    {
                        "pid": 410300,
                        "id": 410328,
                        "value": "410328",
                        "label": "洛宁县"
                    },
                    {
                        "pid": 410300,
                        "id": 410329,
                        "value": "410329",
                        "label": "伊川县"
                    },
                    {
                        "pid": 410300,
                        "id": 410381,
                        "value": "410381",
                        "label": "偃师市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 410400,
                "value": "410400",
                "label": "平顶山市",
                "children": [
                    {
                        "pid": 410400,
                        "id": 410402,
                        "value": "410402",
                        "label": "新华区"
                    },
                    {
                        "pid": 410400,
                        "id": 410403,
                        "value": "410403",
                        "label": "卫东区"
                    },
                    {
                        "pid": 410400,
                        "id": 410404,
                        "value": "410404",
                        "label": "石龙区"
                    },
                    {
                        "pid": 410400,
                        "id": 410411,
                        "value": "410411",
                        "label": "湛河区"
                    },
                    {
                        "pid": 410400,
                        "id": 410421,
                        "value": "410421",
                        "label": "宝丰县"
                    },
                    {
                        "pid": 410400,
                        "id": 410422,
                        "value": "410422",
                        "label": "叶县"
                    },
                    {
                        "pid": 410400,
                        "id": 410423,
                        "value": "410423",
                        "label": "鲁山县"
                    },
                    {
                        "pid": 410400,
                        "id": 410425,
                        "value": "410425",
                        "label": "郏县"
                    },
                    {
                        "pid": 410400,
                        "id": 410481,
                        "value": "410481",
                        "label": "舞钢市"
                    },
                    {
                        "pid": 410400,
                        "id": 410482,
                        "value": "410482",
                        "label": "汝州市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 410500,
                "value": "410500",
                "label": "安阳市",
                "children": [
                    {
                        "pid": 410500,
                        "id": 410502,
                        "value": "410502",
                        "label": "文峰区"
                    },
                    {
                        "pid": 410500,
                        "id": 410503,
                        "value": "410503",
                        "label": "北关区"
                    },
                    {
                        "pid": 410500,
                        "id": 410505,
                        "value": "410505",
                        "label": "殷都区"
                    },
                    {
                        "pid": 410500,
                        "id": 410506,
                        "value": "410506",
                        "label": "龙安区"
                    },
                    {
                        "pid": 410500,
                        "id": 410522,
                        "value": "410522",
                        "label": "安阳县"
                    },
                    {
                        "pid": 410500,
                        "id": 410523,
                        "value": "410523",
                        "label": "汤阴县"
                    },
                    {
                        "pid": 410500,
                        "id": 410526,
                        "value": "410526",
                        "label": "滑县"
                    },
                    {
                        "pid": 410500,
                        "id": 410527,
                        "value": "410527",
                        "label": "内黄县"
                    },
                    {
                        "pid": 410500,
                        "id": 410581,
                        "value": "410581",
                        "label": "林州市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 410600,
                "value": "410600",
                "label": "鹤壁市",
                "children": [
                    {
                        "pid": 410600,
                        "id": 410602,
                        "value": "410602",
                        "label": "鹤山区"
                    },
                    {
                        "pid": 410600,
                        "id": 410603,
                        "value": "410603",
                        "label": "山城区"
                    },
                    {
                        "pid": 410600,
                        "id": 410611,
                        "value": "410611",
                        "label": "淇滨区"
                    },
                    {
                        "pid": 410600,
                        "id": 410621,
                        "value": "410621",
                        "label": "浚县"
                    },
                    {
                        "pid": 410600,
                        "id": 410622,
                        "value": "410622",
                        "label": "淇县"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 410700,
                "value": "410700",
                "label": "新乡市",
                "children": [
                    {
                        "pid": 410700,
                        "id": 410702,
                        "value": "410702",
                        "label": "红旗区"
                    },
                    {
                        "pid": 410700,
                        "id": 410703,
                        "value": "410703",
                        "label": "卫滨区"
                    },
                    {
                        "pid": 410700,
                        "id": 410704,
                        "value": "410704",
                        "label": "凤泉区"
                    },
                    {
                        "pid": 410700,
                        "id": 410711,
                        "value": "410711",
                        "label": "牧野区"
                    },
                    {
                        "pid": 410700,
                        "id": 410721,
                        "value": "410721",
                        "label": "新乡县"
                    },
                    {
                        "pid": 410700,
                        "id": 410724,
                        "value": "410724",
                        "label": "获嘉县"
                    },
                    {
                        "pid": 410700,
                        "id": 410725,
                        "value": "410725",
                        "label": "原阳县"
                    },
                    {
                        "pid": 410700,
                        "id": 410726,
                        "value": "410726",
                        "label": "延津县"
                    },
                    {
                        "pid": 410700,
                        "id": 410727,
                        "value": "410727",
                        "label": "封丘县"
                    },
                    {
                        "pid": 410700,
                        "id": 410781,
                        "value": "410781",
                        "label": "卫辉市"
                    },
                    {
                        "pid": 410700,
                        "id": 410782,
                        "value": "410782",
                        "label": "辉县市"
                    },
                    {
                        "pid": 410700,
                        "id": 410783,
                        "value": "410783",
                        "label": "长垣市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 410800,
                "value": "410800",
                "label": "焦作市",
                "children": [
                    {
                        "pid": 410800,
                        "id": 410802,
                        "value": "410802",
                        "label": "解放区"
                    },
                    {
                        "pid": 410800,
                        "id": 410803,
                        "value": "410803",
                        "label": "中站区"
                    },
                    {
                        "pid": 410800,
                        "id": 410804,
                        "value": "410804",
                        "label": "马村区"
                    },
                    {
                        "pid": 410800,
                        "id": 410811,
                        "value": "410811",
                        "label": "山阳区"
                    },
                    {
                        "pid": 410800,
                        "id": 410821,
                        "value": "410821",
                        "label": "修武县"
                    },
                    {
                        "pid": 410800,
                        "id": 410822,
                        "value": "410822",
                        "label": "博爱县"
                    },
                    {
                        "pid": 410800,
                        "id": 410823,
                        "value": "410823",
                        "label": "武陟县"
                    },
                    {
                        "pid": 410800,
                        "id": 410825,
                        "value": "410825",
                        "label": "温县"
                    },
                    {
                        "pid": 410800,
                        "id": 410882,
                        "value": "410882",
                        "label": "沁阳市"
                    },
                    {
                        "pid": 410800,
                        "id": 410883,
                        "value": "410883",
                        "label": "孟州市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 410900,
                "value": "410900",
                "label": "濮阳市",
                "children": [
                    {
                        "pid": 410900,
                        "id": 410902,
                        "value": "410902",
                        "label": "华龙区"
                    },
                    {
                        "pid": 410900,
                        "id": 410922,
                        "value": "410922",
                        "label": "清丰县"
                    },
                    {
                        "pid": 410900,
                        "id": 410923,
                        "value": "410923",
                        "label": "南乐县"
                    },
                    {
                        "pid": 410900,
                        "id": 410926,
                        "value": "410926",
                        "label": "范县"
                    },
                    {
                        "pid": 410900,
                        "id": 410927,
                        "value": "410927",
                        "label": "台前县"
                    },
                    {
                        "pid": 410900,
                        "id": 410928,
                        "value": "410928",
                        "label": "濮阳县"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 411000,
                "value": "411000",
                "label": "许昌市",
                "children": [
                    {
                        "pid": 411000,
                        "id": 411002,
                        "value": "411002",
                        "label": "魏都区"
                    },
                    {
                        "pid": 411000,
                        "id": 411003,
                        "value": "411003",
                        "label": "建安区"
                    },
                    {
                        "pid": 411000,
                        "id": 411024,
                        "value": "411024",
                        "label": "鄢陵县"
                    },
                    {
                        "pid": 411000,
                        "id": 411025,
                        "value": "411025",
                        "label": "襄城县"
                    },
                    {
                        "pid": 411000,
                        "id": 411081,
                        "value": "411081",
                        "label": "禹州市"
                    },
                    {
                        "pid": 411000,
                        "id": 411082,
                        "value": "411082",
                        "label": "长葛市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 411100,
                "value": "411100",
                "label": "漯河市",
                "children": [
                    {
                        "pid": 411100,
                        "id": 411102,
                        "value": "411102",
                        "label": "源汇区"
                    },
                    {
                        "pid": 411100,
                        "id": 411103,
                        "value": "411103",
                        "label": "郾城区"
                    },
                    {
                        "pid": 411100,
                        "id": 411104,
                        "value": "411104",
                        "label": "召陵区"
                    },
                    {
                        "pid": 411100,
                        "id": 411121,
                        "value": "411121",
                        "label": "舞阳县"
                    },
                    {
                        "pid": 411100,
                        "id": 411122,
                        "value": "411122",
                        "label": "临颍县"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 411200,
                "value": "411200",
                "label": "三门峡市",
                "children": [
                    {
                        "pid": 411200,
                        "id": 411202,
                        "value": "411202",
                        "label": "湖滨区"
                    },
                    {
                        "pid": 411200,
                        "id": 411203,
                        "value": "411203",
                        "label": "陕州区"
                    },
                    {
                        "pid": 411200,
                        "id": 411221,
                        "value": "411221",
                        "label": "渑池县"
                    },
                    {
                        "pid": 411200,
                        "id": 411224,
                        "value": "411224",
                        "label": "卢氏县"
                    },
                    {
                        "pid": 411200,
                        "id": 411281,
                        "value": "411281",
                        "label": "义马市"
                    },
                    {
                        "pid": 411200,
                        "id": 411282,
                        "value": "411282",
                        "label": "灵宝市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 411300,
                "value": "411300",
                "label": "南阳市",
                "children": [
                    {
                        "pid": 411300,
                        "id": 411302,
                        "value": "411302",
                        "label": "宛城区"
                    },
                    {
                        "pid": 411300,
                        "id": 411303,
                        "value": "411303",
                        "label": "卧龙区"
                    },
                    {
                        "pid": 411300,
                        "id": 411321,
                        "value": "411321",
                        "label": "南召县"
                    },
                    {
                        "pid": 411300,
                        "id": 411322,
                        "value": "411322",
                        "label": "方城县"
                    },
                    {
                        "pid": 411300,
                        "id": 411323,
                        "value": "411323",
                        "label": "西峡县"
                    },
                    {
                        "pid": 411300,
                        "id": 411324,
                        "value": "411324",
                        "label": "镇平县"
                    },
                    {
                        "pid": 411300,
                        "id": 411325,
                        "value": "411325",
                        "label": "内乡县"
                    },
                    {
                        "pid": 411300,
                        "id": 411326,
                        "value": "411326",
                        "label": "淅川县"
                    },
                    {
                        "pid": 411300,
                        "id": 411327,
                        "value": "411327",
                        "label": "社旗县"
                    },
                    {
                        "pid": 411300,
                        "id": 411328,
                        "value": "411328",
                        "label": "唐河县"
                    },
                    {
                        "pid": 411300,
                        "id": 411329,
                        "value": "411329",
                        "label": "新野县"
                    },
                    {
                        "pid": 411300,
                        "id": 411330,
                        "value": "411330",
                        "label": "桐柏县"
                    },
                    {
                        "pid": 411300,
                        "id": 411381,
                        "value": "411381",
                        "label": "邓州市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 411400,
                "value": "411400",
                "label": "商丘市",
                "children": [
                    {
                        "pid": 411400,
                        "id": 411402,
                        "value": "411402",
                        "label": "梁园区"
                    },
                    {
                        "pid": 411400,
                        "id": 411403,
                        "value": "411403",
                        "label": "睢阳区"
                    },
                    {
                        "pid": 411400,
                        "id": 411421,
                        "value": "411421",
                        "label": "民权县"
                    },
                    {
                        "pid": 411400,
                        "id": 411422,
                        "value": "411422",
                        "label": "睢县"
                    },
                    {
                        "pid": 411400,
                        "id": 411423,
                        "value": "411423",
                        "label": "宁陵县"
                    },
                    {
                        "pid": 411400,
                        "id": 411424,
                        "value": "411424",
                        "label": "柘城县"
                    },
                    {
                        "pid": 411400,
                        "id": 411425,
                        "value": "411425",
                        "label": "虞城县"
                    },
                    {
                        "pid": 411400,
                        "id": 411426,
                        "value": "411426",
                        "label": "夏邑县"
                    },
                    {
                        "pid": 411400,
                        "id": 411481,
                        "value": "411481",
                        "label": "永城市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 411500,
                "value": "411500",
                "label": "信阳市",
                "children": [
                    {
                        "pid": 411500,
                        "id": 411502,
                        "value": "411502",
                        "label": "浉河区"
                    },
                    {
                        "pid": 411500,
                        "id": 411503,
                        "value": "411503",
                        "label": "平桥区"
                    },
                    {
                        "pid": 411500,
                        "id": 411521,
                        "value": "411521",
                        "label": "罗山县"
                    },
                    {
                        "pid": 411500,
                        "id": 411522,
                        "value": "411522",
                        "label": "光山县"
                    },
                    {
                        "pid": 411500,
                        "id": 411523,
                        "value": "411523",
                        "label": "新县"
                    },
                    {
                        "pid": 411500,
                        "id": 411524,
                        "value": "411524",
                        "label": "商城县"
                    },
                    {
                        "pid": 411500,
                        "id": 411525,
                        "value": "411525",
                        "label": "固始县"
                    },
                    {
                        "pid": 411500,
                        "id": 411526,
                        "value": "411526",
                        "label": "潢川县"
                    },
                    {
                        "pid": 411500,
                        "id": 411527,
                        "value": "411527",
                        "label": "淮滨县"
                    },
                    {
                        "pid": 411500,
                        "id": 411528,
                        "value": "411528",
                        "label": "息县"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 411600,
                "value": "411600",
                "label": "周口市",
                "children": [
                    {
                        "pid": 411600,
                        "id": 411602,
                        "value": "411602",
                        "label": "川汇区"
                    },
                    {
                        "pid": 411600,
                        "id": 411603,
                        "value": "411603",
                        "label": "淮阳区"
                    },
                    {
                        "pid": 411600,
                        "id": 411621,
                        "value": "411621",
                        "label": "扶沟县"
                    },
                    {
                        "pid": 411600,
                        "id": 411622,
                        "value": "411622",
                        "label": "西华县"
                    },
                    {
                        "pid": 411600,
                        "id": 411623,
                        "value": "411623",
                        "label": "商水县"
                    },
                    {
                        "pid": 411600,
                        "id": 411624,
                        "value": "411624",
                        "label": "沈丘县"
                    },
                    {
                        "pid": 411600,
                        "id": 411625,
                        "value": "411625",
                        "label": "郸城县"
                    },
                    {
                        "pid": 411600,
                        "id": 411627,
                        "value": "411627",
                        "label": "太康县"
                    },
                    {
                        "pid": 411600,
                        "id": 411628,
                        "value": "411628",
                        "label": "鹿邑县"
                    },
                    {
                        "pid": 411600,
                        "id": 411681,
                        "value": "411681",
                        "label": "项城市"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 411700,
                "value": "411700",
                "label": "驻马店市",
                "children": [
                    {
                        "pid": 411700,
                        "id": 411702,
                        "value": "411702",
                        "label": "驿城区"
                    },
                    {
                        "pid": 411700,
                        "id": 411721,
                        "value": "411721",
                        "label": "西平县"
                    },
                    {
                        "pid": 411700,
                        "id": 411722,
                        "value": "411722",
                        "label": "上蔡县"
                    },
                    {
                        "pid": 411700,
                        "id": 411723,
                        "value": "411723",
                        "label": "平舆县"
                    },
                    {
                        "pid": 411700,
                        "id": 411724,
                        "value": "411724",
                        "label": "正阳县"
                    },
                    {
                        "pid": 411700,
                        "id": 411725,
                        "value": "411725",
                        "label": "确山县"
                    },
                    {
                        "pid": 411700,
                        "id": 411726,
                        "value": "411726",
                        "label": "泌阳县"
                    },
                    {
                        "pid": 411700,
                        "id": 411727,
                        "value": "411727",
                        "label": "汝南县"
                    },
                    {
                        "pid": 411700,
                        "id": 411728,
                        "value": "411728",
                        "label": "遂平县"
                    },
                    {
                        "pid": 411700,
                        "id": 411729,
                        "value": "411729",
                        "label": "新蔡县"
                    }
                ]
            },
            {
                "pid": 410000,
                "id": 419001,
                "value": "419001",
                "label": "济源市"
            }
        ]
    },
    {
        "pid": -1,
        "id": 420000,
        "value": "420000",
        "label": "湖北省",
        "children": [
            {
                "pid": 420000,
                "id": 420100,
                "value": "420100",
                "label": "武汉市",
                "children": [
                    {
                        "pid": 420100,
                        "id": 420102,
                        "value": "420102",
                        "label": "江岸区"
                    },
                    {
                        "pid": 420100,
                        "id": 420103,
                        "value": "420103",
                        "label": "江汉区"
                    },
                    {
                        "pid": 420100,
                        "id": 420104,
                        "value": "420104",
                        "label": "硚口区"
                    },
                    {
                        "pid": 420100,
                        "id": 420105,
                        "value": "420105",
                        "label": "汉阳区"
                    },
                    {
                        "pid": 420100,
                        "id": 420106,
                        "value": "420106",
                        "label": "武昌区"
                    },
                    {
                        "pid": 420100,
                        "id": 420107,
                        "value": "420107",
                        "label": "青山区"
                    },
                    {
                        "pid": 420100,
                        "id": 420111,
                        "value": "420111",
                        "label": "洪山区"
                    },
                    {
                        "pid": 420100,
                        "id": 420112,
                        "value": "420112",
                        "label": "东西湖区"
                    },
                    {
                        "pid": 420100,
                        "id": 420113,
                        "value": "420113",
                        "label": "汉南区"
                    },
                    {
                        "pid": 420100,
                        "id": 420114,
                        "value": "420114",
                        "label": "蔡甸区"
                    },
                    {
                        "pid": 420100,
                        "id": 420115,
                        "value": "420115",
                        "label": "江夏区"
                    },
                    {
                        "pid": 420100,
                        "id": 420116,
                        "value": "420116",
                        "label": "黄陂区"
                    },
                    {
                        "pid": 420100,
                        "id": 420117,
                        "value": "420117",
                        "label": "新洲区"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 420200,
                "value": "420200",
                "label": "黄石市",
                "children": [
                    {
                        "pid": 420200,
                        "id": 420202,
                        "value": "420202",
                        "label": "黄石港区"
                    },
                    {
                        "pid": 420200,
                        "id": 420203,
                        "value": "420203",
                        "label": "西塞山区"
                    },
                    {
                        "pid": 420200,
                        "id": 420204,
                        "value": "420204",
                        "label": "下陆区"
                    },
                    {
                        "pid": 420200,
                        "id": 420205,
                        "value": "420205",
                        "label": "铁山区"
                    },
                    {
                        "pid": 420200,
                        "id": 420222,
                        "value": "420222",
                        "label": "阳新县"
                    },
                    {
                        "pid": 420200,
                        "id": 420281,
                        "value": "420281",
                        "label": "大冶市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 420300,
                "value": "420300",
                "label": "十堰市",
                "children": [
                    {
                        "pid": 420300,
                        "id": 420302,
                        "value": "420302",
                        "label": "茅箭区"
                    },
                    {
                        "pid": 420300,
                        "id": 420303,
                        "value": "420303",
                        "label": "张湾区"
                    },
                    {
                        "pid": 420300,
                        "id": 420304,
                        "value": "420304",
                        "label": "郧阳区"
                    },
                    {
                        "pid": 420300,
                        "id": 420322,
                        "value": "420322",
                        "label": "郧西县"
                    },
                    {
                        "pid": 420300,
                        "id": 420323,
                        "value": "420323",
                        "label": "竹山县"
                    },
                    {
                        "pid": 420300,
                        "id": 420324,
                        "value": "420324",
                        "label": "竹溪县"
                    },
                    {
                        "pid": 420300,
                        "id": 420325,
                        "value": "420325",
                        "label": "房县"
                    },
                    {
                        "pid": 420300,
                        "id": 420381,
                        "value": "420381",
                        "label": "丹江口市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 420500,
                "value": "420500",
                "label": "宜昌市",
                "children": [
                    {
                        "pid": 420500,
                        "id": 420502,
                        "value": "420502",
                        "label": "西陵区"
                    },
                    {
                        "pid": 420500,
                        "id": 420503,
                        "value": "420503",
                        "label": "伍家岗区"
                    },
                    {
                        "pid": 420500,
                        "id": 420504,
                        "value": "420504",
                        "label": "点军区"
                    },
                    {
                        "pid": 420500,
                        "id": 420505,
                        "value": "420505",
                        "label": "猇亭区"
                    },
                    {
                        "pid": 420500,
                        "id": 420506,
                        "value": "420506",
                        "label": "夷陵区"
                    },
                    {
                        "pid": 420500,
                        "id": 420525,
                        "value": "420525",
                        "label": "远安县"
                    },
                    {
                        "pid": 420500,
                        "id": 420526,
                        "value": "420526",
                        "label": "兴山县"
                    },
                    {
                        "pid": 420500,
                        "id": 420527,
                        "value": "420527",
                        "label": "秭归县"
                    },
                    {
                        "pid": 420500,
                        "id": 420528,
                        "value": "420528",
                        "label": "长阳土家族自治县"
                    },
                    {
                        "pid": 420500,
                        "id": 420529,
                        "value": "420529",
                        "label": "五峰土家族自治县"
                    },
                    {
                        "pid": 420500,
                        "id": 420581,
                        "value": "420581",
                        "label": "宜都市"
                    },
                    {
                        "pid": 420500,
                        "id": 420582,
                        "value": "420582",
                        "label": "当阳市"
                    },
                    {
                        "pid": 420500,
                        "id": 420583,
                        "value": "420583",
                        "label": "枝江市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 420600,
                "value": "420600",
                "label": "襄阳市",
                "children": [
                    {
                        "pid": 420600,
                        "id": 420602,
                        "value": "420602",
                        "label": "襄城区"
                    },
                    {
                        "pid": 420600,
                        "id": 420606,
                        "value": "420606",
                        "label": "樊城区"
                    },
                    {
                        "pid": 420600,
                        "id": 420607,
                        "value": "420607",
                        "label": "襄州区"
                    },
                    {
                        "pid": 420600,
                        "id": 420624,
                        "value": "420624",
                        "label": "南漳县"
                    },
                    {
                        "pid": 420600,
                        "id": 420625,
                        "value": "420625",
                        "label": "谷城县"
                    },
                    {
                        "pid": 420600,
                        "id": 420626,
                        "value": "420626",
                        "label": "保康县"
                    },
                    {
                        "pid": 420600,
                        "id": 420682,
                        "value": "420682",
                        "label": "老河口市"
                    },
                    {
                        "pid": 420600,
                        "id": 420683,
                        "value": "420683",
                        "label": "枣阳市"
                    },
                    {
                        "pid": 420600,
                        "id": 420684,
                        "value": "420684",
                        "label": "宜城市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 420700,
                "value": "420700",
                "label": "鄂州市",
                "children": [
                    {
                        "pid": 420700,
                        "id": 420702,
                        "value": "420702",
                        "label": "梁子湖区"
                    },
                    {
                        "pid": 420700,
                        "id": 420703,
                        "value": "420703",
                        "label": "华容区"
                    },
                    {
                        "pid": 420700,
                        "id": 420704,
                        "value": "420704",
                        "label": "鄂城区"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 420800,
                "value": "420800",
                "label": "荆门市",
                "children": [
                    {
                        "pid": 420800,
                        "id": 420802,
                        "value": "420802",
                        "label": "东宝区"
                    },
                    {
                        "pid": 420800,
                        "id": 420804,
                        "value": "420804",
                        "label": "掇刀区"
                    },
                    {
                        "pid": 420800,
                        "id": 420822,
                        "value": "420822",
                        "label": "沙洋县"
                    },
                    {
                        "pid": 420800,
                        "id": 420881,
                        "value": "420881",
                        "label": "钟祥市"
                    },
                    {
                        "pid": 420800,
                        "id": 420882,
                        "value": "420882",
                        "label": "京山市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 420900,
                "value": "420900",
                "label": "孝感市",
                "children": [
                    {
                        "pid": 420900,
                        "id": 420902,
                        "value": "420902",
                        "label": "孝南区"
                    },
                    {
                        "pid": 420900,
                        "id": 420921,
                        "value": "420921",
                        "label": "孝昌县"
                    },
                    {
                        "pid": 420900,
                        "id": 420922,
                        "value": "420922",
                        "label": "大悟县"
                    },
                    {
                        "pid": 420900,
                        "id": 420923,
                        "value": "420923",
                        "label": "云梦县"
                    },
                    {
                        "pid": 420900,
                        "id": 420981,
                        "value": "420981",
                        "label": "应城市"
                    },
                    {
                        "pid": 420900,
                        "id": 420982,
                        "value": "420982",
                        "label": "安陆市"
                    },
                    {
                        "pid": 420900,
                        "id": 420984,
                        "value": "420984",
                        "label": "汉川市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 421000,
                "value": "421000",
                "label": "荆州市",
                "children": [
                    {
                        "pid": 421000,
                        "id": 421002,
                        "value": "421002",
                        "label": "沙市区"
                    },
                    {
                        "pid": 421000,
                        "id": 421003,
                        "value": "421003",
                        "label": "荆州区"
                    },
                    {
                        "pid": 421000,
                        "id": 421022,
                        "value": "421022",
                        "label": "公安县"
                    },
                    {
                        "pid": 421000,
                        "id": 421023,
                        "value": "421023",
                        "label": "监利县"
                    },
                    {
                        "pid": 421000,
                        "id": 421024,
                        "value": "421024",
                        "label": "江陵县"
                    },
                    {
                        "pid": 421000,
                        "id": 421081,
                        "value": "421081",
                        "label": "石首市"
                    },
                    {
                        "pid": 421000,
                        "id": 421083,
                        "value": "421083",
                        "label": "洪湖市"
                    },
                    {
                        "pid": 421000,
                        "id": 421087,
                        "value": "421087",
                        "label": "松滋市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 421100,
                "value": "421100",
                "label": "黄冈市",
                "children": [
                    {
                        "pid": 421100,
                        "id": 421102,
                        "value": "421102",
                        "label": "黄州区"
                    },
                    {
                        "pid": 421100,
                        "id": 421121,
                        "value": "421121",
                        "label": "团风县"
                    },
                    {
                        "pid": 421100,
                        "id": 421122,
                        "value": "421122",
                        "label": "红安县"
                    },
                    {
                        "pid": 421100,
                        "id": 421123,
                        "value": "421123",
                        "label": "罗田县"
                    },
                    {
                        "pid": 421100,
                        "id": 421124,
                        "value": "421124",
                        "label": "英山县"
                    },
                    {
                        "pid": 421100,
                        "id": 421125,
                        "value": "421125",
                        "label": "浠水县"
                    },
                    {
                        "pid": 421100,
                        "id": 421126,
                        "value": "421126",
                        "label": "蕲春县"
                    },
                    {
                        "pid": 421100,
                        "id": 421127,
                        "value": "421127",
                        "label": "黄梅县"
                    },
                    {
                        "pid": 421100,
                        "id": 421181,
                        "value": "421181",
                        "label": "麻城市"
                    },
                    {
                        "pid": 421100,
                        "id": 421182,
                        "value": "421182",
                        "label": "武穴市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 421200,
                "value": "421200",
                "label": "咸宁市",
                "children": [
                    {
                        "pid": 421200,
                        "id": 421202,
                        "value": "421202",
                        "label": "咸安区"
                    },
                    {
                        "pid": 421200,
                        "id": 421221,
                        "value": "421221",
                        "label": "嘉鱼县"
                    },
                    {
                        "pid": 421200,
                        "id": 421222,
                        "value": "421222",
                        "label": "通城县"
                    },
                    {
                        "pid": 421200,
                        "id": 421223,
                        "value": "421223",
                        "label": "崇阳县"
                    },
                    {
                        "pid": 421200,
                        "id": 421224,
                        "value": "421224",
                        "label": "通山县"
                    },
                    {
                        "pid": 421200,
                        "id": 421281,
                        "value": "421281",
                        "label": "赤壁市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 421300,
                "value": "421300",
                "label": "随州市",
                "children": [
                    {
                        "pid": 421300,
                        "id": 421303,
                        "value": "421303",
                        "label": "曾都区"
                    },
                    {
                        "pid": 421300,
                        "id": 421321,
                        "value": "421321",
                        "label": "随县"
                    },
                    {
                        "pid": 421300,
                        "id": 421381,
                        "value": "421381",
                        "label": "广水市"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 422800,
                "value": "422800",
                "label": "恩施土家族苗族自治州",
                "children": [
                    {
                        "pid": 422800,
                        "id": 422801,
                        "value": "422801",
                        "label": "恩施市"
                    },
                    {
                        "pid": 422800,
                        "id": 422802,
                        "value": "422802",
                        "label": "利川市"
                    },
                    {
                        "pid": 422800,
                        "id": 422822,
                        "value": "422822",
                        "label": "建始县"
                    },
                    {
                        "pid": 422800,
                        "id": 422823,
                        "value": "422823",
                        "label": "巴东县"
                    },
                    {
                        "pid": 422800,
                        "id": 422825,
                        "value": "422825",
                        "label": "宣恩县"
                    },
                    {
                        "pid": 422800,
                        "id": 422826,
                        "value": "422826",
                        "label": "咸丰县"
                    },
                    {
                        "pid": 422800,
                        "id": 422827,
                        "value": "422827",
                        "label": "来凤县"
                    },
                    {
                        "pid": 422800,
                        "id": 422828,
                        "value": "422828",
                        "label": "鹤峰县"
                    }
                ]
            },
            {
                "pid": 420000,
                "id": 429004,
                "value": "429004",
                "label": "仙桃市"
            },
            {
                "pid": 420000,
                "id": 429005,
                "value": "429005",
                "label": "潜江市"
            },
            {
                "pid": 420000,
                "id": 429006,
                "value": "429006",
                "label": "天门市"
            },
            {
                "pid": 420000,
                "id": 429021,
                "value": "429021",
                "label": "神农架林区"
            }
        ]
    },
    {
        "pid": -1,
        "id": 430000,
        "value": "430000",
        "label": "湖南省",
        "children": [
            {
                "pid": 430000,
                "id": 430100,
                "value": "430100",
                "label": "长沙市",
                "children": [
                    {
                        "pid": 430100,
                        "id": 430102,
                        "value": "430102",
                        "label": "芙蓉区"
                    },
                    {
                        "pid": 430100,
                        "id": 430103,
                        "value": "430103",
                        "label": "天心区"
                    },
                    {
                        "pid": 430100,
                        "id": 430104,
                        "value": "430104",
                        "label": "岳麓区"
                    },
                    {
                        "pid": 430100,
                        "id": 430105,
                        "value": "430105",
                        "label": "开福区"
                    },
                    {
                        "pid": 430100,
                        "id": 430111,
                        "value": "430111",
                        "label": "雨花区"
                    },
                    {
                        "pid": 430100,
                        "id": 430112,
                        "value": "430112",
                        "label": "望城区"
                    },
                    {
                        "pid": 430100,
                        "id": 430121,
                        "value": "430121",
                        "label": "长沙县"
                    },
                    {
                        "pid": 430100,
                        "id": 430181,
                        "value": "430181",
                        "label": "浏阳市"
                    },
                    {
                        "pid": 430100,
                        "id": 430182,
                        "value": "430182",
                        "label": "宁乡市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 430200,
                "value": "430200",
                "label": "株洲市",
                "children": [
                    {
                        "pid": 430200,
                        "id": 430202,
                        "value": "430202",
                        "label": "荷塘区"
                    },
                    {
                        "pid": 430200,
                        "id": 430203,
                        "value": "430203",
                        "label": "芦淞区"
                    },
                    {
                        "pid": 430200,
                        "id": 430204,
                        "value": "430204",
                        "label": "石峰区"
                    },
                    {
                        "pid": 430200,
                        "id": 430211,
                        "value": "430211",
                        "label": "天元区"
                    },
                    {
                        "pid": 430200,
                        "id": 430212,
                        "value": "430212",
                        "label": "渌口区"
                    },
                    {
                        "pid": 430200,
                        "id": 430223,
                        "value": "430223",
                        "label": "攸县"
                    },
                    {
                        "pid": 430200,
                        "id": 430224,
                        "value": "430224",
                        "label": "茶陵县"
                    },
                    {
                        "pid": 430200,
                        "id": 430225,
                        "value": "430225",
                        "label": "炎陵县"
                    },
                    {
                        "pid": 430200,
                        "id": 430281,
                        "value": "430281",
                        "label": "醴陵市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 430300,
                "value": "430300",
                "label": "湘潭市",
                "children": [
                    {
                        "pid": 430300,
                        "id": 430302,
                        "value": "430302",
                        "label": "雨湖区"
                    },
                    {
                        "pid": 430300,
                        "id": 430304,
                        "value": "430304",
                        "label": "岳塘区"
                    },
                    {
                        "pid": 430300,
                        "id": 430321,
                        "value": "430321",
                        "label": "湘潭县"
                    },
                    {
                        "pid": 430300,
                        "id": 430381,
                        "value": "430381",
                        "label": "湘乡市"
                    },
                    {
                        "pid": 430300,
                        "id": 430382,
                        "value": "430382",
                        "label": "韶山市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 430400,
                "value": "430400",
                "label": "衡阳市",
                "children": [
                    {
                        "pid": 430400,
                        "id": 430405,
                        "value": "430405",
                        "label": "珠晖区"
                    },
                    {
                        "pid": 430400,
                        "id": 430406,
                        "value": "430406",
                        "label": "雁峰区"
                    },
                    {
                        "pid": 430400,
                        "id": 430407,
                        "value": "430407",
                        "label": "石鼓区"
                    },
                    {
                        "pid": 430400,
                        "id": 430408,
                        "value": "430408",
                        "label": "蒸湘区"
                    },
                    {
                        "pid": 430400,
                        "id": 430412,
                        "value": "430412",
                        "label": "南岳区"
                    },
                    {
                        "pid": 430400,
                        "id": 430421,
                        "value": "430421",
                        "label": "衡阳县"
                    },
                    {
                        "pid": 430400,
                        "id": 430422,
                        "value": "430422",
                        "label": "衡南县"
                    },
                    {
                        "pid": 430400,
                        "id": 430423,
                        "value": "430423",
                        "label": "衡山县"
                    },
                    {
                        "pid": 430400,
                        "id": 430424,
                        "value": "430424",
                        "label": "衡东县"
                    },
                    {
                        "pid": 430400,
                        "id": 430426,
                        "value": "430426",
                        "label": "祁东县"
                    },
                    {
                        "pid": 430400,
                        "id": 430481,
                        "value": "430481",
                        "label": "耒阳市"
                    },
                    {
                        "pid": 430400,
                        "id": 430482,
                        "value": "430482",
                        "label": "常宁市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 430500,
                "value": "430500",
                "label": "邵阳市",
                "children": [
                    {
                        "pid": 430500,
                        "id": 430502,
                        "value": "430502",
                        "label": "双清区"
                    },
                    {
                        "pid": 430500,
                        "id": 430503,
                        "value": "430503",
                        "label": "大祥区"
                    },
                    {
                        "pid": 430500,
                        "id": 430511,
                        "value": "430511",
                        "label": "北塔区"
                    },
                    {
                        "pid": 430500,
                        "id": 430522,
                        "value": "430522",
                        "label": "新邵县"
                    },
                    {
                        "pid": 430500,
                        "id": 430523,
                        "value": "430523",
                        "label": "邵阳县"
                    },
                    {
                        "pid": 430500,
                        "id": 430524,
                        "value": "430524",
                        "label": "隆回县"
                    },
                    {
                        "pid": 430500,
                        "id": 430525,
                        "value": "430525",
                        "label": "洞口县"
                    },
                    {
                        "pid": 430500,
                        "id": 430527,
                        "value": "430527",
                        "label": "绥宁县"
                    },
                    {
                        "pid": 430500,
                        "id": 430528,
                        "value": "430528",
                        "label": "新宁县"
                    },
                    {
                        "pid": 430500,
                        "id": 430529,
                        "value": "430529",
                        "label": "城步苗族自治县"
                    },
                    {
                        "pid": 430500,
                        "id": 430581,
                        "value": "430581",
                        "label": "武冈市"
                    },
                    {
                        "pid": 430500,
                        "id": 430582,
                        "value": "430582",
                        "label": "邵东市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 430600,
                "value": "430600",
                "label": "岳阳市",
                "children": [
                    {
                        "pid": 430600,
                        "id": 430602,
                        "value": "430602",
                        "label": "岳阳楼区"
                    },
                    {
                        "pid": 430600,
                        "id": 430603,
                        "value": "430603",
                        "label": "云溪区"
                    },
                    {
                        "pid": 430600,
                        "id": 430611,
                        "value": "430611",
                        "label": "君山区"
                    },
                    {
                        "pid": 430600,
                        "id": 430621,
                        "value": "430621",
                        "label": "岳阳县"
                    },
                    {
                        "pid": 430600,
                        "id": 430623,
                        "value": "430623",
                        "label": "华容县"
                    },
                    {
                        "pid": 430600,
                        "id": 430624,
                        "value": "430624",
                        "label": "湘阴县"
                    },
                    {
                        "pid": 430600,
                        "id": 430626,
                        "value": "430626",
                        "label": "平江县"
                    },
                    {
                        "pid": 430600,
                        "id": 430681,
                        "value": "430681",
                        "label": "汨罗市"
                    },
                    {
                        "pid": 430600,
                        "id": 430682,
                        "value": "430682",
                        "label": "临湘市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 430700,
                "value": "430700",
                "label": "常德市",
                "children": [
                    {
                        "pid": 430700,
                        "id": 430702,
                        "value": "430702",
                        "label": "武陵区"
                    },
                    {
                        "pid": 430700,
                        "id": 430703,
                        "value": "430703",
                        "label": "鼎城区"
                    },
                    {
                        "pid": 430700,
                        "id": 430721,
                        "value": "430721",
                        "label": "安乡县"
                    },
                    {
                        "pid": 430700,
                        "id": 430722,
                        "value": "430722",
                        "label": "汉寿县"
                    },
                    {
                        "pid": 430700,
                        "id": 430723,
                        "value": "430723",
                        "label": "澧县"
                    },
                    {
                        "pid": 430700,
                        "id": 430724,
                        "value": "430724",
                        "label": "临澧县"
                    },
                    {
                        "pid": 430700,
                        "id": 430725,
                        "value": "430725",
                        "label": "桃源县"
                    },
                    {
                        "pid": 430700,
                        "id": 430726,
                        "value": "430726",
                        "label": "石门县"
                    },
                    {
                        "pid": 430700,
                        "id": 430781,
                        "value": "430781",
                        "label": "津市市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 430800,
                "value": "430800",
                "label": "张家界市",
                "children": [
                    {
                        "pid": 430800,
                        "id": 430802,
                        "value": "430802",
                        "label": "永定区"
                    },
                    {
                        "pid": 430800,
                        "id": 430811,
                        "value": "430811",
                        "label": "武陵源区"
                    },
                    {
                        "pid": 430800,
                        "id": 430821,
                        "value": "430821",
                        "label": "慈利县"
                    },
                    {
                        "pid": 430800,
                        "id": 430822,
                        "value": "430822",
                        "label": "桑植县"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 430900,
                "value": "430900",
                "label": "益阳市",
                "children": [
                    {
                        "pid": 430900,
                        "id": 430902,
                        "value": "430902",
                        "label": "资阳区"
                    },
                    {
                        "pid": 430900,
                        "id": 430903,
                        "value": "430903",
                        "label": "赫山区"
                    },
                    {
                        "pid": 430900,
                        "id": 430921,
                        "value": "430921",
                        "label": "南县"
                    },
                    {
                        "pid": 430900,
                        "id": 430922,
                        "value": "430922",
                        "label": "桃江县"
                    },
                    {
                        "pid": 430900,
                        "id": 430923,
                        "value": "430923",
                        "label": "安化县"
                    },
                    {
                        "pid": 430900,
                        "id": 430981,
                        "value": "430981",
                        "label": "沅江市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 431000,
                "value": "431000",
                "label": "郴州市",
                "children": [
                    {
                        "pid": 431000,
                        "id": 431002,
                        "value": "431002",
                        "label": "北湖区"
                    },
                    {
                        "pid": 431000,
                        "id": 431003,
                        "value": "431003",
                        "label": "苏仙区"
                    },
                    {
                        "pid": 431000,
                        "id": 431021,
                        "value": "431021",
                        "label": "桂阳县"
                    },
                    {
                        "pid": 431000,
                        "id": 431022,
                        "value": "431022",
                        "label": "宜章县"
                    },
                    {
                        "pid": 431000,
                        "id": 431023,
                        "value": "431023",
                        "label": "永兴县"
                    },
                    {
                        "pid": 431000,
                        "id": 431024,
                        "value": "431024",
                        "label": "嘉禾县"
                    },
                    {
                        "pid": 431000,
                        "id": 431025,
                        "value": "431025",
                        "label": "临武县"
                    },
                    {
                        "pid": 431000,
                        "id": 431026,
                        "value": "431026",
                        "label": "汝城县"
                    },
                    {
                        "pid": 431000,
                        "id": 431027,
                        "value": "431027",
                        "label": "桂东县"
                    },
                    {
                        "pid": 431000,
                        "id": 431028,
                        "value": "431028",
                        "label": "安仁县"
                    },
                    {
                        "pid": 431000,
                        "id": 431081,
                        "value": "431081",
                        "label": "资兴市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 431100,
                "value": "431100",
                "label": "永州市",
                "children": [
                    {
                        "pid": 431100,
                        "id": 431102,
                        "value": "431102",
                        "label": "零陵区"
                    },
                    {
                        "pid": 431100,
                        "id": 431103,
                        "value": "431103",
                        "label": "冷水滩区"
                    },
                    {
                        "pid": 431100,
                        "id": 431121,
                        "value": "431121",
                        "label": "祁阳县"
                    },
                    {
                        "pid": 431100,
                        "id": 431122,
                        "value": "431122",
                        "label": "东安县"
                    },
                    {
                        "pid": 431100,
                        "id": 431123,
                        "value": "431123",
                        "label": "双牌县"
                    },
                    {
                        "pid": 431100,
                        "id": 431124,
                        "value": "431124",
                        "label": "道县"
                    },
                    {
                        "pid": 431100,
                        "id": 431125,
                        "value": "431125",
                        "label": "江永县"
                    },
                    {
                        "pid": 431100,
                        "id": 431126,
                        "value": "431126",
                        "label": "宁远县"
                    },
                    {
                        "pid": 431100,
                        "id": 431127,
                        "value": "431127",
                        "label": "蓝山县"
                    },
                    {
                        "pid": 431100,
                        "id": 431128,
                        "value": "431128",
                        "label": "新田县"
                    },
                    {
                        "pid": 431100,
                        "id": 431129,
                        "value": "431129",
                        "label": "江华瑶族自治县"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 431200,
                "value": "431200",
                "label": "怀化市",
                "children": [
                    {
                        "pid": 431200,
                        "id": 431202,
                        "value": "431202",
                        "label": "鹤城区"
                    },
                    {
                        "pid": 431200,
                        "id": 431221,
                        "value": "431221",
                        "label": "中方县"
                    },
                    {
                        "pid": 431200,
                        "id": 431222,
                        "value": "431222",
                        "label": "沅陵县"
                    },
                    {
                        "pid": 431200,
                        "id": 431223,
                        "value": "431223",
                        "label": "辰溪县"
                    },
                    {
                        "pid": 431200,
                        "id": 431224,
                        "value": "431224",
                        "label": "溆浦县"
                    },
                    {
                        "pid": 431200,
                        "id": 431225,
                        "value": "431225",
                        "label": "会同县"
                    },
                    {
                        "pid": 431200,
                        "id": 431226,
                        "value": "431226",
                        "label": "麻阳苗族自治县"
                    },
                    {
                        "pid": 431200,
                        "id": 431227,
                        "value": "431227",
                        "label": "新晃侗族自治县"
                    },
                    {
                        "pid": 431200,
                        "id": 431228,
                        "value": "431228",
                        "label": "芷江侗族自治县"
                    },
                    {
                        "pid": 431200,
                        "id": 431229,
                        "value": "431229",
                        "label": "靖州苗族侗族自治县"
                    },
                    {
                        "pid": 431200,
                        "id": 431230,
                        "value": "431230",
                        "label": "通道侗族自治县"
                    },
                    {
                        "pid": 431200,
                        "id": 431281,
                        "value": "431281",
                        "label": "洪江市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 431300,
                "value": "431300",
                "label": "娄底市",
                "children": [
                    {
                        "pid": 431300,
                        "id": 431302,
                        "value": "431302",
                        "label": "娄星区"
                    },
                    {
                        "pid": 431300,
                        "id": 431321,
                        "value": "431321",
                        "label": "双峰县"
                    },
                    {
                        "pid": 431300,
                        "id": 431322,
                        "value": "431322",
                        "label": "新化县"
                    },
                    {
                        "pid": 431300,
                        "id": 431381,
                        "value": "431381",
                        "label": "冷水江市"
                    },
                    {
                        "pid": 431300,
                        "id": 431382,
                        "value": "431382",
                        "label": "涟源市"
                    }
                ]
            },
            {
                "pid": 430000,
                "id": 433100,
                "value": "433100",
                "label": "湘西土家族苗族自治州",
                "children": [
                    {
                        "pid": 433100,
                        "id": 433101,
                        "value": "433101",
                        "label": "吉首市"
                    },
                    {
                        "pid": 433100,
                        "id": 433122,
                        "value": "433122",
                        "label": "泸溪县"
                    },
                    {
                        "pid": 433100,
                        "id": 433123,
                        "value": "433123",
                        "label": "凤凰县"
                    },
                    {
                        "pid": 433100,
                        "id": 433124,
                        "value": "433124",
                        "label": "花垣县"
                    },
                    {
                        "pid": 433100,
                        "id": 433125,
                        "value": "433125",
                        "label": "保靖县"
                    },
                    {
                        "pid": 433100,
                        "id": 433126,
                        "value": "433126",
                        "label": "古丈县"
                    },
                    {
                        "pid": 433100,
                        "id": 433127,
                        "value": "433127",
                        "label": "永顺县"
                    },
                    {
                        "pid": 433100,
                        "id": 433130,
                        "value": "433130",
                        "label": "龙山县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 440000,
        "value": "440000",
        "label": "广东省",
        "children": [
            {
                "pid": 440000,
                "id": 440100,
                "value": "440100",
                "label": "广州市",
                "children": [
                    {
                        "pid": 440100,
                        "id": 440103,
                        "value": "440103",
                        "label": "荔湾区"
                    },
                    {
                        "pid": 440100,
                        "id": 440104,
                        "value": "440104",
                        "label": "越秀区"
                    },
                    {
                        "pid": 440100,
                        "id": 440105,
                        "value": "440105",
                        "label": "海珠区"
                    },
                    {
                        "pid": 440100,
                        "id": 440106,
                        "value": "440106",
                        "label": "天河区"
                    },
                    {
                        "pid": 440100,
                        "id": 440111,
                        "value": "440111",
                        "label": "白云区"
                    },
                    {
                        "pid": 440100,
                        "id": 440112,
                        "value": "440112",
                        "label": "黄埔区"
                    },
                    {
                        "pid": 440100,
                        "id": 440113,
                        "value": "440113",
                        "label": "番禺区"
                    },
                    {
                        "pid": 440100,
                        "id": 440114,
                        "value": "440114",
                        "label": "花都区"
                    },
                    {
                        "pid": 440100,
                        "id": 440115,
                        "value": "440115",
                        "label": "南沙区"
                    },
                    {
                        "pid": 440100,
                        "id": 440117,
                        "value": "440117",
                        "label": "从化区"
                    },
                    {
                        "pid": 440100,
                        "id": 440118,
                        "value": "440118",
                        "label": "增城区"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 440200,
                "value": "440200",
                "label": "韶关市",
                "children": [
                    {
                        "pid": 440200,
                        "id": 440203,
                        "value": "440203",
                        "label": "武江区"
                    },
                    {
                        "pid": 440200,
                        "id": 440204,
                        "value": "440204",
                        "label": "浈江区"
                    },
                    {
                        "pid": 440200,
                        "id": 440205,
                        "value": "440205",
                        "label": "曲江区"
                    },
                    {
                        "pid": 440200,
                        "id": 440222,
                        "value": "440222",
                        "label": "始兴县"
                    },
                    {
                        "pid": 440200,
                        "id": 440224,
                        "value": "440224",
                        "label": "仁化县"
                    },
                    {
                        "pid": 440200,
                        "id": 440229,
                        "value": "440229",
                        "label": "翁源县"
                    },
                    {
                        "pid": 440200,
                        "id": 440232,
                        "value": "440232",
                        "label": "乳源瑶族自治县"
                    },
                    {
                        "pid": 440200,
                        "id": 440233,
                        "value": "440233",
                        "label": "新丰县"
                    },
                    {
                        "pid": 440200,
                        "id": 440281,
                        "value": "440281",
                        "label": "乐昌市"
                    },
                    {
                        "pid": 440200,
                        "id": 440282,
                        "value": "440282",
                        "label": "南雄市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 440300,
                "value": "440300",
                "label": "深圳市",
                "children": [
                    {
                        "pid": 440300,
                        "id": 440303,
                        "value": "440303",
                        "label": "罗湖区"
                    },
                    {
                        "pid": 440300,
                        "id": 440304,
                        "value": "440304",
                        "label": "福田区"
                    },
                    {
                        "pid": 440300,
                        "id": 440305,
                        "value": "440305",
                        "label": "南山区"
                    },
                    {
                        "pid": 440300,
                        "id": 440306,
                        "value": "440306",
                        "label": "宝安区"
                    },
                    {
                        "pid": 440300,
                        "id": 440307,
                        "value": "440307",
                        "label": "龙岗区"
                    },
                    {
                        "pid": 440300,
                        "id": 440308,
                        "value": "440308",
                        "label": "盐田区"
                    },
                    {
                        "pid": 440300,
                        "id": 440309,
                        "value": "440309",
                        "label": "龙华区"
                    },
                    {
                        "pid": 440300,
                        "id": 440310,
                        "value": "440310",
                        "label": "坪山区"
                    },
                    {
                        "pid": 440300,
                        "id": 440311,
                        "value": "440311",
                        "label": "光明区"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 440400,
                "value": "440400",
                "label": "珠海市",
                "children": [
                    {
                        "pid": 440400,
                        "id": 440402,
                        "value": "440402",
                        "label": "香洲区"
                    },
                    {
                        "pid": 440400,
                        "id": 440403,
                        "value": "440403",
                        "label": "斗门区"
                    },
                    {
                        "pid": 440400,
                        "id": 440404,
                        "value": "440404",
                        "label": "金湾区"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 440500,
                "value": "440500",
                "label": "汕头市",
                "children": [
                    {
                        "pid": 440500,
                        "id": 440507,
                        "value": "440507",
                        "label": "龙湖区"
                    },
                    {
                        "pid": 440500,
                        "id": 440511,
                        "value": "440511",
                        "label": "金平区"
                    },
                    {
                        "pid": 440500,
                        "id": 440512,
                        "value": "440512",
                        "label": "濠江区"
                    },
                    {
                        "pid": 440500,
                        "id": 440513,
                        "value": "440513",
                        "label": "潮阳区"
                    },
                    {
                        "pid": 440500,
                        "id": 440514,
                        "value": "440514",
                        "label": "潮南区"
                    },
                    {
                        "pid": 440500,
                        "id": 440515,
                        "value": "440515",
                        "label": "澄海区"
                    },
                    {
                        "pid": 440500,
                        "id": 440523,
                        "value": "440523",
                        "label": "南澳县"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 440600,
                "value": "440600",
                "label": "佛山市",
                "children": [
                    {
                        "pid": 440600,
                        "id": 440604,
                        "value": "440604",
                        "label": "禅城区"
                    },
                    {
                        "pid": 440600,
                        "id": 440605,
                        "value": "440605",
                        "label": "南海区"
                    },
                    {
                        "pid": 440600,
                        "id": 440606,
                        "value": "440606",
                        "label": "顺德区"
                    },
                    {
                        "pid": 440600,
                        "id": 440607,
                        "value": "440607",
                        "label": "三水区"
                    },
                    {
                        "pid": 440600,
                        "id": 440608,
                        "value": "440608",
                        "label": "高明区"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 440700,
                "value": "440700",
                "label": "江门市",
                "children": [
                    {
                        "pid": 440700,
                        "id": 440703,
                        "value": "440703",
                        "label": "蓬江区"
                    },
                    {
                        "pid": 440700,
                        "id": 440704,
                        "value": "440704",
                        "label": "江海区"
                    },
                    {
                        "pid": 440700,
                        "id": 440705,
                        "value": "440705",
                        "label": "新会区"
                    },
                    {
                        "pid": 440700,
                        "id": 440781,
                        "value": "440781",
                        "label": "台山市"
                    },
                    {
                        "pid": 440700,
                        "id": 440783,
                        "value": "440783",
                        "label": "开平市"
                    },
                    {
                        "pid": 440700,
                        "id": 440784,
                        "value": "440784",
                        "label": "鹤山市"
                    },
                    {
                        "pid": 440700,
                        "id": 440785,
                        "value": "440785",
                        "label": "恩平市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 440800,
                "value": "440800",
                "label": "湛江市",
                "children": [
                    {
                        "pid": 440800,
                        "id": 440802,
                        "value": "440802",
                        "label": "赤坎区"
                    },
                    {
                        "pid": 440800,
                        "id": 440803,
                        "value": "440803",
                        "label": "霞山区"
                    },
                    {
                        "pid": 440800,
                        "id": 440804,
                        "value": "440804",
                        "label": "坡头区"
                    },
                    {
                        "pid": 440800,
                        "id": 440811,
                        "value": "440811",
                        "label": "麻章区"
                    },
                    {
                        "pid": 440800,
                        "id": 440823,
                        "value": "440823",
                        "label": "遂溪县"
                    },
                    {
                        "pid": 440800,
                        "id": 440825,
                        "value": "440825",
                        "label": "徐闻县"
                    },
                    {
                        "pid": 440800,
                        "id": 440881,
                        "value": "440881",
                        "label": "廉江市"
                    },
                    {
                        "pid": 440800,
                        "id": 440882,
                        "value": "440882",
                        "label": "雷州市"
                    },
                    {
                        "pid": 440800,
                        "id": 440883,
                        "value": "440883",
                        "label": "吴川市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 440900,
                "value": "440900",
                "label": "茂名市",
                "children": [
                    {
                        "pid": 440900,
                        "id": 440902,
                        "value": "440902",
                        "label": "茂南区"
                    },
                    {
                        "pid": 440900,
                        "id": 440904,
                        "value": "440904",
                        "label": "电白区"
                    },
                    {
                        "pid": 440900,
                        "id": 440981,
                        "value": "440981",
                        "label": "高州市"
                    },
                    {
                        "pid": 440900,
                        "id": 440982,
                        "value": "440982",
                        "label": "化州市"
                    },
                    {
                        "pid": 440900,
                        "id": 440983,
                        "value": "440983",
                        "label": "信宜市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 441200,
                "value": "441200",
                "label": "肇庆市",
                "children": [
                    {
                        "pid": 441200,
                        "id": 441202,
                        "value": "441202",
                        "label": "端州区"
                    },
                    {
                        "pid": 441200,
                        "id": 441203,
                        "value": "441203",
                        "label": "鼎湖区"
                    },
                    {
                        "pid": 441200,
                        "id": 441204,
                        "value": "441204",
                        "label": "高要区"
                    },
                    {
                        "pid": 441200,
                        "id": 441223,
                        "value": "441223",
                        "label": "广宁县"
                    },
                    {
                        "pid": 441200,
                        "id": 441224,
                        "value": "441224",
                        "label": "怀集县"
                    },
                    {
                        "pid": 441200,
                        "id": 441225,
                        "value": "441225",
                        "label": "封开县"
                    },
                    {
                        "pid": 441200,
                        "id": 441226,
                        "value": "441226",
                        "label": "德庆县"
                    },
                    {
                        "pid": 441200,
                        "id": 441284,
                        "value": "441284",
                        "label": "四会市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 441300,
                "value": "441300",
                "label": "惠州市",
                "children": [
                    {
                        "pid": 441300,
                        "id": 441302,
                        "value": "441302",
                        "label": "惠城区"
                    },
                    {
                        "pid": 441300,
                        "id": 441303,
                        "value": "441303",
                        "label": "惠阳区"
                    },
                    {
                        "pid": 441300,
                        "id": 441322,
                        "value": "441322",
                        "label": "博罗县"
                    },
                    {
                        "pid": 441300,
                        "id": 441323,
                        "value": "441323",
                        "label": "惠东县"
                    },
                    {
                        "pid": 441300,
                        "id": 441324,
                        "value": "441324",
                        "label": "龙门县"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 441400,
                "value": "441400",
                "label": "梅州市",
                "children": [
                    {
                        "pid": 441400,
                        "id": 441402,
                        "value": "441402",
                        "label": "梅江区"
                    },
                    {
                        "pid": 441400,
                        "id": 441403,
                        "value": "441403",
                        "label": "梅县区"
                    },
                    {
                        "pid": 441400,
                        "id": 441422,
                        "value": "441422",
                        "label": "大埔县"
                    },
                    {
                        "pid": 441400,
                        "id": 441423,
                        "value": "441423",
                        "label": "丰顺县"
                    },
                    {
                        "pid": 441400,
                        "id": 441424,
                        "value": "441424",
                        "label": "五华县"
                    },
                    {
                        "pid": 441400,
                        "id": 441426,
                        "value": "441426",
                        "label": "平远县"
                    },
                    {
                        "pid": 441400,
                        "id": 441427,
                        "value": "441427",
                        "label": "蕉岭县"
                    },
                    {
                        "pid": 441400,
                        "id": 441481,
                        "value": "441481",
                        "label": "兴宁市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 441500,
                "value": "441500",
                "label": "汕尾市",
                "children": [
                    {
                        "pid": 441500,
                        "id": 441502,
                        "value": "441502",
                        "label": "城区"
                    },
                    {
                        "pid": 441500,
                        "id": 441521,
                        "value": "441521",
                        "label": "海丰县"
                    },
                    {
                        "pid": 441500,
                        "id": 441523,
                        "value": "441523",
                        "label": "陆河县"
                    },
                    {
                        "pid": 441500,
                        "id": 441581,
                        "value": "441581",
                        "label": "陆丰市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 441600,
                "value": "441600",
                "label": "河源市",
                "children": [
                    {
                        "pid": 441600,
                        "id": 441602,
                        "value": "441602",
                        "label": "源城区"
                    },
                    {
                        "pid": 441600,
                        "id": 441621,
                        "value": "441621",
                        "label": "紫金县"
                    },
                    {
                        "pid": 441600,
                        "id": 441622,
                        "value": "441622",
                        "label": "龙川县"
                    },
                    {
                        "pid": 441600,
                        "id": 441623,
                        "value": "441623",
                        "label": "连平县"
                    },
                    {
                        "pid": 441600,
                        "id": 441624,
                        "value": "441624",
                        "label": "和平县"
                    },
                    {
                        "pid": 441600,
                        "id": 441625,
                        "value": "441625",
                        "label": "东源县"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 441700,
                "value": "441700",
                "label": "阳江市",
                "children": [
                    {
                        "pid": 441700,
                        "id": 441702,
                        "value": "441702",
                        "label": "江城区"
                    },
                    {
                        "pid": 441700,
                        "id": 441704,
                        "value": "441704",
                        "label": "阳东区"
                    },
                    {
                        "pid": 441700,
                        "id": 441721,
                        "value": "441721",
                        "label": "阳西县"
                    },
                    {
                        "pid": 441700,
                        "id": 441781,
                        "value": "441781",
                        "label": "阳春市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 441800,
                "value": "441800",
                "label": "清远市",
                "children": [
                    {
                        "pid": 441800,
                        "id": 441802,
                        "value": "441802",
                        "label": "清城区"
                    },
                    {
                        "pid": 441800,
                        "id": 441803,
                        "value": "441803",
                        "label": "清新区"
                    },
                    {
                        "pid": 441800,
                        "id": 441821,
                        "value": "441821",
                        "label": "佛冈县"
                    },
                    {
                        "pid": 441800,
                        "id": 441823,
                        "value": "441823",
                        "label": "阳山县"
                    },
                    {
                        "pid": 441800,
                        "id": 441825,
                        "value": "441825",
                        "label": "连山壮族瑶族自治县"
                    },
                    {
                        "pid": 441800,
                        "id": 441826,
                        "value": "441826",
                        "label": "连南瑶族自治县"
                    },
                    {
                        "pid": 441800,
                        "id": 441881,
                        "value": "441881",
                        "label": "英德市"
                    },
                    {
                        "pid": 441800,
                        "id": 441882,
                        "value": "441882",
                        "label": "连州市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 441900,
                "value": "441900",
                "label": "东莞市"
            },
            {
                "pid": 440000,
                "id": 442000,
                "value": "442000",
                "label": "中山市"
            },
            {
                "pid": 440000,
                "id": 445100,
                "value": "445100",
                "label": "潮州市",
                "children": [
                    {
                        "pid": 445100,
                        "id": 445102,
                        "value": "445102",
                        "label": "湘桥区"
                    },
                    {
                        "pid": 445100,
                        "id": 445103,
                        "value": "445103",
                        "label": "潮安区"
                    },
                    {
                        "pid": 445100,
                        "id": 445122,
                        "value": "445122",
                        "label": "饶平县"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 445200,
                "value": "445200",
                "label": "揭阳市",
                "children": [
                    {
                        "pid": 445200,
                        "id": 445202,
                        "value": "445202",
                        "label": "榕城区"
                    },
                    {
                        "pid": 445200,
                        "id": 445203,
                        "value": "445203",
                        "label": "揭东区"
                    },
                    {
                        "pid": 445200,
                        "id": 445222,
                        "value": "445222",
                        "label": "揭西县"
                    },
                    {
                        "pid": 445200,
                        "id": 445224,
                        "value": "445224",
                        "label": "惠来县"
                    },
                    {
                        "pid": 445200,
                        "id": 445281,
                        "value": "445281",
                        "label": "普宁市"
                    }
                ]
            },
            {
                "pid": 440000,
                "id": 445300,
                "value": "445300",
                "label": "云浮市",
                "children": [
                    {
                        "pid": 445300,
                        "id": 445302,
                        "value": "445302",
                        "label": "云城区"
                    },
                    {
                        "pid": 445300,
                        "id": 445303,
                        "value": "445303",
                        "label": "云安区"
                    },
                    {
                        "pid": 445300,
                        "id": 445321,
                        "value": "445321",
                        "label": "新兴县"
                    },
                    {
                        "pid": 445300,
                        "id": 445322,
                        "value": "445322",
                        "label": "郁南县"
                    },
                    {
                        "pid": 445300,
                        "id": 445381,
                        "value": "445381",
                        "label": "罗定市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 450000,
        "value": "450000",
        "label": "广西壮族自治区",
        "children": [
            {
                "pid": 450000,
                "id": 450100,
                "value": "450100",
                "label": "南宁市",
                "children": [
                    {
                        "pid": 450100,
                        "id": 450102,
                        "value": "450102",
                        "label": "兴宁区"
                    },
                    {
                        "pid": 450100,
                        "id": 450103,
                        "value": "450103",
                        "label": "青秀区"
                    },
                    {
                        "pid": 450100,
                        "id": 450105,
                        "value": "450105",
                        "label": "江南区"
                    },
                    {
                        "pid": 450100,
                        "id": 450107,
                        "value": "450107",
                        "label": "西乡塘区"
                    },
                    {
                        "pid": 450100,
                        "id": 450108,
                        "value": "450108",
                        "label": "良庆区"
                    },
                    {
                        "pid": 450100,
                        "id": 450109,
                        "value": "450109",
                        "label": "邕宁区"
                    },
                    {
                        "pid": 450100,
                        "id": 450110,
                        "value": "450110",
                        "label": "武鸣区"
                    },
                    {
                        "pid": 450100,
                        "id": 450123,
                        "value": "450123",
                        "label": "隆安县"
                    },
                    {
                        "pid": 450100,
                        "id": 450124,
                        "value": "450124",
                        "label": "马山县"
                    },
                    {
                        "pid": 450100,
                        "id": 450125,
                        "value": "450125",
                        "label": "上林县"
                    },
                    {
                        "pid": 450100,
                        "id": 450126,
                        "value": "450126",
                        "label": "宾阳县"
                    },
                    {
                        "pid": 450100,
                        "id": 450127,
                        "value": "450127",
                        "label": "横县"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 450200,
                "value": "450200",
                "label": "柳州市",
                "children": [
                    {
                        "pid": 450200,
                        "id": 450202,
                        "value": "450202",
                        "label": "城中区"
                    },
                    {
                        "pid": 450200,
                        "id": 450203,
                        "value": "450203",
                        "label": "鱼峰区"
                    },
                    {
                        "pid": 450200,
                        "id": 450204,
                        "value": "450204",
                        "label": "柳南区"
                    },
                    {
                        "pid": 450200,
                        "id": 450205,
                        "value": "450205",
                        "label": "柳北区"
                    },
                    {
                        "pid": 450200,
                        "id": 450206,
                        "value": "450206",
                        "label": "柳江区"
                    },
                    {
                        "pid": 450200,
                        "id": 450222,
                        "value": "450222",
                        "label": "柳城县"
                    },
                    {
                        "pid": 450200,
                        "id": 450223,
                        "value": "450223",
                        "label": "鹿寨县"
                    },
                    {
                        "pid": 450200,
                        "id": 450224,
                        "value": "450224",
                        "label": "融安县"
                    },
                    {
                        "pid": 450200,
                        "id": 450225,
                        "value": "450225",
                        "label": "融水苗族自治县"
                    },
                    {
                        "pid": 450200,
                        "id": 450226,
                        "value": "450226",
                        "label": "三江侗族自治县"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 450300,
                "value": "450300",
                "label": "桂林市",
                "children": [
                    {
                        "pid": 450300,
                        "id": 450302,
                        "value": "450302",
                        "label": "秀峰区"
                    },
                    {
                        "pid": 450300,
                        "id": 450303,
                        "value": "450303",
                        "label": "叠彩区"
                    },
                    {
                        "pid": 450300,
                        "id": 450304,
                        "value": "450304",
                        "label": "象山区"
                    },
                    {
                        "pid": 450300,
                        "id": 450305,
                        "value": "450305",
                        "label": "七星区"
                    },
                    {
                        "pid": 450300,
                        "id": 450311,
                        "value": "450311",
                        "label": "雁山区"
                    },
                    {
                        "pid": 450300,
                        "id": 450312,
                        "value": "450312",
                        "label": "临桂区"
                    },
                    {
                        "pid": 450300,
                        "id": 450321,
                        "value": "450321",
                        "label": "阳朔县"
                    },
                    {
                        "pid": 450300,
                        "id": 450323,
                        "value": "450323",
                        "label": "灵川县"
                    },
                    {
                        "pid": 450300,
                        "id": 450324,
                        "value": "450324",
                        "label": "全州县"
                    },
                    {
                        "pid": 450300,
                        "id": 450325,
                        "value": "450325",
                        "label": "兴安县"
                    },
                    {
                        "pid": 450300,
                        "id": 450326,
                        "value": "450326",
                        "label": "永福县"
                    },
                    {
                        "pid": 450300,
                        "id": 450327,
                        "value": "450327",
                        "label": "灌阳县"
                    },
                    {
                        "pid": 450300,
                        "id": 450328,
                        "value": "450328",
                        "label": "龙胜各族自治县"
                    },
                    {
                        "pid": 450300,
                        "id": 450329,
                        "value": "450329",
                        "label": "资源县"
                    },
                    {
                        "pid": 450300,
                        "id": 450330,
                        "value": "450330",
                        "label": "平乐县"
                    },
                    {
                        "pid": 450300,
                        "id": 450332,
                        "value": "450332",
                        "label": "恭城瑶族自治县"
                    },
                    {
                        "pid": 450300,
                        "id": 450381,
                        "value": "450381",
                        "label": "荔浦市"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 450400,
                "value": "450400",
                "label": "梧州市",
                "children": [
                    {
                        "pid": 450400,
                        "id": 450403,
                        "value": "450403",
                        "label": "万秀区"
                    },
                    {
                        "pid": 450400,
                        "id": 450405,
                        "value": "450405",
                        "label": "长洲区"
                    },
                    {
                        "pid": 450400,
                        "id": 450406,
                        "value": "450406",
                        "label": "龙圩区"
                    },
                    {
                        "pid": 450400,
                        "id": 450421,
                        "value": "450421",
                        "label": "苍梧县"
                    },
                    {
                        "pid": 450400,
                        "id": 450422,
                        "value": "450422",
                        "label": "藤县"
                    },
                    {
                        "pid": 450400,
                        "id": 450423,
                        "value": "450423",
                        "label": "蒙山县"
                    },
                    {
                        "pid": 450400,
                        "id": 450481,
                        "value": "450481",
                        "label": "岑溪市"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 450500,
                "value": "450500",
                "label": "北海市",
                "children": [
                    {
                        "pid": 450500,
                        "id": 450502,
                        "value": "450502",
                        "label": "海城区"
                    },
                    {
                        "pid": 450500,
                        "id": 450503,
                        "value": "450503",
                        "label": "银海区"
                    },
                    {
                        "pid": 450500,
                        "id": 450512,
                        "value": "450512",
                        "label": "铁山港区"
                    },
                    {
                        "pid": 450500,
                        "id": 450521,
                        "value": "450521",
                        "label": "合浦县"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 450600,
                "value": "450600",
                "label": "防城港市",
                "children": [
                    {
                        "pid": 450600,
                        "id": 450602,
                        "value": "450602",
                        "label": "港口区"
                    },
                    {
                        "pid": 450600,
                        "id": 450603,
                        "value": "450603",
                        "label": "防城区"
                    },
                    {
                        "pid": 450600,
                        "id": 450621,
                        "value": "450621",
                        "label": "上思县"
                    },
                    {
                        "pid": 450600,
                        "id": 450681,
                        "value": "450681",
                        "label": "东兴市"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 450700,
                "value": "450700",
                "label": "钦州市",
                "children": [
                    {
                        "pid": 450700,
                        "id": 450702,
                        "value": "450702",
                        "label": "钦南区"
                    },
                    {
                        "pid": 450700,
                        "id": 450703,
                        "value": "450703",
                        "label": "钦北区"
                    },
                    {
                        "pid": 450700,
                        "id": 450721,
                        "value": "450721",
                        "label": "灵山县"
                    },
                    {
                        "pid": 450700,
                        "id": 450722,
                        "value": "450722",
                        "label": "浦北县"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 450800,
                "value": "450800",
                "label": "贵港市",
                "children": [
                    {
                        "pid": 450800,
                        "id": 450802,
                        "value": "450802",
                        "label": "港北区"
                    },
                    {
                        "pid": 450800,
                        "id": 450803,
                        "value": "450803",
                        "label": "港南区"
                    },
                    {
                        "pid": 450800,
                        "id": 450804,
                        "value": "450804",
                        "label": "覃塘区"
                    },
                    {
                        "pid": 450800,
                        "id": 450821,
                        "value": "450821",
                        "label": "平南县"
                    },
                    {
                        "pid": 450800,
                        "id": 450881,
                        "value": "450881",
                        "label": "桂平市"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 450900,
                "value": "450900",
                "label": "玉林市",
                "children": [
                    {
                        "pid": 450900,
                        "id": 450902,
                        "value": "450902",
                        "label": "玉州区"
                    },
                    {
                        "pid": 450900,
                        "id": 450903,
                        "value": "450903",
                        "label": "福绵区"
                    },
                    {
                        "pid": 450900,
                        "id": 450921,
                        "value": "450921",
                        "label": "容县"
                    },
                    {
                        "pid": 450900,
                        "id": 450922,
                        "value": "450922",
                        "label": "陆川县"
                    },
                    {
                        "pid": 450900,
                        "id": 450923,
                        "value": "450923",
                        "label": "博白县"
                    },
                    {
                        "pid": 450900,
                        "id": 450924,
                        "value": "450924",
                        "label": "兴业县"
                    },
                    {
                        "pid": 450900,
                        "id": 450981,
                        "value": "450981",
                        "label": "北流市"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 451000,
                "value": "451000",
                "label": "百色市",
                "children": [
                    {
                        "pid": 451000,
                        "id": 451002,
                        "value": "451002",
                        "label": "右江区"
                    },
                    {
                        "pid": 451000,
                        "id": 451003,
                        "value": "451003",
                        "label": "田阳区"
                    },
                    {
                        "pid": 451000,
                        "id": 451022,
                        "value": "451022",
                        "label": "田东县"
                    },
                    {
                        "pid": 451000,
                        "id": 451024,
                        "value": "451024",
                        "label": "德保县"
                    },
                    {
                        "pid": 451000,
                        "id": 451026,
                        "value": "451026",
                        "label": "那坡县"
                    },
                    {
                        "pid": 451000,
                        "id": 451027,
                        "value": "451027",
                        "label": "凌云县"
                    },
                    {
                        "pid": 451000,
                        "id": 451028,
                        "value": "451028",
                        "label": "乐业县"
                    },
                    {
                        "pid": 451000,
                        "id": 451029,
                        "value": "451029",
                        "label": "田林县"
                    },
                    {
                        "pid": 451000,
                        "id": 451030,
                        "value": "451030",
                        "label": "西林县"
                    },
                    {
                        "pid": 451000,
                        "id": 451031,
                        "value": "451031",
                        "label": "隆林各族自治县"
                    },
                    {
                        "pid": 451000,
                        "id": 451081,
                        "value": "451081",
                        "label": "靖西市"
                    },
                    {
                        "pid": 451000,
                        "id": 451082,
                        "value": "451082",
                        "label": "平果市"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 451100,
                "value": "451100",
                "label": "贺州市",
                "children": [
                    {
                        "pid": 451100,
                        "id": 451102,
                        "value": "451102",
                        "label": "八步区"
                    },
                    {
                        "pid": 451100,
                        "id": 451103,
                        "value": "451103",
                        "label": "平桂区"
                    },
                    {
                        "pid": 451100,
                        "id": 451121,
                        "value": "451121",
                        "label": "昭平县"
                    },
                    {
                        "pid": 451100,
                        "id": 451122,
                        "value": "451122",
                        "label": "钟山县"
                    },
                    {
                        "pid": 451100,
                        "id": 451123,
                        "value": "451123",
                        "label": "富川瑶族自治县"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 451200,
                "value": "451200",
                "label": "河池市",
                "children": [
                    {
                        "pid": 451200,
                        "id": 451202,
                        "value": "451202",
                        "label": "金城江区"
                    },
                    {
                        "pid": 451200,
                        "id": 451203,
                        "value": "451203",
                        "label": "宜州区"
                    },
                    {
                        "pid": 451200,
                        "id": 451221,
                        "value": "451221",
                        "label": "南丹县"
                    },
                    {
                        "pid": 451200,
                        "id": 451222,
                        "value": "451222",
                        "label": "天峨县"
                    },
                    {
                        "pid": 451200,
                        "id": 451223,
                        "value": "451223",
                        "label": "凤山县"
                    },
                    {
                        "pid": 451200,
                        "id": 451224,
                        "value": "451224",
                        "label": "东兰县"
                    },
                    {
                        "pid": 451200,
                        "id": 451225,
                        "value": "451225",
                        "label": "罗城仫佬族自治县"
                    },
                    {
                        "pid": 451200,
                        "id": 451226,
                        "value": "451226",
                        "label": "环江毛南族自治县"
                    },
                    {
                        "pid": 451200,
                        "id": 451227,
                        "value": "451227",
                        "label": "巴马瑶族自治县"
                    },
                    {
                        "pid": 451200,
                        "id": 451228,
                        "value": "451228",
                        "label": "都安瑶族自治县"
                    },
                    {
                        "pid": 451200,
                        "id": 451229,
                        "value": "451229",
                        "label": "大化瑶族自治县"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 451300,
                "value": "451300",
                "label": "来宾市",
                "children": [
                    {
                        "pid": 451300,
                        "id": 451302,
                        "value": "451302",
                        "label": "兴宾区"
                    },
                    {
                        "pid": 451300,
                        "id": 451321,
                        "value": "451321",
                        "label": "忻城县"
                    },
                    {
                        "pid": 451300,
                        "id": 451322,
                        "value": "451322",
                        "label": "象州县"
                    },
                    {
                        "pid": 451300,
                        "id": 451323,
                        "value": "451323",
                        "label": "武宣县"
                    },
                    {
                        "pid": 451300,
                        "id": 451324,
                        "value": "451324",
                        "label": "金秀瑶族自治县"
                    },
                    {
                        "pid": 451300,
                        "id": 451381,
                        "value": "451381",
                        "label": "合山市"
                    }
                ]
            },
            {
                "pid": 450000,
                "id": 451400,
                "value": "451400",
                "label": "崇左市",
                "children": [
                    {
                        "pid": 451400,
                        "id": 451402,
                        "value": "451402",
                        "label": "江州区"
                    },
                    {
                        "pid": 451400,
                        "id": 451421,
                        "value": "451421",
                        "label": "扶绥县"
                    },
                    {
                        "pid": 451400,
                        "id": 451422,
                        "value": "451422",
                        "label": "宁明县"
                    },
                    {
                        "pid": 451400,
                        "id": 451423,
                        "value": "451423",
                        "label": "龙州县"
                    },
                    {
                        "pid": 451400,
                        "id": 451424,
                        "value": "451424",
                        "label": "大新县"
                    },
                    {
                        "pid": 451400,
                        "id": 451425,
                        "value": "451425",
                        "label": "天等县"
                    },
                    {
                        "pid": 451400,
                        "id": 451481,
                        "value": "451481",
                        "label": "凭祥市"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 460000,
        "value": "460000",
        "label": "海南省",
        "children": [
            {
                "pid": 460000,
                "id": 460100,
                "value": "460100",
                "label": "海口市",
                "children": [
                    {
                        "pid": 460100,
                        "id": 460105,
                        "value": "460105",
                        "label": "秀英区"
                    },
                    {
                        "pid": 460100,
                        "id": 460106,
                        "value": "460106",
                        "label": "龙华区"
                    },
                    {
                        "pid": 460100,
                        "id": 460107,
                        "value": "460107",
                        "label": "琼山区"
                    },
                    {
                        "pid": 460100,
                        "id": 460108,
                        "value": "460108",
                        "label": "美兰区"
                    }
                ]
            },
            {
                "pid": 460000,
                "id": 460200,
                "value": "460200",
                "label": "三亚市",
                "children": [
                    {
                        "pid": 460200,
                        "id": 460202,
                        "value": "460202",
                        "label": "海棠区"
                    },
                    {
                        "pid": 460200,
                        "id": 460203,
                        "value": "460203",
                        "label": "吉阳区"
                    },
                    {
                        "pid": 460200,
                        "id": 460204,
                        "value": "460204",
                        "label": "天涯区"
                    },
                    {
                        "pid": 460200,
                        "id": 460205,
                        "value": "460205",
                        "label": "崖州区"
                    }
                ]
            },
            {
                "pid": 460000,
                "id": 460300,
                "value": "460300",
                "label": "三沙市"
            },
            {
                "pid": 460000,
                "id": 460400,
                "value": "460400",
                "label": "儋州市"
            },
            {
                "pid": 460000,
                "id": 469001,
                "value": "469001",
                "label": "五指山市"
            },
            {
                "pid": 460000,
                "id": 469002,
                "value": "469002",
                "label": "琼海市"
            },
            {
                "pid": 460000,
                "id": 469005,
                "value": "469005",
                "label": "文昌市"
            },
            {
                "pid": 460000,
                "id": 469006,
                "value": "469006",
                "label": "万宁市"
            },
            {
                "pid": 460000,
                "id": 469007,
                "value": "469007",
                "label": "东方市"
            },
            {
                "pid": 460000,
                "id": 469021,
                "value": "469021",
                "label": "定安县"
            },
            {
                "pid": 460000,
                "id": 469022,
                "value": "469022",
                "label": "屯昌县"
            },
            {
                "pid": 460000,
                "id": 469023,
                "value": "469023",
                "label": "澄迈县"
            },
            {
                "pid": 460000,
                "id": 469024,
                "value": "469024",
                "label": "临高县"
            },
            {
                "pid": 460000,
                "id": 469025,
                "value": "469025",
                "label": "白沙黎族自治县"
            },
            {
                "pid": 460000,
                "id": 469026,
                "value": "469026",
                "label": "昌江黎族自治县"
            },
            {
                "pid": 460000,
                "id": 469027,
                "value": "469027",
                "label": "乐东黎族自治县"
            },
            {
                "pid": 460000,
                "id": 469028,
                "value": "469028",
                "label": "陵水黎族自治县"
            },
            {
                "pid": 460000,
                "id": 469029,
                "value": "469029",
                "label": "保亭黎族苗族自治县"
            },
            {
                "pid": 460000,
                "id": 469030,
                "value": "469030",
                "label": "琼中黎族苗族自治县"
            }
        ]
    },
    {
        "pid": -1,
        "id": 500000,
        "value": "500000",
        "label": "重庆市",
        "children": [
            {
                "pid": 500000,
                "id": 500101,
                "value": "500101",
                "label": "万州区"
            },
            {
                "pid": 500000,
                "id": 500102,
                "value": "500102",
                "label": "涪陵区"
            },
            {
                "pid": 500000,
                "id": 500103,
                "value": "500103",
                "label": "渝中区"
            },
            {
                "pid": 500000,
                "id": 500104,
                "value": "500104",
                "label": "大渡口区"
            },
            {
                "pid": 500000,
                "id": 500105,
                "value": "500105",
                "label": "江北区"
            },
            {
                "pid": 500000,
                "id": 500106,
                "value": "500106",
                "label": "沙坪坝区"
            },
            {
                "pid": 500000,
                "id": 500107,
                "value": "500107",
                "label": "九龙坡区"
            },
            {
                "pid": 500000,
                "id": 500108,
                "value": "500108",
                "label": "南岸区"
            },
            {
                "pid": 500000,
                "id": 500109,
                "value": "500109",
                "label": "北碚区"
            },
            {
                "pid": 500000,
                "id": 500110,
                "value": "500110",
                "label": "綦江区"
            },
            {
                "pid": 500000,
                "id": 500111,
                "value": "500111",
                "label": "大足区"
            },
            {
                "pid": 500000,
                "id": 500112,
                "value": "500112",
                "label": "渝北区"
            },
            {
                "pid": 500000,
                "id": 500113,
                "value": "500113",
                "label": "巴南区"
            },
            {
                "pid": 500000,
                "id": 500114,
                "value": "500114",
                "label": "黔江区"
            },
            {
                "pid": 500000,
                "id": 500115,
                "value": "500115",
                "label": "长寿区"
            },
            {
                "pid": 500000,
                "id": 500116,
                "value": "500116",
                "label": "江津区"
            },
            {
                "pid": 500000,
                "id": 500117,
                "value": "500117",
                "label": "合川区"
            },
            {
                "pid": 500000,
                "id": 500118,
                "value": "500118",
                "label": "永川区"
            },
            {
                "pid": 500000,
                "id": 500119,
                "value": "500119",
                "label": "南川区"
            },
            {
                "pid": 500000,
                "id": 500120,
                "value": "500120",
                "label": "璧山区"
            },
            {
                "pid": 500000,
                "id": 500151,
                "value": "500151",
                "label": "铜梁区"
            },
            {
                "pid": 500000,
                "id": 500152,
                "value": "500152",
                "label": "潼南区"
            },
            {
                "pid": 500000,
                "id": 500153,
                "value": "500153",
                "label": "荣昌区"
            },
            {
                "pid": 500000,
                "id": 500154,
                "value": "500154",
                "label": "开州区"
            },
            {
                "pid": 500000,
                "id": 500155,
                "value": "500155",
                "label": "梁平区"
            },
            {
                "pid": 500000,
                "id": 500156,
                "value": "500156",
                "label": "武隆区"
            },
            {
                "pid": 500000,
                "id": 500229,
                "value": "500229",
                "label": "城口县"
            },
            {
                "pid": 500000,
                "id": 500230,
                "value": "500230",
                "label": "丰都县"
            },
            {
                "pid": 500000,
                "id": 500231,
                "value": "500231",
                "label": "垫江县"
            },
            {
                "pid": 500000,
                "id": 500233,
                "value": "500233",
                "label": "忠县"
            },
            {
                "pid": 500000,
                "id": 500235,
                "value": "500235",
                "label": "云阳县"
            },
            {
                "pid": 500000,
                "id": 500236,
                "value": "500236",
                "label": "奉节县"
            },
            {
                "pid": 500000,
                "id": 500237,
                "value": "500237",
                "label": "巫山县"
            },
            {
                "pid": 500000,
                "id": 500238,
                "value": "500238",
                "label": "巫溪县"
            },
            {
                "pid": 500000,
                "id": 500240,
                "value": "500240",
                "label": "石柱土家族自治县"
            },
            {
                "pid": 500000,
                "id": 500241,
                "value": "500241",
                "label": "秀山土家族苗族自治县"
            },
            {
                "pid": 500000,
                "id": 500242,
                "value": "500242",
                "label": "酉阳土家族苗族自治县"
            },
            {
                "pid": 500000,
                "id": 500243,
                "value": "500243",
                "label": "彭水苗族土家族自治县"
            }
        ]
    },
    {
        "pid": -1,
        "id": 510000,
        "value": "510000",
        "label": "四川省",
        "children": [
            {
                "pid": 510000,
                "id": 510100,
                "value": "510100",
                "label": "成都市",
                "children": [
                    {
                        "pid": 510100,
                        "id": 510104,
                        "value": "510104",
                        "label": "锦江区"
                    },
                    {
                        "pid": 510100,
                        "id": 510105,
                        "value": "510105",
                        "label": "青羊区"
                    },
                    {
                        "pid": 510100,
                        "id": 510106,
                        "value": "510106",
                        "label": "金牛区"
                    },
                    {
                        "pid": 510100,
                        "id": 510107,
                        "value": "510107",
                        "label": "武侯区"
                    },
                    {
                        "pid": 510100,
                        "id": 510108,
                        "value": "510108",
                        "label": "成华区"
                    },
                    {
                        "pid": 510100,
                        "id": 510112,
                        "value": "510112",
                        "label": "龙泉驿区"
                    },
                    {
                        "pid": 510100,
                        "id": 510113,
                        "value": "510113",
                        "label": "青白江区"
                    },
                    {
                        "pid": 510100,
                        "id": 510114,
                        "value": "510114",
                        "label": "新都区"
                    },
                    {
                        "pid": 510100,
                        "id": 510115,
                        "value": "510115",
                        "label": "温江区"
                    },
                    {
                        "pid": 510100,
                        "id": 510116,
                        "value": "510116",
                        "label": "双流区"
                    },
                    {
                        "pid": 510100,
                        "id": 510117,
                        "value": "510117",
                        "label": "郫都区"
                    },
                    {
                        "pid": 510100,
                        "id": 510118,
                        "value": "510118",
                        "label": "新津区"
                    },
                    {
                        "pid": 510100,
                        "id": 510121,
                        "value": "510121",
                        "label": "金堂县"
                    },
                    {
                        "pid": 510100,
                        "id": 510129,
                        "value": "510129",
                        "label": "大邑县"
                    },
                    {
                        "pid": 510100,
                        "id": 510131,
                        "value": "510131",
                        "label": "蒲江县"
                    },
                    {
                        "pid": 510100,
                        "id": 510181,
                        "value": "510181",
                        "label": "都江堰市"
                    },
                    {
                        "pid": 510100,
                        "id": 510182,
                        "value": "510182",
                        "label": "彭州市"
                    },
                    {
                        "pid": 510100,
                        "id": 510183,
                        "value": "510183",
                        "label": "邛崃市"
                    },
                    {
                        "pid": 510100,
                        "id": 510184,
                        "value": "510184",
                        "label": "崇州市"
                    },
                    {
                        "pid": 510100,
                        "id": 510185,
                        "value": "510185",
                        "label": "简阳市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 510300,
                "value": "510300",
                "label": "自贡市",
                "children": [
                    {
                        "pid": 510300,
                        "id": 510302,
                        "value": "510302",
                        "label": "自流井区"
                    },
                    {
                        "pid": 510300,
                        "id": 510303,
                        "value": "510303",
                        "label": "贡井区"
                    },
                    {
                        "pid": 510300,
                        "id": 510304,
                        "value": "510304",
                        "label": "大安区"
                    },
                    {
                        "pid": 510300,
                        "id": 510311,
                        "value": "510311",
                        "label": "沿滩区"
                    },
                    {
                        "pid": 510300,
                        "id": 510321,
                        "value": "510321",
                        "label": "荣县"
                    },
                    {
                        "pid": 510300,
                        "id": 510322,
                        "value": "510322",
                        "label": "富顺县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 510400,
                "value": "510400",
                "label": "攀枝花市",
                "children": [
                    {
                        "pid": 510400,
                        "id": 510402,
                        "value": "510402",
                        "label": "东区"
                    },
                    {
                        "pid": 510400,
                        "id": 510403,
                        "value": "510403",
                        "label": "西区"
                    },
                    {
                        "pid": 510400,
                        "id": 510411,
                        "value": "510411",
                        "label": "仁和区"
                    },
                    {
                        "pid": 510400,
                        "id": 510421,
                        "value": "510421",
                        "label": "米易县"
                    },
                    {
                        "pid": 510400,
                        "id": 510422,
                        "value": "510422",
                        "label": "盐边县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 510500,
                "value": "510500",
                "label": "泸州市",
                "children": [
                    {
                        "pid": 510500,
                        "id": 510502,
                        "value": "510502",
                        "label": "江阳区"
                    },
                    {
                        "pid": 510500,
                        "id": 510503,
                        "value": "510503",
                        "label": "纳溪区"
                    },
                    {
                        "pid": 510500,
                        "id": 510504,
                        "value": "510504",
                        "label": "龙马潭区"
                    },
                    {
                        "pid": 510500,
                        "id": 510521,
                        "value": "510521",
                        "label": "泸县"
                    },
                    {
                        "pid": 510500,
                        "id": 510522,
                        "value": "510522",
                        "label": "合江县"
                    },
                    {
                        "pid": 510500,
                        "id": 510524,
                        "value": "510524",
                        "label": "叙永县"
                    },
                    {
                        "pid": 510500,
                        "id": 510525,
                        "value": "510525",
                        "label": "古蔺县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 510600,
                "value": "510600",
                "label": "德阳市",
                "children": [
                    {
                        "pid": 510600,
                        "id": 510603,
                        "value": "510603",
                        "label": "旌阳区"
                    },
                    {
                        "pid": 510600,
                        "id": 510604,
                        "value": "510604",
                        "label": "罗江区"
                    },
                    {
                        "pid": 510600,
                        "id": 510623,
                        "value": "510623",
                        "label": "中江县"
                    },
                    {
                        "pid": 510600,
                        "id": 510681,
                        "value": "510681",
                        "label": "广汉市"
                    },
                    {
                        "pid": 510600,
                        "id": 510682,
                        "value": "510682",
                        "label": "什邡市"
                    },
                    {
                        "pid": 510600,
                        "id": 510683,
                        "value": "510683",
                        "label": "绵竹市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 510700,
                "value": "510700",
                "label": "绵阳市",
                "children": [
                    {
                        "pid": 510700,
                        "id": 510703,
                        "value": "510703",
                        "label": "涪城区"
                    },
                    {
                        "pid": 510700,
                        "id": 510704,
                        "value": "510704",
                        "label": "游仙区"
                    },
                    {
                        "pid": 510700,
                        "id": 510705,
                        "value": "510705",
                        "label": "安州区"
                    },
                    {
                        "pid": 510700,
                        "id": 510722,
                        "value": "510722",
                        "label": "三台县"
                    },
                    {
                        "pid": 510700,
                        "id": 510723,
                        "value": "510723",
                        "label": "盐亭县"
                    },
                    {
                        "pid": 510700,
                        "id": 510725,
                        "value": "510725",
                        "label": "梓潼县"
                    },
                    {
                        "pid": 510700,
                        "id": 510726,
                        "value": "510726",
                        "label": "北川羌族自治县"
                    },
                    {
                        "pid": 510700,
                        "id": 510727,
                        "value": "510727",
                        "label": "平武县"
                    },
                    {
                        "pid": 510700,
                        "id": 510781,
                        "value": "510781",
                        "label": "江油市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 510800,
                "value": "510800",
                "label": "广元市",
                "children": [
                    {
                        "pid": 510800,
                        "id": 510802,
                        "value": "510802",
                        "label": "利州区"
                    },
                    {
                        "pid": 510800,
                        "id": 510811,
                        "value": "510811",
                        "label": "昭化区"
                    },
                    {
                        "pid": 510800,
                        "id": 510812,
                        "value": "510812",
                        "label": "朝天区"
                    },
                    {
                        "pid": 510800,
                        "id": 510821,
                        "value": "510821",
                        "label": "旺苍县"
                    },
                    {
                        "pid": 510800,
                        "id": 510822,
                        "value": "510822",
                        "label": "青川县"
                    },
                    {
                        "pid": 510800,
                        "id": 510823,
                        "value": "510823",
                        "label": "剑阁县"
                    },
                    {
                        "pid": 510800,
                        "id": 510824,
                        "value": "510824",
                        "label": "苍溪县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 510900,
                "value": "510900",
                "label": "遂宁市",
                "children": [
                    {
                        "pid": 510900,
                        "id": 510903,
                        "value": "510903",
                        "label": "船山区"
                    },
                    {
                        "pid": 510900,
                        "id": 510904,
                        "value": "510904",
                        "label": "安居区"
                    },
                    {
                        "pid": 510900,
                        "id": 510921,
                        "value": "510921",
                        "label": "蓬溪县"
                    },
                    {
                        "pid": 510900,
                        "id": 510923,
                        "value": "510923",
                        "label": "大英县"
                    },
                    {
                        "pid": 510900,
                        "id": 510981,
                        "value": "510981",
                        "label": "射洪市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511000,
                "value": "511000",
                "label": "内江市",
                "children": [
                    {
                        "pid": 511000,
                        "id": 511002,
                        "value": "511002",
                        "label": "市中区"
                    },
                    {
                        "pid": 511000,
                        "id": 511011,
                        "value": "511011",
                        "label": "东兴区"
                    },
                    {
                        "pid": 511000,
                        "id": 511024,
                        "value": "511024",
                        "label": "威远县"
                    },
                    {
                        "pid": 511000,
                        "id": 511025,
                        "value": "511025",
                        "label": "资中县"
                    },
                    {
                        "pid": 511000,
                        "id": 511083,
                        "value": "511083",
                        "label": "隆昌市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511100,
                "value": "511100",
                "label": "乐山市",
                "children": [
                    {
                        "pid": 511100,
                        "id": 511102,
                        "value": "511102",
                        "label": "市中区"
                    },
                    {
                        "pid": 511100,
                        "id": 511111,
                        "value": "511111",
                        "label": "沙湾区"
                    },
                    {
                        "pid": 511100,
                        "id": 511112,
                        "value": "511112",
                        "label": "五通桥区"
                    },
                    {
                        "pid": 511100,
                        "id": 511113,
                        "value": "511113",
                        "label": "金口河区"
                    },
                    {
                        "pid": 511100,
                        "id": 511123,
                        "value": "511123",
                        "label": "犍为县"
                    },
                    {
                        "pid": 511100,
                        "id": 511124,
                        "value": "511124",
                        "label": "井研县"
                    },
                    {
                        "pid": 511100,
                        "id": 511126,
                        "value": "511126",
                        "label": "夹江县"
                    },
                    {
                        "pid": 511100,
                        "id": 511129,
                        "value": "511129",
                        "label": "沐川县"
                    },
                    {
                        "pid": 511100,
                        "id": 511132,
                        "value": "511132",
                        "label": "峨边彝族自治县"
                    },
                    {
                        "pid": 511100,
                        "id": 511133,
                        "value": "511133",
                        "label": "马边彝族自治县"
                    },
                    {
                        "pid": 511100,
                        "id": 511181,
                        "value": "511181",
                        "label": "峨眉山市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511300,
                "value": "511300",
                "label": "南充市",
                "children": [
                    {
                        "pid": 511300,
                        "id": 511302,
                        "value": "511302",
                        "label": "顺庆区"
                    },
                    {
                        "pid": 511300,
                        "id": 511303,
                        "value": "511303",
                        "label": "高坪区"
                    },
                    {
                        "pid": 511300,
                        "id": 511304,
                        "value": "511304",
                        "label": "嘉陵区"
                    },
                    {
                        "pid": 511300,
                        "id": 511321,
                        "value": "511321",
                        "label": "南部县"
                    },
                    {
                        "pid": 511300,
                        "id": 511322,
                        "value": "511322",
                        "label": "营山县"
                    },
                    {
                        "pid": 511300,
                        "id": 511323,
                        "value": "511323",
                        "label": "蓬安县"
                    },
                    {
                        "pid": 511300,
                        "id": 511324,
                        "value": "511324",
                        "label": "仪陇县"
                    },
                    {
                        "pid": 511300,
                        "id": 511325,
                        "value": "511325",
                        "label": "西充县"
                    },
                    {
                        "pid": 511300,
                        "id": 511381,
                        "value": "511381",
                        "label": "阆中市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511400,
                "value": "511400",
                "label": "眉山市",
                "children": [
                    {
                        "pid": 511400,
                        "id": 511402,
                        "value": "511402",
                        "label": "东坡区"
                    },
                    {
                        "pid": 511400,
                        "id": 511403,
                        "value": "511403",
                        "label": "彭山区"
                    },
                    {
                        "pid": 511400,
                        "id": 511421,
                        "value": "511421",
                        "label": "仁寿县"
                    },
                    {
                        "pid": 511400,
                        "id": 511423,
                        "value": "511423",
                        "label": "洪雅县"
                    },
                    {
                        "pid": 511400,
                        "id": 511424,
                        "value": "511424",
                        "label": "丹棱县"
                    },
                    {
                        "pid": 511400,
                        "id": 511425,
                        "value": "511425",
                        "label": "青神县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511500,
                "value": "511500",
                "label": "宜宾市",
                "children": [
                    {
                        "pid": 511500,
                        "id": 511502,
                        "value": "511502",
                        "label": "翠屏区"
                    },
                    {
                        "pid": 511500,
                        "id": 511503,
                        "value": "511503",
                        "label": "南溪区"
                    },
                    {
                        "pid": 511500,
                        "id": 511504,
                        "value": "511504",
                        "label": "叙州区"
                    },
                    {
                        "pid": 511500,
                        "id": 511523,
                        "value": "511523",
                        "label": "江安县"
                    },
                    {
                        "pid": 511500,
                        "id": 511524,
                        "value": "511524",
                        "label": "长宁县"
                    },
                    {
                        "pid": 511500,
                        "id": 511525,
                        "value": "511525",
                        "label": "高县"
                    },
                    {
                        "pid": 511500,
                        "id": 511526,
                        "value": "511526",
                        "label": "珙县"
                    },
                    {
                        "pid": 511500,
                        "id": 511527,
                        "value": "511527",
                        "label": "筠连县"
                    },
                    {
                        "pid": 511500,
                        "id": 511528,
                        "value": "511528",
                        "label": "兴文县"
                    },
                    {
                        "pid": 511500,
                        "id": 511529,
                        "value": "511529",
                        "label": "屏山县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511600,
                "value": "511600",
                "label": "广安市",
                "children": [
                    {
                        "pid": 511600,
                        "id": 511602,
                        "value": "511602",
                        "label": "广安区"
                    },
                    {
                        "pid": 511600,
                        "id": 511603,
                        "value": "511603",
                        "label": "前锋区"
                    },
                    {
                        "pid": 511600,
                        "id": 511621,
                        "value": "511621",
                        "label": "岳池县"
                    },
                    {
                        "pid": 511600,
                        "id": 511622,
                        "value": "511622",
                        "label": "武胜县"
                    },
                    {
                        "pid": 511600,
                        "id": 511623,
                        "value": "511623",
                        "label": "邻水县"
                    },
                    {
                        "pid": 511600,
                        "id": 511681,
                        "value": "511681",
                        "label": "华蓥市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511700,
                "value": "511700",
                "label": "达州市",
                "children": [
                    {
                        "pid": 511700,
                        "id": 511702,
                        "value": "511702",
                        "label": "通川区"
                    },
                    {
                        "pid": 511700,
                        "id": 511703,
                        "value": "511703",
                        "label": "达川区"
                    },
                    {
                        "pid": 511700,
                        "id": 511722,
                        "value": "511722",
                        "label": "宣汉县"
                    },
                    {
                        "pid": 511700,
                        "id": 511723,
                        "value": "511723",
                        "label": "开江县"
                    },
                    {
                        "pid": 511700,
                        "id": 511724,
                        "value": "511724",
                        "label": "大竹县"
                    },
                    {
                        "pid": 511700,
                        "id": 511725,
                        "value": "511725",
                        "label": "渠县"
                    },
                    {
                        "pid": 511700,
                        "id": 511781,
                        "value": "511781",
                        "label": "万源市"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511800,
                "value": "511800",
                "label": "雅安市",
                "children": [
                    {
                        "pid": 511800,
                        "id": 511802,
                        "value": "511802",
                        "label": "雨城区"
                    },
                    {
                        "pid": 511800,
                        "id": 511803,
                        "value": "511803",
                        "label": "名山区"
                    },
                    {
                        "pid": 511800,
                        "id": 511822,
                        "value": "511822",
                        "label": "荥经县"
                    },
                    {
                        "pid": 511800,
                        "id": 511823,
                        "value": "511823",
                        "label": "汉源县"
                    },
                    {
                        "pid": 511800,
                        "id": 511824,
                        "value": "511824",
                        "label": "石棉县"
                    },
                    {
                        "pid": 511800,
                        "id": 511825,
                        "value": "511825",
                        "label": "天全县"
                    },
                    {
                        "pid": 511800,
                        "id": 511826,
                        "value": "511826",
                        "label": "芦山县"
                    },
                    {
                        "pid": 511800,
                        "id": 511827,
                        "value": "511827",
                        "label": "宝兴县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 511900,
                "value": "511900",
                "label": "巴中市",
                "children": [
                    {
                        "pid": 511900,
                        "id": 511902,
                        "value": "511902",
                        "label": "巴州区"
                    },
                    {
                        "pid": 511900,
                        "id": 511903,
                        "value": "511903",
                        "label": "恩阳区"
                    },
                    {
                        "pid": 511900,
                        "id": 511921,
                        "value": "511921",
                        "label": "通江县"
                    },
                    {
                        "pid": 511900,
                        "id": 511922,
                        "value": "511922",
                        "label": "南江县"
                    },
                    {
                        "pid": 511900,
                        "id": 511923,
                        "value": "511923",
                        "label": "平昌县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 512000,
                "value": "512000",
                "label": "资阳市",
                "children": [
                    {
                        "pid": 512000,
                        "id": 512002,
                        "value": "512002",
                        "label": "雁江区"
                    },
                    {
                        "pid": 512000,
                        "id": 512021,
                        "value": "512021",
                        "label": "安岳县"
                    },
                    {
                        "pid": 512000,
                        "id": 512022,
                        "value": "512022",
                        "label": "乐至县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 513200,
                "value": "513200",
                "label": "阿坝藏族羌族自治州",
                "children": [
                    {
                        "pid": 513200,
                        "id": 513201,
                        "value": "513201",
                        "label": "马尔康市"
                    },
                    {
                        "pid": 513200,
                        "id": 513221,
                        "value": "513221",
                        "label": "汶川县"
                    },
                    {
                        "pid": 513200,
                        "id": 513222,
                        "value": "513222",
                        "label": "理县"
                    },
                    {
                        "pid": 513200,
                        "id": 513223,
                        "value": "513223",
                        "label": "茂县"
                    },
                    {
                        "pid": 513200,
                        "id": 513224,
                        "value": "513224",
                        "label": "松潘县"
                    },
                    {
                        "pid": 513200,
                        "id": 513225,
                        "value": "513225",
                        "label": "九寨沟县"
                    },
                    {
                        "pid": 513200,
                        "id": 513226,
                        "value": "513226",
                        "label": "金川县"
                    },
                    {
                        "pid": 513200,
                        "id": 513227,
                        "value": "513227",
                        "label": "小金县"
                    },
                    {
                        "pid": 513200,
                        "id": 513228,
                        "value": "513228",
                        "label": "黑水县"
                    },
                    {
                        "pid": 513200,
                        "id": 513230,
                        "value": "513230",
                        "label": "壤塘县"
                    },
                    {
                        "pid": 513200,
                        "id": 513231,
                        "value": "513231",
                        "label": "阿坝县"
                    },
                    {
                        "pid": 513200,
                        "id": 513232,
                        "value": "513232",
                        "label": "若尔盖县"
                    },
                    {
                        "pid": 513200,
                        "id": 513233,
                        "value": "513233",
                        "label": "红原县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 513300,
                "value": "513300",
                "label": "甘孜藏族自治州",
                "children": [
                    {
                        "pid": 513300,
                        "id": 513301,
                        "value": "513301",
                        "label": "康定市"
                    },
                    {
                        "pid": 513300,
                        "id": 513322,
                        "value": "513322",
                        "label": "泸定县"
                    },
                    {
                        "pid": 513300,
                        "id": 513323,
                        "value": "513323",
                        "label": "丹巴县"
                    },
                    {
                        "pid": 513300,
                        "id": 513324,
                        "value": "513324",
                        "label": "九龙县"
                    },
                    {
                        "pid": 513300,
                        "id": 513325,
                        "value": "513325",
                        "label": "雅江县"
                    },
                    {
                        "pid": 513300,
                        "id": 513326,
                        "value": "513326",
                        "label": "道孚县"
                    },
                    {
                        "pid": 513300,
                        "id": 513327,
                        "value": "513327",
                        "label": "炉霍县"
                    },
                    {
                        "pid": 513300,
                        "id": 513328,
                        "value": "513328",
                        "label": "甘孜县"
                    },
                    {
                        "pid": 513300,
                        "id": 513329,
                        "value": "513329",
                        "label": "新龙县"
                    },
                    {
                        "pid": 513300,
                        "id": 513330,
                        "value": "513330",
                        "label": "德格县"
                    },
                    {
                        "pid": 513300,
                        "id": 513331,
                        "value": "513331",
                        "label": "白玉县"
                    },
                    {
                        "pid": 513300,
                        "id": 513332,
                        "value": "513332",
                        "label": "石渠县"
                    },
                    {
                        "pid": 513300,
                        "id": 513333,
                        "value": "513333",
                        "label": "色达县"
                    },
                    {
                        "pid": 513300,
                        "id": 513334,
                        "value": "513334",
                        "label": "理塘县"
                    },
                    {
                        "pid": 513300,
                        "id": 513335,
                        "value": "513335",
                        "label": "巴塘县"
                    },
                    {
                        "pid": 513300,
                        "id": 513336,
                        "value": "513336",
                        "label": "乡城县"
                    },
                    {
                        "pid": 513300,
                        "id": 513337,
                        "value": "513337",
                        "label": "稻城县"
                    },
                    {
                        "pid": 513300,
                        "id": 513338,
                        "value": "513338",
                        "label": "得荣县"
                    }
                ]
            },
            {
                "pid": 510000,
                "id": 513400,
                "value": "513400",
                "label": "凉山彝族自治州",
                "children": [
                    {
                        "pid": 513400,
                        "id": 513401,
                        "value": "513401",
                        "label": "西昌市"
                    },
                    {
                        "pid": 513400,
                        "id": 513422,
                        "value": "513422",
                        "label": "木里藏族自治县"
                    },
                    {
                        "pid": 513400,
                        "id": 513423,
                        "value": "513423",
                        "label": "盐源县"
                    },
                    {
                        "pid": 513400,
                        "id": 513424,
                        "value": "513424",
                        "label": "德昌县"
                    },
                    {
                        "pid": 513400,
                        "id": 513425,
                        "value": "513425",
                        "label": "会理县"
                    },
                    {
                        "pid": 513400,
                        "id": 513426,
                        "value": "513426",
                        "label": "会东县"
                    },
                    {
                        "pid": 513400,
                        "id": 513427,
                        "value": "513427",
                        "label": "宁南县"
                    },
                    {
                        "pid": 513400,
                        "id": 513428,
                        "value": "513428",
                        "label": "普格县"
                    },
                    {
                        "pid": 513400,
                        "id": 513429,
                        "value": "513429",
                        "label": "布拖县"
                    },
                    {
                        "pid": 513400,
                        "id": 513430,
                        "value": "513430",
                        "label": "金阳县"
                    },
                    {
                        "pid": 513400,
                        "id": 513431,
                        "value": "513431",
                        "label": "昭觉县"
                    },
                    {
                        "pid": 513400,
                        "id": 513432,
                        "value": "513432",
                        "label": "喜德县"
                    },
                    {
                        "pid": 513400,
                        "id": 513433,
                        "value": "513433",
                        "label": "冕宁县"
                    },
                    {
                        "pid": 513400,
                        "id": 513434,
                        "value": "513434",
                        "label": "越西县"
                    },
                    {
                        "pid": 513400,
                        "id": 513435,
                        "value": "513435",
                        "label": "甘洛县"
                    },
                    {
                        "pid": 513400,
                        "id": 513436,
                        "value": "513436",
                        "label": "美姑县"
                    },
                    {
                        "pid": 513400,
                        "id": 513437,
                        "value": "513437",
                        "label": "雷波县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 520000,
        "value": "520000",
        "label": "贵州省",
        "children": [
            {
                "pid": 520000,
                "id": 520100,
                "value": "520100",
                "label": "贵阳市",
                "children": [
                    {
                        "pid": 520100,
                        "id": 520102,
                        "value": "520102",
                        "label": "南明区"
                    },
                    {
                        "pid": 520100,
                        "id": 520103,
                        "value": "520103",
                        "label": "云岩区"
                    },
                    {
                        "pid": 520100,
                        "id": 520111,
                        "value": "520111",
                        "label": "花溪区"
                    },
                    {
                        "pid": 520100,
                        "id": 520112,
                        "value": "520112",
                        "label": "乌当区"
                    },
                    {
                        "pid": 520100,
                        "id": 520113,
                        "value": "520113",
                        "label": "白云区"
                    },
                    {
                        "pid": 520100,
                        "id": 520115,
                        "value": "520115",
                        "label": "观山湖区"
                    },
                    {
                        "pid": 520100,
                        "id": 520121,
                        "value": "520121",
                        "label": "开阳县"
                    },
                    {
                        "pid": 520100,
                        "id": 520122,
                        "value": "520122",
                        "label": "息烽县"
                    },
                    {
                        "pid": 520100,
                        "id": 520123,
                        "value": "520123",
                        "label": "修文县"
                    },
                    {
                        "pid": 520100,
                        "id": 520181,
                        "value": "520181",
                        "label": "清镇市"
                    }
                ]
            },
            {
                "pid": 520000,
                "id": 520200,
                "value": "520200",
                "label": "六盘水市",
                "children": [
                    {
                        "pid": 520200,
                        "id": 520201,
                        "value": "520201",
                        "label": "钟山区"
                    },
                    {
                        "pid": 520200,
                        "id": 520203,
                        "value": "520203",
                        "label": "六枝特区"
                    },
                    {
                        "pid": 520200,
                        "id": 520221,
                        "value": "520221",
                        "label": "水城县"
                    },
                    {
                        "pid": 520200,
                        "id": 520281,
                        "value": "520281",
                        "label": "盘州市"
                    }
                ]
            },
            {
                "pid": 520000,
                "id": 520300,
                "value": "520300",
                "label": "遵义市",
                "children": [
                    {
                        "pid": 520300,
                        "id": 520302,
                        "value": "520302",
                        "label": "红花岗区"
                    },
                    {
                        "pid": 520300,
                        "id": 520303,
                        "value": "520303",
                        "label": "汇川区"
                    },
                    {
                        "pid": 520300,
                        "id": 520304,
                        "value": "520304",
                        "label": "播州区"
                    },
                    {
                        "pid": 520300,
                        "id": 520322,
                        "value": "520322",
                        "label": "桐梓县"
                    },
                    {
                        "pid": 520300,
                        "id": 520323,
                        "value": "520323",
                        "label": "绥阳县"
                    },
                    {
                        "pid": 520300,
                        "id": 520324,
                        "value": "520324",
                        "label": "正安县"
                    },
                    {
                        "pid": 520300,
                        "id": 520325,
                        "value": "520325",
                        "label": "道真仡佬族苗族自治县"
                    },
                    {
                        "pid": 520300,
                        "id": 520326,
                        "value": "520326",
                        "label": "务川仡佬族苗族自治县"
                    },
                    {
                        "pid": 520300,
                        "id": 520327,
                        "value": "520327",
                        "label": "凤冈县"
                    },
                    {
                        "pid": 520300,
                        "id": 520328,
                        "value": "520328",
                        "label": "湄潭县"
                    },
                    {
                        "pid": 520300,
                        "id": 520329,
                        "value": "520329",
                        "label": "余庆县"
                    },
                    {
                        "pid": 520300,
                        "id": 520330,
                        "value": "520330",
                        "label": "习水县"
                    },
                    {
                        "pid": 520300,
                        "id": 520381,
                        "value": "520381",
                        "label": "赤水市"
                    },
                    {
                        "pid": 520300,
                        "id": 520382,
                        "value": "520382",
                        "label": "仁怀市"
                    }
                ]
            },
            {
                "pid": 520000,
                "id": 520400,
                "value": "520400",
                "label": "安顺市",
                "children": [
                    {
                        "pid": 520400,
                        "id": 520402,
                        "value": "520402",
                        "label": "西秀区"
                    },
                    {
                        "pid": 520400,
                        "id": 520403,
                        "value": "520403",
                        "label": "平坝区"
                    },
                    {
                        "pid": 520400,
                        "id": 520422,
                        "value": "520422",
                        "label": "普定县"
                    },
                    {
                        "pid": 520400,
                        "id": 520423,
                        "value": "520423",
                        "label": "镇宁布依族苗族自治县"
                    },
                    {
                        "pid": 520400,
                        "id": 520424,
                        "value": "520424",
                        "label": "关岭布依族苗族自治县"
                    },
                    {
                        "pid": 520400,
                        "id": 520425,
                        "value": "520425",
                        "label": "紫云苗族布依族自治县"
                    }
                ]
            },
            {
                "pid": 520000,
                "id": 520500,
                "value": "520500",
                "label": "毕节市",
                "children": [
                    {
                        "pid": 520500,
                        "id": 520502,
                        "value": "520502",
                        "label": "七星关区"
                    },
                    {
                        "pid": 520500,
                        "id": 520521,
                        "value": "520521",
                        "label": "大方县"
                    },
                    {
                        "pid": 520500,
                        "id": 520522,
                        "value": "520522",
                        "label": "黔西县"
                    },
                    {
                        "pid": 520500,
                        "id": 520523,
                        "value": "520523",
                        "label": "金沙县"
                    },
                    {
                        "pid": 520500,
                        "id": 520524,
                        "value": "520524",
                        "label": "织金县"
                    },
                    {
                        "pid": 520500,
                        "id": 520525,
                        "value": "520525",
                        "label": "纳雍县"
                    },
                    {
                        "pid": 520500,
                        "id": 520526,
                        "value": "520526",
                        "label": "威宁彝族回族苗族自治县"
                    },
                    {
                        "pid": 520500,
                        "id": 520527,
                        "value": "520527",
                        "label": "赫章县"
                    }
                ]
            },
            {
                "pid": 520000,
                "id": 520600,
                "value": "520600",
                "label": "铜仁市",
                "children": [
                    {
                        "pid": 520600,
                        "id": 520602,
                        "value": "520602",
                        "label": "碧江区"
                    },
                    {
                        "pid": 520600,
                        "id": 520603,
                        "value": "520603",
                        "label": "万山区"
                    },
                    {
                        "pid": 520600,
                        "id": 520621,
                        "value": "520621",
                        "label": "江口县"
                    },
                    {
                        "pid": 520600,
                        "id": 520622,
                        "value": "520622",
                        "label": "玉屏侗族自治县"
                    },
                    {
                        "pid": 520600,
                        "id": 520623,
                        "value": "520623",
                        "label": "石阡县"
                    },
                    {
                        "pid": 520600,
                        "id": 520624,
                        "value": "520624",
                        "label": "思南县"
                    },
                    {
                        "pid": 520600,
                        "id": 520625,
                        "value": "520625",
                        "label": "印江土家族苗族自治县"
                    },
                    {
                        "pid": 520600,
                        "id": 520626,
                        "value": "520626",
                        "label": "德江县"
                    },
                    {
                        "pid": 520600,
                        "id": 520627,
                        "value": "520627",
                        "label": "沿河土家族自治县"
                    },
                    {
                        "pid": 520600,
                        "id": 520628,
                        "value": "520628",
                        "label": "松桃苗族自治县"
                    }
                ]
            },
            {
                "pid": 520000,
                "id": 522300,
                "value": "522300",
                "label": "黔西南布依族苗族自治州",
                "children": [
                    {
                        "pid": 522300,
                        "id": 522301,
                        "value": "522301",
                        "label": "兴义市"
                    },
                    {
                        "pid": 522300,
                        "id": 522302,
                        "value": "522302",
                        "label": "兴仁市"
                    },
                    {
                        "pid": 522300,
                        "id": 522323,
                        "value": "522323",
                        "label": "普安县"
                    },
                    {
                        "pid": 522300,
                        "id": 522324,
                        "value": "522324",
                        "label": "晴隆县"
                    },
                    {
                        "pid": 522300,
                        "id": 522325,
                        "value": "522325",
                        "label": "贞丰县"
                    },
                    {
                        "pid": 522300,
                        "id": 522326,
                        "value": "522326",
                        "label": "望谟县"
                    },
                    {
                        "pid": 522300,
                        "id": 522327,
                        "value": "522327",
                        "label": "册亨县"
                    },
                    {
                        "pid": 522300,
                        "id": 522328,
                        "value": "522328",
                        "label": "安龙县"
                    }
                ]
            },
            {
                "pid": 520000,
                "id": 522600,
                "value": "522600",
                "label": "黔东南苗族侗族自治州",
                "children": [
                    {
                        "pid": 522600,
                        "id": 522601,
                        "value": "522601",
                        "label": "凯里市"
                    },
                    {
                        "pid": 522600,
                        "id": 522622,
                        "value": "522622",
                        "label": "黄平县"
                    },
                    {
                        "pid": 522600,
                        "id": 522623,
                        "value": "522623",
                        "label": "施秉县"
                    },
                    {
                        "pid": 522600,
                        "id": 522624,
                        "value": "522624",
                        "label": "三穗县"
                    },
                    {
                        "pid": 522600,
                        "id": 522625,
                        "value": "522625",
                        "label": "镇远县"
                    },
                    {
                        "pid": 522600,
                        "id": 522626,
                        "value": "522626",
                        "label": "岑巩县"
                    },
                    {
                        "pid": 522600,
                        "id": 522627,
                        "value": "522627",
                        "label": "天柱县"
                    },
                    {
                        "pid": 522600,
                        "id": 522628,
                        "value": "522628",
                        "label": "锦屏县"
                    },
                    {
                        "pid": 522600,
                        "id": 522629,
                        "value": "522629",
                        "label": "剑河县"
                    },
                    {
                        "pid": 522600,
                        "id": 522630,
                        "value": "522630",
                        "label": "台江县"
                    },
                    {
                        "pid": 522600,
                        "id": 522631,
                        "value": "522631",
                        "label": "黎平县"
                    },
                    {
                        "pid": 522600,
                        "id": 522632,
                        "value": "522632",
                        "label": "榕江县"
                    },
                    {
                        "pid": 522600,
                        "id": 522633,
                        "value": "522633",
                        "label": "从江县"
                    },
                    {
                        "pid": 522600,
                        "id": 522634,
                        "value": "522634",
                        "label": "雷山县"
                    },
                    {
                        "pid": 522600,
                        "id": 522635,
                        "value": "522635",
                        "label": "麻江县"
                    },
                    {
                        "pid": 522600,
                        "id": 522636,
                        "value": "522636",
                        "label": "丹寨县"
                    }
                ]
            },
            {
                "pid": 520000,
                "id": 522700,
                "value": "522700",
                "label": "黔南布依族苗族自治州",
                "children": [
                    {
                        "pid": 522700,
                        "id": 522701,
                        "value": "522701",
                        "label": "都匀市"
                    },
                    {
                        "pid": 522700,
                        "id": 522702,
                        "value": "522702",
                        "label": "福泉市"
                    },
                    {
                        "pid": 522700,
                        "id": 522722,
                        "value": "522722",
                        "label": "荔波县"
                    },
                    {
                        "pid": 522700,
                        "id": 522723,
                        "value": "522723",
                        "label": "贵定县"
                    },
                    {
                        "pid": 522700,
                        "id": 522725,
                        "value": "522725",
                        "label": "瓮安县"
                    },
                    {
                        "pid": 522700,
                        "id": 522726,
                        "value": "522726",
                        "label": "独山县"
                    },
                    {
                        "pid": 522700,
                        "id": 522727,
                        "value": "522727",
                        "label": "平塘县"
                    },
                    {
                        "pid": 522700,
                        "id": 522728,
                        "value": "522728",
                        "label": "罗甸县"
                    },
                    {
                        "pid": 522700,
                        "id": 522729,
                        "value": "522729",
                        "label": "长顺县"
                    },
                    {
                        "pid": 522700,
                        "id": 522730,
                        "value": "522730",
                        "label": "龙里县"
                    },
                    {
                        "pid": 522700,
                        "id": 522731,
                        "value": "522731",
                        "label": "惠水县"
                    },
                    {
                        "pid": 522700,
                        "id": 522732,
                        "value": "522732",
                        "label": "三都水族自治县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 530000,
        "value": "530000",
        "label": "云南省",
        "children": [
            {
                "pid": 530000,
                "id": 530100,
                "value": "530100",
                "label": "昆明市",
                "children": [
                    {
                        "pid": 530100,
                        "id": 530102,
                        "value": "530102",
                        "label": "五华区"
                    },
                    {
                        "pid": 530100,
                        "id": 530103,
                        "value": "530103",
                        "label": "盘龙区"
                    },
                    {
                        "pid": 530100,
                        "id": 530111,
                        "value": "530111",
                        "label": "官渡区"
                    },
                    {
                        "pid": 530100,
                        "id": 530112,
                        "value": "530112",
                        "label": "西山区"
                    },
                    {
                        "pid": 530100,
                        "id": 530113,
                        "value": "530113",
                        "label": "东川区"
                    },
                    {
                        "pid": 530100,
                        "id": 530114,
                        "value": "530114",
                        "label": "呈贡区"
                    },
                    {
                        "pid": 530100,
                        "id": 530115,
                        "value": "530115",
                        "label": "晋宁区"
                    },
                    {
                        "pid": 530100,
                        "id": 530124,
                        "value": "530124",
                        "label": "富民县"
                    },
                    {
                        "pid": 530100,
                        "id": 530125,
                        "value": "530125",
                        "label": "宜良县"
                    },
                    {
                        "pid": 530100,
                        "id": 530126,
                        "value": "530126",
                        "label": "石林彝族自治县"
                    },
                    {
                        "pid": 530100,
                        "id": 530127,
                        "value": "530127",
                        "label": "嵩明县"
                    },
                    {
                        "pid": 530100,
                        "id": 530128,
                        "value": "530128",
                        "label": "禄劝彝族苗族自治县"
                    },
                    {
                        "pid": 530100,
                        "id": 530129,
                        "value": "530129",
                        "label": "寻甸回族彝族自治县"
                    },
                    {
                        "pid": 530100,
                        "id": 530181,
                        "value": "530181",
                        "label": "安宁市"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 530300,
                "value": "530300",
                "label": "曲靖市",
                "children": [
                    {
                        "pid": 530300,
                        "id": 530302,
                        "value": "530302",
                        "label": "麒麟区"
                    },
                    {
                        "pid": 530300,
                        "id": 530303,
                        "value": "530303",
                        "label": "沾益区"
                    },
                    {
                        "pid": 530300,
                        "id": 530304,
                        "value": "530304",
                        "label": "马龙区"
                    },
                    {
                        "pid": 530300,
                        "id": 530322,
                        "value": "530322",
                        "label": "陆良县"
                    },
                    {
                        "pid": 530300,
                        "id": 530323,
                        "value": "530323",
                        "label": "师宗县"
                    },
                    {
                        "pid": 530300,
                        "id": 530324,
                        "value": "530324",
                        "label": "罗平县"
                    },
                    {
                        "pid": 530300,
                        "id": 530325,
                        "value": "530325",
                        "label": "富源县"
                    },
                    {
                        "pid": 530300,
                        "id": 530326,
                        "value": "530326",
                        "label": "会泽县"
                    },
                    {
                        "pid": 530300,
                        "id": 530381,
                        "value": "530381",
                        "label": "宣威市"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 530400,
                "value": "530400",
                "label": "玉溪市",
                "children": [
                    {
                        "pid": 530400,
                        "id": 530402,
                        "value": "530402",
                        "label": "红塔区"
                    },
                    {
                        "pid": 530400,
                        "id": 530403,
                        "value": "530403",
                        "label": "江川区"
                    },
                    {
                        "pid": 530400,
                        "id": 530423,
                        "value": "530423",
                        "label": "通海县"
                    },
                    {
                        "pid": 530400,
                        "id": 530424,
                        "value": "530424",
                        "label": "华宁县"
                    },
                    {
                        "pid": 530400,
                        "id": 530425,
                        "value": "530425",
                        "label": "易门县"
                    },
                    {
                        "pid": 530400,
                        "id": 530426,
                        "value": "530426",
                        "label": "峨山彝族自治县"
                    },
                    {
                        "pid": 530400,
                        "id": 530427,
                        "value": "530427",
                        "label": "新平彝族傣族自治县"
                    },
                    {
                        "pid": 530400,
                        "id": 530428,
                        "value": "530428",
                        "label": "元江哈尼族彝族傣族自治县"
                    },
                    {
                        "pid": 530400,
                        "id": 530481,
                        "value": "530481",
                        "label": "澄江市"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 530500,
                "value": "530500",
                "label": "保山市",
                "children": [
                    {
                        "pid": 530500,
                        "id": 530502,
                        "value": "530502",
                        "label": "隆阳区"
                    },
                    {
                        "pid": 530500,
                        "id": 530521,
                        "value": "530521",
                        "label": "施甸县"
                    },
                    {
                        "pid": 530500,
                        "id": 530523,
                        "value": "530523",
                        "label": "龙陵县"
                    },
                    {
                        "pid": 530500,
                        "id": 530524,
                        "value": "530524",
                        "label": "昌宁县"
                    },
                    {
                        "pid": 530500,
                        "id": 530581,
                        "value": "530581",
                        "label": "腾冲市"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 530600,
                "value": "530600",
                "label": "昭通市",
                "children": [
                    {
                        "pid": 530600,
                        "id": 530602,
                        "value": "530602",
                        "label": "昭阳区"
                    },
                    {
                        "pid": 530600,
                        "id": 530621,
                        "value": "530621",
                        "label": "鲁甸县"
                    },
                    {
                        "pid": 530600,
                        "id": 530622,
                        "value": "530622",
                        "label": "巧家县"
                    },
                    {
                        "pid": 530600,
                        "id": 530623,
                        "value": "530623",
                        "label": "盐津县"
                    },
                    {
                        "pid": 530600,
                        "id": 530624,
                        "value": "530624",
                        "label": "大关县"
                    },
                    {
                        "pid": 530600,
                        "id": 530625,
                        "value": "530625",
                        "label": "永善县"
                    },
                    {
                        "pid": 530600,
                        "id": 530626,
                        "value": "530626",
                        "label": "绥江县"
                    },
                    {
                        "pid": 530600,
                        "id": 530627,
                        "value": "530627",
                        "label": "镇雄县"
                    },
                    {
                        "pid": 530600,
                        "id": 530628,
                        "value": "530628",
                        "label": "彝良县"
                    },
                    {
                        "pid": 530600,
                        "id": 530629,
                        "value": "530629",
                        "label": "威信县"
                    },
                    {
                        "pid": 530600,
                        "id": 530681,
                        "value": "530681",
                        "label": "水富市"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 530700,
                "value": "530700",
                "label": "丽江市",
                "children": [
                    {
                        "pid": 530700,
                        "id": 530702,
                        "value": "530702",
                        "label": "古城区"
                    },
                    {
                        "pid": 530700,
                        "id": 530721,
                        "value": "530721",
                        "label": "玉龙纳西族自治县"
                    },
                    {
                        "pid": 530700,
                        "id": 530722,
                        "value": "530722",
                        "label": "永胜县"
                    },
                    {
                        "pid": 530700,
                        "id": 530723,
                        "value": "530723",
                        "label": "华坪县"
                    },
                    {
                        "pid": 530700,
                        "id": 530724,
                        "value": "530724",
                        "label": "宁蒗彝族自治县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 530800,
                "value": "530800",
                "label": "普洱市",
                "children": [
                    {
                        "pid": 530800,
                        "id": 530802,
                        "value": "530802",
                        "label": "思茅区"
                    },
                    {
                        "pid": 530800,
                        "id": 530821,
                        "value": "530821",
                        "label": "宁洱哈尼族彝族自治县"
                    },
                    {
                        "pid": 530800,
                        "id": 530822,
                        "value": "530822",
                        "label": "墨江哈尼族自治县"
                    },
                    {
                        "pid": 530800,
                        "id": 530823,
                        "value": "530823",
                        "label": "景东彝族自治县"
                    },
                    {
                        "pid": 530800,
                        "id": 530824,
                        "value": "530824",
                        "label": "景谷傣族彝族自治县"
                    },
                    {
                        "pid": 530800,
                        "id": 530825,
                        "value": "530825",
                        "label": "镇沅彝族哈尼族拉祜族自治县"
                    },
                    {
                        "pid": 530800,
                        "id": 530826,
                        "value": "530826",
                        "label": "江城哈尼族彝族自治县"
                    },
                    {
                        "pid": 530800,
                        "id": 530827,
                        "value": "530827",
                        "label": "孟连傣族拉祜族佤族自治县"
                    },
                    {
                        "pid": 530800,
                        "id": 530828,
                        "value": "530828",
                        "label": "澜沧拉祜族自治县"
                    },
                    {
                        "pid": 530800,
                        "id": 530829,
                        "value": "530829",
                        "label": "西盟佤族自治县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 530900,
                "value": "530900",
                "label": "临沧市",
                "children": [
                    {
                        "pid": 530900,
                        "id": 530902,
                        "value": "530902",
                        "label": "临翔区"
                    },
                    {
                        "pid": 530900,
                        "id": 530921,
                        "value": "530921",
                        "label": "凤庆县"
                    },
                    {
                        "pid": 530900,
                        "id": 530922,
                        "value": "530922",
                        "label": "云县"
                    },
                    {
                        "pid": 530900,
                        "id": 530923,
                        "value": "530923",
                        "label": "永德县"
                    },
                    {
                        "pid": 530900,
                        "id": 530924,
                        "value": "530924",
                        "label": "镇康县"
                    },
                    {
                        "pid": 530900,
                        "id": 530925,
                        "value": "530925",
                        "label": "双江拉祜族佤族布朗族傣族自治县"
                    },
                    {
                        "pid": 530900,
                        "id": 530926,
                        "value": "530926",
                        "label": "耿马傣族佤族自治县"
                    },
                    {
                        "pid": 530900,
                        "id": 530927,
                        "value": "530927",
                        "label": "沧源佤族自治县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 532300,
                "value": "532300",
                "label": "楚雄彝族自治州",
                "children": [
                    {
                        "pid": 532300,
                        "id": 532301,
                        "value": "532301",
                        "label": "楚雄市"
                    },
                    {
                        "pid": 532300,
                        "id": 532322,
                        "value": "532322",
                        "label": "双柏县"
                    },
                    {
                        "pid": 532300,
                        "id": 532323,
                        "value": "532323",
                        "label": "牟定县"
                    },
                    {
                        "pid": 532300,
                        "id": 532324,
                        "value": "532324",
                        "label": "南华县"
                    },
                    {
                        "pid": 532300,
                        "id": 532325,
                        "value": "532325",
                        "label": "姚安县"
                    },
                    {
                        "pid": 532300,
                        "id": 532326,
                        "value": "532326",
                        "label": "大姚县"
                    },
                    {
                        "pid": 532300,
                        "id": 532327,
                        "value": "532327",
                        "label": "永仁县"
                    },
                    {
                        "pid": 532300,
                        "id": 532328,
                        "value": "532328",
                        "label": "元谋县"
                    },
                    {
                        "pid": 532300,
                        "id": 532329,
                        "value": "532329",
                        "label": "武定县"
                    },
                    {
                        "pid": 532300,
                        "id": 532331,
                        "value": "532331",
                        "label": "禄丰县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 532500,
                "value": "532500",
                "label": "红河哈尼族彝族自治州",
                "children": [
                    {
                        "pid": 532500,
                        "id": 532501,
                        "value": "532501",
                        "label": "个旧市"
                    },
                    {
                        "pid": 532500,
                        "id": 532502,
                        "value": "532502",
                        "label": "开远市"
                    },
                    {
                        "pid": 532500,
                        "id": 532503,
                        "value": "532503",
                        "label": "蒙自市"
                    },
                    {
                        "pid": 532500,
                        "id": 532504,
                        "value": "532504",
                        "label": "弥勒市"
                    },
                    {
                        "pid": 532500,
                        "id": 532523,
                        "value": "532523",
                        "label": "屏边苗族自治县"
                    },
                    {
                        "pid": 532500,
                        "id": 532524,
                        "value": "532524",
                        "label": "建水县"
                    },
                    {
                        "pid": 532500,
                        "id": 532525,
                        "value": "532525",
                        "label": "石屏县"
                    },
                    {
                        "pid": 532500,
                        "id": 532527,
                        "value": "532527",
                        "label": "泸西县"
                    },
                    {
                        "pid": 532500,
                        "id": 532528,
                        "value": "532528",
                        "label": "元阳县"
                    },
                    {
                        "pid": 532500,
                        "id": 532529,
                        "value": "532529",
                        "label": "红河县"
                    },
                    {
                        "pid": 532500,
                        "id": 532530,
                        "value": "532530",
                        "label": "金平苗族瑶族傣族自治县"
                    },
                    {
                        "pid": 532500,
                        "id": 532531,
                        "value": "532531",
                        "label": "绿春县"
                    },
                    {
                        "pid": 532500,
                        "id": 532532,
                        "value": "532532",
                        "label": "河口瑶族自治县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 532600,
                "value": "532600",
                "label": "文山壮族苗族自治州",
                "children": [
                    {
                        "pid": 532600,
                        "id": 532601,
                        "value": "532601",
                        "label": "文山市"
                    },
                    {
                        "pid": 532600,
                        "id": 532622,
                        "value": "532622",
                        "label": "砚山县"
                    },
                    {
                        "pid": 532600,
                        "id": 532623,
                        "value": "532623",
                        "label": "西畴县"
                    },
                    {
                        "pid": 532600,
                        "id": 532624,
                        "value": "532624",
                        "label": "麻栗坡县"
                    },
                    {
                        "pid": 532600,
                        "id": 532625,
                        "value": "532625",
                        "label": "马关县"
                    },
                    {
                        "pid": 532600,
                        "id": 532626,
                        "value": "532626",
                        "label": "丘北县"
                    },
                    {
                        "pid": 532600,
                        "id": 532627,
                        "value": "532627",
                        "label": "广南县"
                    },
                    {
                        "pid": 532600,
                        "id": 532628,
                        "value": "532628",
                        "label": "富宁县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 532800,
                "value": "532800",
                "label": "西双版纳傣族自治州",
                "children": [
                    {
                        "pid": 532800,
                        "id": 532801,
                        "value": "532801",
                        "label": "景洪市"
                    },
                    {
                        "pid": 532800,
                        "id": 532822,
                        "value": "532822",
                        "label": "勐海县"
                    },
                    {
                        "pid": 532800,
                        "id": 532823,
                        "value": "532823",
                        "label": "勐腊县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 532900,
                "value": "532900",
                "label": "大理白族自治州",
                "children": [
                    {
                        "pid": 532900,
                        "id": 532901,
                        "value": "532901",
                        "label": "大理市"
                    },
                    {
                        "pid": 532900,
                        "id": 532922,
                        "value": "532922",
                        "label": "漾濞彝族自治县"
                    },
                    {
                        "pid": 532900,
                        "id": 532923,
                        "value": "532923",
                        "label": "祥云县"
                    },
                    {
                        "pid": 532900,
                        "id": 532924,
                        "value": "532924",
                        "label": "宾川县"
                    },
                    {
                        "pid": 532900,
                        "id": 532925,
                        "value": "532925",
                        "label": "弥渡县"
                    },
                    {
                        "pid": 532900,
                        "id": 532926,
                        "value": "532926",
                        "label": "南涧彝族自治县"
                    },
                    {
                        "pid": 532900,
                        "id": 532927,
                        "value": "532927",
                        "label": "巍山彝族回族自治县"
                    },
                    {
                        "pid": 532900,
                        "id": 532928,
                        "value": "532928",
                        "label": "永平县"
                    },
                    {
                        "pid": 532900,
                        "id": 532929,
                        "value": "532929",
                        "label": "云龙县"
                    },
                    {
                        "pid": 532900,
                        "id": 532930,
                        "value": "532930",
                        "label": "洱源县"
                    },
                    {
                        "pid": 532900,
                        "id": 532931,
                        "value": "532931",
                        "label": "剑川县"
                    },
                    {
                        "pid": 532900,
                        "id": 532932,
                        "value": "532932",
                        "label": "鹤庆县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 533100,
                "value": "533100",
                "label": "德宏傣族景颇族自治州",
                "children": [
                    {
                        "pid": 533100,
                        "id": 533102,
                        "value": "533102",
                        "label": "瑞丽市"
                    },
                    {
                        "pid": 533100,
                        "id": 533103,
                        "value": "533103",
                        "label": "芒市"
                    },
                    {
                        "pid": 533100,
                        "id": 533122,
                        "value": "533122",
                        "label": "梁河县"
                    },
                    {
                        "pid": 533100,
                        "id": 533123,
                        "value": "533123",
                        "label": "盈江县"
                    },
                    {
                        "pid": 533100,
                        "id": 533124,
                        "value": "533124",
                        "label": "陇川县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 533300,
                "value": "533300",
                "label": "怒江傈僳族自治州",
                "children": [
                    {
                        "pid": 533300,
                        "id": 533301,
                        "value": "533301",
                        "label": "泸水市"
                    },
                    {
                        "pid": 533300,
                        "id": 533323,
                        "value": "533323",
                        "label": "福贡县"
                    },
                    {
                        "pid": 533300,
                        "id": 533324,
                        "value": "533324",
                        "label": "贡山独龙族怒族自治县"
                    },
                    {
                        "pid": 533300,
                        "id": 533325,
                        "value": "533325",
                        "label": "兰坪白族普米族自治县"
                    }
                ]
            },
            {
                "pid": 530000,
                "id": 533400,
                "value": "533400",
                "label": "迪庆藏族自治州",
                "children": [
                    {
                        "pid": 533400,
                        "id": 533401,
                        "value": "533401",
                        "label": "香格里拉市"
                    },
                    {
                        "pid": 533400,
                        "id": 533422,
                        "value": "533422",
                        "label": "德钦县"
                    },
                    {
                        "pid": 533400,
                        "id": 533423,
                        "value": "533423",
                        "label": "维西傈僳族自治县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 540000,
        "value": "540000",
        "label": "西藏自治区",
        "children": [
            {
                "pid": 540000,
                "id": 540100,
                "value": "540100",
                "label": "拉萨市",
                "children": [
                    {
                        "pid": 540100,
                        "id": 540102,
                        "value": "540102",
                        "label": "城关区"
                    },
                    {
                        "pid": 540100,
                        "id": 540103,
                        "value": "540103",
                        "label": "堆龙德庆区"
                    },
                    {
                        "pid": 540100,
                        "id": 540104,
                        "value": "540104",
                        "label": "达孜区"
                    },
                    {
                        "pid": 540100,
                        "id": 540121,
                        "value": "540121",
                        "label": "林周县"
                    },
                    {
                        "pid": 540100,
                        "id": 540122,
                        "value": "540122",
                        "label": "当雄县"
                    },
                    {
                        "pid": 540100,
                        "id": 540123,
                        "value": "540123",
                        "label": "尼木县"
                    },
                    {
                        "pid": 540100,
                        "id": 540124,
                        "value": "540124",
                        "label": "曲水县"
                    },
                    {
                        "pid": 540100,
                        "id": 540127,
                        "value": "540127",
                        "label": "墨竹工卡县"
                    }
                ]
            },
            {
                "pid": 540000,
                "id": 540200,
                "value": "540200",
                "label": "日喀则市",
                "children": [
                    {
                        "pid": 540200,
                        "id": 540202,
                        "value": "540202",
                        "label": "桑珠孜区"
                    },
                    {
                        "pid": 540200,
                        "id": 540221,
                        "value": "540221",
                        "label": "南木林县"
                    },
                    {
                        "pid": 540200,
                        "id": 540222,
                        "value": "540222",
                        "label": "江孜县"
                    },
                    {
                        "pid": 540200,
                        "id": 540223,
                        "value": "540223",
                        "label": "定日县"
                    },
                    {
                        "pid": 540200,
                        "id": 540224,
                        "value": "540224",
                        "label": "萨迦县"
                    },
                    {
                        "pid": 540200,
                        "id": 540225,
                        "value": "540225",
                        "label": "拉孜县"
                    },
                    {
                        "pid": 540200,
                        "id": 540226,
                        "value": "540226",
                        "label": "昂仁县"
                    },
                    {
                        "pid": 540200,
                        "id": 540227,
                        "value": "540227",
                        "label": "谢通门县"
                    },
                    {
                        "pid": 540200,
                        "id": 540228,
                        "value": "540228",
                        "label": "白朗县"
                    },
                    {
                        "pid": 540200,
                        "id": 540229,
                        "value": "540229",
                        "label": "仁布县"
                    },
                    {
                        "pid": 540200,
                        "id": 540230,
                        "value": "540230",
                        "label": "康马县"
                    },
                    {
                        "pid": 540200,
                        "id": 540231,
                        "value": "540231",
                        "label": "定结县"
                    },
                    {
                        "pid": 540200,
                        "id": 540232,
                        "value": "540232",
                        "label": "仲巴县"
                    },
                    {
                        "pid": 540200,
                        "id": 540233,
                        "value": "540233",
                        "label": "亚东县"
                    },
                    {
                        "pid": 540200,
                        "id": 540234,
                        "value": "540234",
                        "label": "吉隆县"
                    },
                    {
                        "pid": 540200,
                        "id": 540235,
                        "value": "540235",
                        "label": "聂拉木县"
                    },
                    {
                        "pid": 540200,
                        "id": 540236,
                        "value": "540236",
                        "label": "萨嘎县"
                    },
                    {
                        "pid": 540200,
                        "id": 540237,
                        "value": "540237",
                        "label": "岗巴县"
                    }
                ]
            },
            {
                "pid": 540000,
                "id": 540300,
                "value": "540300",
                "label": "昌都市",
                "children": [
                    {
                        "pid": 540300,
                        "id": 540302,
                        "value": "540302",
                        "label": "卡若区"
                    },
                    {
                        "pid": 540300,
                        "id": 540321,
                        "value": "540321",
                        "label": "江达县"
                    },
                    {
                        "pid": 540300,
                        "id": 540322,
                        "value": "540322",
                        "label": "贡觉县"
                    },
                    {
                        "pid": 540300,
                        "id": 540323,
                        "value": "540323",
                        "label": "类乌齐县"
                    },
                    {
                        "pid": 540300,
                        "id": 540324,
                        "value": "540324",
                        "label": "丁青县"
                    },
                    {
                        "pid": 540300,
                        "id": 540325,
                        "value": "540325",
                        "label": "察雅县"
                    },
                    {
                        "pid": 540300,
                        "id": 540326,
                        "value": "540326",
                        "label": "八宿县"
                    },
                    {
                        "pid": 540300,
                        "id": 540327,
                        "value": "540327",
                        "label": "左贡县"
                    },
                    {
                        "pid": 540300,
                        "id": 540328,
                        "value": "540328",
                        "label": "芒康县"
                    },
                    {
                        "pid": 540300,
                        "id": 540329,
                        "value": "540329",
                        "label": "洛隆县"
                    },
                    {
                        "pid": 540300,
                        "id": 540330,
                        "value": "540330",
                        "label": "边坝县"
                    }
                ]
            },
            {
                "pid": 540000,
                "id": 540400,
                "value": "540400",
                "label": "林芝市",
                "children": [
                    {
                        "pid": 540400,
                        "id": 540402,
                        "value": "540402",
                        "label": "巴宜区"
                    },
                    {
                        "pid": 540400,
                        "id": 540421,
                        "value": "540421",
                        "label": "工布江达县"
                    },
                    {
                        "pid": 540400,
                        "id": 540422,
                        "value": "540422",
                        "label": "米林县"
                    },
                    {
                        "pid": 540400,
                        "id": 540423,
                        "value": "540423",
                        "label": "墨脱县"
                    },
                    {
                        "pid": 540400,
                        "id": 540424,
                        "value": "540424",
                        "label": "波密县"
                    },
                    {
                        "pid": 540400,
                        "id": 540425,
                        "value": "540425",
                        "label": "察隅县"
                    },
                    {
                        "pid": 540400,
                        "id": 540426,
                        "value": "540426",
                        "label": "朗县"
                    }
                ]
            },
            {
                "pid": 540000,
                "id": 540500,
                "value": "540500",
                "label": "山南市",
                "children": [
                    {
                        "pid": 540500,
                        "id": 540502,
                        "value": "540502",
                        "label": "乃东区"
                    },
                    {
                        "pid": 540500,
                        "id": 540521,
                        "value": "540521",
                        "label": "扎囊县"
                    },
                    {
                        "pid": 540500,
                        "id": 540522,
                        "value": "540522",
                        "label": "贡嘎县"
                    },
                    {
                        "pid": 540500,
                        "id": 540523,
                        "value": "540523",
                        "label": "桑日县"
                    },
                    {
                        "pid": 540500,
                        "id": 540524,
                        "value": "540524",
                        "label": "琼结县"
                    },
                    {
                        "pid": 540500,
                        "id": 540525,
                        "value": "540525",
                        "label": "曲松县"
                    },
                    {
                        "pid": 540500,
                        "id": 540526,
                        "value": "540526",
                        "label": "措美县"
                    },
                    {
                        "pid": 540500,
                        "id": 540527,
                        "value": "540527",
                        "label": "洛扎县"
                    },
                    {
                        "pid": 540500,
                        "id": 540528,
                        "value": "540528",
                        "label": "加查县"
                    },
                    {
                        "pid": 540500,
                        "id": 540529,
                        "value": "540529",
                        "label": "隆子县"
                    },
                    {
                        "pid": 540500,
                        "id": 540530,
                        "value": "540530",
                        "label": "错那县"
                    },
                    {
                        "pid": 540500,
                        "id": 540531,
                        "value": "540531",
                        "label": "浪卡子县"
                    }
                ]
            },
            {
                "pid": 540000,
                "id": 540600,
                "value": "540600",
                "label": "那曲市",
                "children": [
                    {
                        "pid": 540600,
                        "id": 540602,
                        "value": "540602",
                        "label": "色尼区"
                    },
                    {
                        "pid": 540600,
                        "id": 540621,
                        "value": "540621",
                        "label": "嘉黎县"
                    },
                    {
                        "pid": 540600,
                        "id": 540622,
                        "value": "540622",
                        "label": "比如县"
                    },
                    {
                        "pid": 540600,
                        "id": 540623,
                        "value": "540623",
                        "label": "聂荣县"
                    },
                    {
                        "pid": 540600,
                        "id": 540624,
                        "value": "540624",
                        "label": "安多县"
                    },
                    {
                        "pid": 540600,
                        "id": 540625,
                        "value": "540625",
                        "label": "申扎县"
                    },
                    {
                        "pid": 540600,
                        "id": 540626,
                        "value": "540626",
                        "label": "索县"
                    },
                    {
                        "pid": 540600,
                        "id": 540627,
                        "value": "540627",
                        "label": "班戈县"
                    },
                    {
                        "pid": 540600,
                        "id": 540628,
                        "value": "540628",
                        "label": "巴青县"
                    },
                    {
                        "pid": 540600,
                        "id": 540629,
                        "value": "540629",
                        "label": "尼玛县"
                    },
                    {
                        "pid": 540600,
                        "id": 540630,
                        "value": "540630",
                        "label": "双湖县"
                    }
                ]
            },
            {
                "pid": 540000,
                "id": 542500,
                "value": "542500",
                "label": "阿里地区",
                "children": [
                    {
                        "pid": 542500,
                        "id": 542521,
                        "value": "542521",
                        "label": "普兰县"
                    },
                    {
                        "pid": 542500,
                        "id": 542522,
                        "value": "542522",
                        "label": "札达县"
                    },
                    {
                        "pid": 542500,
                        "id": 542523,
                        "value": "542523",
                        "label": "噶尔县"
                    },
                    {
                        "pid": 542500,
                        "id": 542524,
                        "value": "542524",
                        "label": "日土县"
                    },
                    {
                        "pid": 542500,
                        "id": 542525,
                        "value": "542525",
                        "label": "革吉县"
                    },
                    {
                        "pid": 542500,
                        "id": 542526,
                        "value": "542526",
                        "label": "改则县"
                    },
                    {
                        "pid": 542500,
                        "id": 542527,
                        "value": "542527",
                        "label": "措勤县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 610000,
        "value": "610000",
        "label": "陕西省",
        "children": [
            {
                "pid": 610000,
                "id": 610100,
                "value": "610100",
                "label": "西安市",
                "children": [
                    {
                        "pid": 610100,
                        "id": 610102,
                        "value": "610102",
                        "label": "新城区"
                    },
                    {
                        "pid": 610100,
                        "id": 610103,
                        "value": "610103",
                        "label": "碑林区"
                    },
                    {
                        "pid": 610100,
                        "id": 610104,
                        "value": "610104",
                        "label": "莲湖区"
                    },
                    {
                        "pid": 610100,
                        "id": 610111,
                        "value": "610111",
                        "label": "灞桥区"
                    },
                    {
                        "pid": 610100,
                        "id": 610112,
                        "value": "610112",
                        "label": "未央区"
                    },
                    {
                        "pid": 610100,
                        "id": 610113,
                        "value": "610113",
                        "label": "雁塔区"
                    },
                    {
                        "pid": 610100,
                        "id": 610114,
                        "value": "610114",
                        "label": "阎良区"
                    },
                    {
                        "pid": 610100,
                        "id": 610115,
                        "value": "610115",
                        "label": "临潼区"
                    },
                    {
                        "pid": 610100,
                        "id": 610116,
                        "value": "610116",
                        "label": "长安区"
                    },
                    {
                        "pid": 610100,
                        "id": 610117,
                        "value": "610117",
                        "label": "高陵区"
                    },
                    {
                        "pid": 610100,
                        "id": 610118,
                        "value": "610118",
                        "label": "鄠邑区"
                    },
                    {
                        "pid": 610100,
                        "id": 610122,
                        "value": "610122",
                        "label": "蓝田县"
                    },
                    {
                        "pid": 610100,
                        "id": 610124,
                        "value": "610124",
                        "label": "周至县"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 610200,
                "value": "610200",
                "label": "铜川市",
                "children": [
                    {
                        "pid": 610200,
                        "id": 610202,
                        "value": "610202",
                        "label": "王益区"
                    },
                    {
                        "pid": 610200,
                        "id": 610203,
                        "value": "610203",
                        "label": "印台区"
                    },
                    {
                        "pid": 610200,
                        "id": 610204,
                        "value": "610204",
                        "label": "耀州区"
                    },
                    {
                        "pid": 610200,
                        "id": 610222,
                        "value": "610222",
                        "label": "宜君县"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 610300,
                "value": "610300",
                "label": "宝鸡市",
                "children": [
                    {
                        "pid": 610300,
                        "id": 610302,
                        "value": "610302",
                        "label": "渭滨区"
                    },
                    {
                        "pid": 610300,
                        "id": 610303,
                        "value": "610303",
                        "label": "金台区"
                    },
                    {
                        "pid": 610300,
                        "id": 610304,
                        "value": "610304",
                        "label": "陈仓区"
                    },
                    {
                        "pid": 610300,
                        "id": 610322,
                        "value": "610322",
                        "label": "凤翔县"
                    },
                    {
                        "pid": 610300,
                        "id": 610323,
                        "value": "610323",
                        "label": "岐山县"
                    },
                    {
                        "pid": 610300,
                        "id": 610324,
                        "value": "610324",
                        "label": "扶风县"
                    },
                    {
                        "pid": 610300,
                        "id": 610326,
                        "value": "610326",
                        "label": "眉县"
                    },
                    {
                        "pid": 610300,
                        "id": 610327,
                        "value": "610327",
                        "label": "陇县"
                    },
                    {
                        "pid": 610300,
                        "id": 610328,
                        "value": "610328",
                        "label": "千阳县"
                    },
                    {
                        "pid": 610300,
                        "id": 610329,
                        "value": "610329",
                        "label": "麟游县"
                    },
                    {
                        "pid": 610300,
                        "id": 610330,
                        "value": "610330",
                        "label": "凤县"
                    },
                    {
                        "pid": 610300,
                        "id": 610331,
                        "value": "610331",
                        "label": "太白县"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 610400,
                "value": "610400",
                "label": "咸阳市",
                "children": [
                    {
                        "pid": 610400,
                        "id": 610402,
                        "value": "610402",
                        "label": "秦都区"
                    },
                    {
                        "pid": 610400,
                        "id": 610403,
                        "value": "610403",
                        "label": "杨陵区"
                    },
                    {
                        "pid": 610400,
                        "id": 610404,
                        "value": "610404",
                        "label": "渭城区"
                    },
                    {
                        "pid": 610400,
                        "id": 610422,
                        "value": "610422",
                        "label": "三原县"
                    },
                    {
                        "pid": 610400,
                        "id": 610423,
                        "value": "610423",
                        "label": "泾阳县"
                    },
                    {
                        "pid": 610400,
                        "id": 610424,
                        "value": "610424",
                        "label": "乾县"
                    },
                    {
                        "pid": 610400,
                        "id": 610425,
                        "value": "610425",
                        "label": "礼泉县"
                    },
                    {
                        "pid": 610400,
                        "id": 610426,
                        "value": "610426",
                        "label": "永寿县"
                    },
                    {
                        "pid": 610400,
                        "id": 610428,
                        "value": "610428",
                        "label": "长武县"
                    },
                    {
                        "pid": 610400,
                        "id": 610429,
                        "value": "610429",
                        "label": "旬邑县"
                    },
                    {
                        "pid": 610400,
                        "id": 610430,
                        "value": "610430",
                        "label": "淳化县"
                    },
                    {
                        "pid": 610400,
                        "id": 610431,
                        "value": "610431",
                        "label": "武功县"
                    },
                    {
                        "pid": 610400,
                        "id": 610481,
                        "value": "610481",
                        "label": "兴平市"
                    },
                    {
                        "pid": 610400,
                        "id": 610482,
                        "value": "610482",
                        "label": "彬州市"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 610500,
                "value": "610500",
                "label": "渭南市",
                "children": [
                    {
                        "pid": 610500,
                        "id": 610502,
                        "value": "610502",
                        "label": "临渭区"
                    },
                    {
                        "pid": 610500,
                        "id": 610503,
                        "value": "610503",
                        "label": "华州区"
                    },
                    {
                        "pid": 610500,
                        "id": 610522,
                        "value": "610522",
                        "label": "潼关县"
                    },
                    {
                        "pid": 610500,
                        "id": 610523,
                        "value": "610523",
                        "label": "大荔县"
                    },
                    {
                        "pid": 610500,
                        "id": 610524,
                        "value": "610524",
                        "label": "合阳县"
                    },
                    {
                        "pid": 610500,
                        "id": 610525,
                        "value": "610525",
                        "label": "澄城县"
                    },
                    {
                        "pid": 610500,
                        "id": 610526,
                        "value": "610526",
                        "label": "蒲城县"
                    },
                    {
                        "pid": 610500,
                        "id": 610527,
                        "value": "610527",
                        "label": "白水县"
                    },
                    {
                        "pid": 610500,
                        "id": 610528,
                        "value": "610528",
                        "label": "富平县"
                    },
                    {
                        "pid": 610500,
                        "id": 610581,
                        "value": "610581",
                        "label": "韩城市"
                    },
                    {
                        "pid": 610500,
                        "id": 610582,
                        "value": "610582",
                        "label": "华阴市"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 610600,
                "value": "610600",
                "label": "延安市",
                "children": [
                    {
                        "pid": 610600,
                        "id": 610602,
                        "value": "610602",
                        "label": "宝塔区"
                    },
                    {
                        "pid": 610600,
                        "id": 610603,
                        "value": "610603",
                        "label": "安塞区"
                    },
                    {
                        "pid": 610600,
                        "id": 610621,
                        "value": "610621",
                        "label": "延长县"
                    },
                    {
                        "pid": 610600,
                        "id": 610622,
                        "value": "610622",
                        "label": "延川县"
                    },
                    {
                        "pid": 610600,
                        "id": 610625,
                        "value": "610625",
                        "label": "志丹县"
                    },
                    {
                        "pid": 610600,
                        "id": 610626,
                        "value": "610626",
                        "label": "吴起县"
                    },
                    {
                        "pid": 610600,
                        "id": 610627,
                        "value": "610627",
                        "label": "甘泉县"
                    },
                    {
                        "pid": 610600,
                        "id": 610628,
                        "value": "610628",
                        "label": "富县"
                    },
                    {
                        "pid": 610600,
                        "id": 610629,
                        "value": "610629",
                        "label": "洛川县"
                    },
                    {
                        "pid": 610600,
                        "id": 610630,
                        "value": "610630",
                        "label": "宜川县"
                    },
                    {
                        "pid": 610600,
                        "id": 610631,
                        "value": "610631",
                        "label": "黄龙县"
                    },
                    {
                        "pid": 610600,
                        "id": 610632,
                        "value": "610632",
                        "label": "黄陵县"
                    },
                    {
                        "pid": 610600,
                        "id": 610681,
                        "value": "610681",
                        "label": "子长市"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 610700,
                "value": "610700",
                "label": "汉中市",
                "children": [
                    {
                        "pid": 610700,
                        "id": 610702,
                        "value": "610702",
                        "label": "汉台区"
                    },
                    {
                        "pid": 610700,
                        "id": 610703,
                        "value": "610703",
                        "label": "南郑区"
                    },
                    {
                        "pid": 610700,
                        "id": 610722,
                        "value": "610722",
                        "label": "城固县"
                    },
                    {
                        "pid": 610700,
                        "id": 610723,
                        "value": "610723",
                        "label": "洋县"
                    },
                    {
                        "pid": 610700,
                        "id": 610724,
                        "value": "610724",
                        "label": "西乡县"
                    },
                    {
                        "pid": 610700,
                        "id": 610725,
                        "value": "610725",
                        "label": "勉县"
                    },
                    {
                        "pid": 610700,
                        "id": 610726,
                        "value": "610726",
                        "label": "宁强县"
                    },
                    {
                        "pid": 610700,
                        "id": 610727,
                        "value": "610727",
                        "label": "略阳县"
                    },
                    {
                        "pid": 610700,
                        "id": 610728,
                        "value": "610728",
                        "label": "镇巴县"
                    },
                    {
                        "pid": 610700,
                        "id": 610729,
                        "value": "610729",
                        "label": "留坝县"
                    },
                    {
                        "pid": 610700,
                        "id": 610730,
                        "value": "610730",
                        "label": "佛坪县"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 610800,
                "value": "610800",
                "label": "榆林市",
                "children": [
                    {
                        "pid": 610800,
                        "id": 610802,
                        "value": "610802",
                        "label": "榆阳区"
                    },
                    {
                        "pid": 610800,
                        "id": 610803,
                        "value": "610803",
                        "label": "横山区"
                    },
                    {
                        "pid": 610800,
                        "id": 610822,
                        "value": "610822",
                        "label": "府谷县"
                    },
                    {
                        "pid": 610800,
                        "id": 610824,
                        "value": "610824",
                        "label": "靖边县"
                    },
                    {
                        "pid": 610800,
                        "id": 610825,
                        "value": "610825",
                        "label": "定边县"
                    },
                    {
                        "pid": 610800,
                        "id": 610826,
                        "value": "610826",
                        "label": "绥德县"
                    },
                    {
                        "pid": 610800,
                        "id": 610827,
                        "value": "610827",
                        "label": "米脂县"
                    },
                    {
                        "pid": 610800,
                        "id": 610828,
                        "value": "610828",
                        "label": "佳县"
                    },
                    {
                        "pid": 610800,
                        "id": 610829,
                        "value": "610829",
                        "label": "吴堡县"
                    },
                    {
                        "pid": 610800,
                        "id": 610830,
                        "value": "610830",
                        "label": "清涧县"
                    },
                    {
                        "pid": 610800,
                        "id": 610831,
                        "value": "610831",
                        "label": "子洲县"
                    },
                    {
                        "pid": 610800,
                        "id": 610881,
                        "value": "610881",
                        "label": "神木市"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 610900,
                "value": "610900",
                "label": "安康市",
                "children": [
                    {
                        "pid": 610900,
                        "id": 610902,
                        "value": "610902",
                        "label": "汉滨区"
                    },
                    {
                        "pid": 610900,
                        "id": 610921,
                        "value": "610921",
                        "label": "汉阴县"
                    },
                    {
                        "pid": 610900,
                        "id": 610922,
                        "value": "610922",
                        "label": "石泉县"
                    },
                    {
                        "pid": 610900,
                        "id": 610923,
                        "value": "610923",
                        "label": "宁陕县"
                    },
                    {
                        "pid": 610900,
                        "id": 610924,
                        "value": "610924",
                        "label": "紫阳县"
                    },
                    {
                        "pid": 610900,
                        "id": 610925,
                        "value": "610925",
                        "label": "岚皋县"
                    },
                    {
                        "pid": 610900,
                        "id": 610926,
                        "value": "610926",
                        "label": "平利县"
                    },
                    {
                        "pid": 610900,
                        "id": 610927,
                        "value": "610927",
                        "label": "镇坪县"
                    },
                    {
                        "pid": 610900,
                        "id": 610928,
                        "value": "610928",
                        "label": "旬阳县"
                    },
                    {
                        "pid": 610900,
                        "id": 610929,
                        "value": "610929",
                        "label": "白河县"
                    }
                ]
            },
            {
                "pid": 610000,
                "id": 611000,
                "value": "611000",
                "label": "商洛市",
                "children": [
                    {
                        "pid": 611000,
                        "id": 611002,
                        "value": "611002",
                        "label": "商州区"
                    },
                    {
                        "pid": 611000,
                        "id": 611021,
                        "value": "611021",
                        "label": "洛南县"
                    },
                    {
                        "pid": 611000,
                        "id": 611022,
                        "value": "611022",
                        "label": "丹凤县"
                    },
                    {
                        "pid": 611000,
                        "id": 611023,
                        "value": "611023",
                        "label": "商南县"
                    },
                    {
                        "pid": 611000,
                        "id": 611024,
                        "value": "611024",
                        "label": "山阳县"
                    },
                    {
                        "pid": 611000,
                        "id": 611025,
                        "value": "611025",
                        "label": "镇安县"
                    },
                    {
                        "pid": 611000,
                        "id": 611026,
                        "value": "611026",
                        "label": "柞水县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 620000,
        "value": "620000",
        "label": "甘肃省",
        "children": [
            {
                "pid": 620000,
                "id": 620100,
                "value": "620100",
                "label": "兰州市",
                "children": [
                    {
                        "pid": 620100,
                        "id": 620102,
                        "value": "620102",
                        "label": "城关区"
                    },
                    {
                        "pid": 620100,
                        "id": 620103,
                        "value": "620103",
                        "label": "七里河区"
                    },
                    {
                        "pid": 620100,
                        "id": 620104,
                        "value": "620104",
                        "label": "西固区"
                    },
                    {
                        "pid": 620100,
                        "id": 620105,
                        "value": "620105",
                        "label": "安宁区"
                    },
                    {
                        "pid": 620100,
                        "id": 620111,
                        "value": "620111",
                        "label": "红古区"
                    },
                    {
                        "pid": 620100,
                        "id": 620121,
                        "value": "620121",
                        "label": "永登县"
                    },
                    {
                        "pid": 620100,
                        "id": 620122,
                        "value": "620122",
                        "label": "皋兰县"
                    },
                    {
                        "pid": 620100,
                        "id": 620123,
                        "value": "620123",
                        "label": "榆中县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 620200,
                "value": "620200",
                "label": "嘉峪关市"
            },
            {
                "pid": 620000,
                "id": 620300,
                "value": "620300",
                "label": "金昌市",
                "children": [
                    {
                        "pid": 620300,
                        "id": 620302,
                        "value": "620302",
                        "label": "金川区"
                    },
                    {
                        "pid": 620300,
                        "id": 620321,
                        "value": "620321",
                        "label": "永昌县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 620400,
                "value": "620400",
                "label": "白银市",
                "children": [
                    {
                        "pid": 620400,
                        "id": 620402,
                        "value": "620402",
                        "label": "白银区"
                    },
                    {
                        "pid": 620400,
                        "id": 620403,
                        "value": "620403",
                        "label": "平川区"
                    },
                    {
                        "pid": 620400,
                        "id": 620421,
                        "value": "620421",
                        "label": "靖远县"
                    },
                    {
                        "pid": 620400,
                        "id": 620422,
                        "value": "620422",
                        "label": "会宁县"
                    },
                    {
                        "pid": 620400,
                        "id": 620423,
                        "value": "620423",
                        "label": "景泰县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 620500,
                "value": "620500",
                "label": "天水市",
                "children": [
                    {
                        "pid": 620500,
                        "id": 620502,
                        "value": "620502",
                        "label": "秦州区"
                    },
                    {
                        "pid": 620500,
                        "id": 620503,
                        "value": "620503",
                        "label": "麦积区"
                    },
                    {
                        "pid": 620500,
                        "id": 620521,
                        "value": "620521",
                        "label": "清水县"
                    },
                    {
                        "pid": 620500,
                        "id": 620522,
                        "value": "620522",
                        "label": "秦安县"
                    },
                    {
                        "pid": 620500,
                        "id": 620523,
                        "value": "620523",
                        "label": "甘谷县"
                    },
                    {
                        "pid": 620500,
                        "id": 620524,
                        "value": "620524",
                        "label": "武山县"
                    },
                    {
                        "pid": 620500,
                        "id": 620525,
                        "value": "620525",
                        "label": "张家川回族自治县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 620600,
                "value": "620600",
                "label": "武威市",
                "children": [
                    {
                        "pid": 620600,
                        "id": 620602,
                        "value": "620602",
                        "label": "凉州区"
                    },
                    {
                        "pid": 620600,
                        "id": 620621,
                        "value": "620621",
                        "label": "民勤县"
                    },
                    {
                        "pid": 620600,
                        "id": 620622,
                        "value": "620622",
                        "label": "古浪县"
                    },
                    {
                        "pid": 620600,
                        "id": 620623,
                        "value": "620623",
                        "label": "天祝藏族自治县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 620700,
                "value": "620700",
                "label": "张掖市",
                "children": [
                    {
                        "pid": 620700,
                        "id": 620702,
                        "value": "620702",
                        "label": "甘州区"
                    },
                    {
                        "pid": 620700,
                        "id": 620721,
                        "value": "620721",
                        "label": "肃南裕固族自治县"
                    },
                    {
                        "pid": 620700,
                        "id": 620722,
                        "value": "620722",
                        "label": "民乐县"
                    },
                    {
                        "pid": 620700,
                        "id": 620723,
                        "value": "620723",
                        "label": "临泽县"
                    },
                    {
                        "pid": 620700,
                        "id": 620724,
                        "value": "620724",
                        "label": "高台县"
                    },
                    {
                        "pid": 620700,
                        "id": 620725,
                        "value": "620725",
                        "label": "山丹县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 620800,
                "value": "620800",
                "label": "平凉市",
                "children": [
                    {
                        "pid": 620800,
                        "id": 620802,
                        "value": "620802",
                        "label": "崆峒区"
                    },
                    {
                        "pid": 620800,
                        "id": 620821,
                        "value": "620821",
                        "label": "泾川县"
                    },
                    {
                        "pid": 620800,
                        "id": 620822,
                        "value": "620822",
                        "label": "灵台县"
                    },
                    {
                        "pid": 620800,
                        "id": 620823,
                        "value": "620823",
                        "label": "崇信县"
                    },
                    {
                        "pid": 620800,
                        "id": 620825,
                        "value": "620825",
                        "label": "庄浪县"
                    },
                    {
                        "pid": 620800,
                        "id": 620826,
                        "value": "620826",
                        "label": "静宁县"
                    },
                    {
                        "pid": 620800,
                        "id": 620881,
                        "value": "620881",
                        "label": "华亭市"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 620900,
                "value": "620900",
                "label": "酒泉市",
                "children": [
                    {
                        "pid": 620900,
                        "id": 620902,
                        "value": "620902",
                        "label": "肃州区"
                    },
                    {
                        "pid": 620900,
                        "id": 620921,
                        "value": "620921",
                        "label": "金塔县"
                    },
                    {
                        "pid": 620900,
                        "id": 620922,
                        "value": "620922",
                        "label": "瓜州县"
                    },
                    {
                        "pid": 620900,
                        "id": 620923,
                        "value": "620923",
                        "label": "肃北蒙古族自治县"
                    },
                    {
                        "pid": 620900,
                        "id": 620924,
                        "value": "620924",
                        "label": "阿克塞哈萨克族自治县"
                    },
                    {
                        "pid": 620900,
                        "id": 620981,
                        "value": "620981",
                        "label": "玉门市"
                    },
                    {
                        "pid": 620900,
                        "id": 620982,
                        "value": "620982",
                        "label": "敦煌市"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 621000,
                "value": "621000",
                "label": "庆阳市",
                "children": [
                    {
                        "pid": 621000,
                        "id": 621002,
                        "value": "621002",
                        "label": "西峰区"
                    },
                    {
                        "pid": 621000,
                        "id": 621021,
                        "value": "621021",
                        "label": "庆城县"
                    },
                    {
                        "pid": 621000,
                        "id": 621022,
                        "value": "621022",
                        "label": "环县"
                    },
                    {
                        "pid": 621000,
                        "id": 621023,
                        "value": "621023",
                        "label": "华池县"
                    },
                    {
                        "pid": 621000,
                        "id": 621024,
                        "value": "621024",
                        "label": "合水县"
                    },
                    {
                        "pid": 621000,
                        "id": 621025,
                        "value": "621025",
                        "label": "正宁县"
                    },
                    {
                        "pid": 621000,
                        "id": 621026,
                        "value": "621026",
                        "label": "宁县"
                    },
                    {
                        "pid": 621000,
                        "id": 621027,
                        "value": "621027",
                        "label": "镇原县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 621100,
                "value": "621100",
                "label": "定西市",
                "children": [
                    {
                        "pid": 621100,
                        "id": 621102,
                        "value": "621102",
                        "label": "安定区"
                    },
                    {
                        "pid": 621100,
                        "id": 621121,
                        "value": "621121",
                        "label": "通渭县"
                    },
                    {
                        "pid": 621100,
                        "id": 621122,
                        "value": "621122",
                        "label": "陇西县"
                    },
                    {
                        "pid": 621100,
                        "id": 621123,
                        "value": "621123",
                        "label": "渭源县"
                    },
                    {
                        "pid": 621100,
                        "id": 621124,
                        "value": "621124",
                        "label": "临洮县"
                    },
                    {
                        "pid": 621100,
                        "id": 621125,
                        "value": "621125",
                        "label": "漳县"
                    },
                    {
                        "pid": 621100,
                        "id": 621126,
                        "value": "621126",
                        "label": "岷县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 621200,
                "value": "621200",
                "label": "陇南市",
                "children": [
                    {
                        "pid": 621200,
                        "id": 621202,
                        "value": "621202",
                        "label": "武都区"
                    },
                    {
                        "pid": 621200,
                        "id": 621221,
                        "value": "621221",
                        "label": "成县"
                    },
                    {
                        "pid": 621200,
                        "id": 621222,
                        "value": "621222",
                        "label": "文县"
                    },
                    {
                        "pid": 621200,
                        "id": 621223,
                        "value": "621223",
                        "label": "宕昌县"
                    },
                    {
                        "pid": 621200,
                        "id": 621224,
                        "value": "621224",
                        "label": "康县"
                    },
                    {
                        "pid": 621200,
                        "id": 621225,
                        "value": "621225",
                        "label": "西和县"
                    },
                    {
                        "pid": 621200,
                        "id": 621226,
                        "value": "621226",
                        "label": "礼县"
                    },
                    {
                        "pid": 621200,
                        "id": 621227,
                        "value": "621227",
                        "label": "徽县"
                    },
                    {
                        "pid": 621200,
                        "id": 621228,
                        "value": "621228",
                        "label": "两当县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 622900,
                "value": "622900",
                "label": "临夏回族自治州",
                "children": [
                    {
                        "pid": 622900,
                        "id": 622901,
                        "value": "622901",
                        "label": "临夏市"
                    },
                    {
                        "pid": 622900,
                        "id": 622921,
                        "value": "622921",
                        "label": "临夏县"
                    },
                    {
                        "pid": 622900,
                        "id": 622922,
                        "value": "622922",
                        "label": "康乐县"
                    },
                    {
                        "pid": 622900,
                        "id": 622923,
                        "value": "622923",
                        "label": "永靖县"
                    },
                    {
                        "pid": 622900,
                        "id": 622924,
                        "value": "622924",
                        "label": "广河县"
                    },
                    {
                        "pid": 622900,
                        "id": 622925,
                        "value": "622925",
                        "label": "和政县"
                    },
                    {
                        "pid": 622900,
                        "id": 622926,
                        "value": "622926",
                        "label": "东乡族自治县"
                    },
                    {
                        "pid": 622900,
                        "id": 622927,
                        "value": "622927",
                        "label": "积石山保安族东乡族撒拉族自治县"
                    }
                ]
            },
            {
                "pid": 620000,
                "id": 623000,
                "value": "623000",
                "label": "甘南藏族自治州",
                "children": [
                    {
                        "pid": 623000,
                        "id": 623001,
                        "value": "623001",
                        "label": "合作市"
                    },
                    {
                        "pid": 623000,
                        "id": 623021,
                        "value": "623021",
                        "label": "临潭县"
                    },
                    {
                        "pid": 623000,
                        "id": 623022,
                        "value": "623022",
                        "label": "卓尼县"
                    },
                    {
                        "pid": 623000,
                        "id": 623023,
                        "value": "623023",
                        "label": "舟曲县"
                    },
                    {
                        "pid": 623000,
                        "id": 623024,
                        "value": "623024",
                        "label": "迭部县"
                    },
                    {
                        "pid": 623000,
                        "id": 623025,
                        "value": "623025",
                        "label": "玛曲县"
                    },
                    {
                        "pid": 623000,
                        "id": 623026,
                        "value": "623026",
                        "label": "碌曲县"
                    },
                    {
                        "pid": 623000,
                        "id": 623027,
                        "value": "623027",
                        "label": "夏河县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 630000,
        "value": "630000",
        "label": "青海省",
        "children": [
            {
                "pid": 630000,
                "id": 630100,
                "value": "630100",
                "label": "西宁市",
                "children": [
                    {
                        "pid": 630100,
                        "id": 630102,
                        "value": "630102",
                        "label": "城东区"
                    },
                    {
                        "pid": 630100,
                        "id": 630103,
                        "value": "630103",
                        "label": "城中区"
                    },
                    {
                        "pid": 630100,
                        "id": 630104,
                        "value": "630104",
                        "label": "城西区"
                    },
                    {
                        "pid": 630100,
                        "id": 630105,
                        "value": "630105",
                        "label": "城北区"
                    },
                    {
                        "pid": 630100,
                        "id": 630106,
                        "value": "630106",
                        "label": "湟中区"
                    },
                    {
                        "pid": 630100,
                        "id": 630121,
                        "value": "630121",
                        "label": "大通回族土族自治县"
                    },
                    {
                        "pid": 630100,
                        "id": 630123,
                        "value": "630123",
                        "label": "湟源县"
                    }
                ]
            },
            {
                "pid": 630000,
                "id": 630200,
                "value": "630200",
                "label": "海东市",
                "children": [
                    {
                        "pid": 630200,
                        "id": 630202,
                        "value": "630202",
                        "label": "乐都区"
                    },
                    {
                        "pid": 630200,
                        "id": 630203,
                        "value": "630203",
                        "label": "平安区"
                    },
                    {
                        "pid": 630200,
                        "id": 630222,
                        "value": "630222",
                        "label": "民和回族土族自治县"
                    },
                    {
                        "pid": 630200,
                        "id": 630223,
                        "value": "630223",
                        "label": "互助土族自治县"
                    },
                    {
                        "pid": 630200,
                        "id": 630224,
                        "value": "630224",
                        "label": "化隆回族自治县"
                    },
                    {
                        "pid": 630200,
                        "id": 630225,
                        "value": "630225",
                        "label": "循化撒拉族自治县"
                    }
                ]
            },
            {
                "pid": 630000,
                "id": 632200,
                "value": "632200",
                "label": "海北藏族自治州",
                "children": [
                    {
                        "pid": 632200,
                        "id": 632221,
                        "value": "632221",
                        "label": "门源回族自治县"
                    },
                    {
                        "pid": 632200,
                        "id": 632222,
                        "value": "632222",
                        "label": "祁连县"
                    },
                    {
                        "pid": 632200,
                        "id": 632223,
                        "value": "632223",
                        "label": "海晏县"
                    },
                    {
                        "pid": 632200,
                        "id": 632224,
                        "value": "632224",
                        "label": "刚察县"
                    }
                ]
            },
            {
                "pid": 630000,
                "id": 632300,
                "value": "632300",
                "label": "黄南藏族自治州",
                "children": [
                    {
                        "pid": 632300,
                        "id": 632301,
                        "value": "632301",
                        "label": "同仁市"
                    },
                    {
                        "pid": 632300,
                        "id": 632322,
                        "value": "632322",
                        "label": "尖扎县"
                    },
                    {
                        "pid": 632300,
                        "id": 632323,
                        "value": "632323",
                        "label": "泽库县"
                    },
                    {
                        "pid": 632300,
                        "id": 632324,
                        "value": "632324",
                        "label": "河南蒙古族自治县"
                    }
                ]
            },
            {
                "pid": 630000,
                "id": 632500,
                "value": "632500",
                "label": "海南藏族自治州",
                "children": [
                    {
                        "pid": 632500,
                        "id": 632521,
                        "value": "632521",
                        "label": "共和县"
                    },
                    {
                        "pid": 632500,
                        "id": 632522,
                        "value": "632522",
                        "label": "同德县"
                    },
                    {
                        "pid": 632500,
                        "id": 632523,
                        "value": "632523",
                        "label": "贵德县"
                    },
                    {
                        "pid": 632500,
                        "id": 632524,
                        "value": "632524",
                        "label": "兴海县"
                    },
                    {
                        "pid": 632500,
                        "id": 632525,
                        "value": "632525",
                        "label": "贵南县"
                    }
                ]
            },
            {
                "pid": 630000,
                "id": 632600,
                "value": "632600",
                "label": "果洛藏族自治州",
                "children": [
                    {
                        "pid": 632600,
                        "id": 632621,
                        "value": "632621",
                        "label": "玛沁县"
                    },
                    {
                        "pid": 632600,
                        "id": 632622,
                        "value": "632622",
                        "label": "班玛县"
                    },
                    {
                        "pid": 632600,
                        "id": 632623,
                        "value": "632623",
                        "label": "甘德县"
                    },
                    {
                        "pid": 632600,
                        "id": 632624,
                        "value": "632624",
                        "label": "达日县"
                    },
                    {
                        "pid": 632600,
                        "id": 632625,
                        "value": "632625",
                        "label": "久治县"
                    },
                    {
                        "pid": 632600,
                        "id": 632626,
                        "value": "632626",
                        "label": "玛多县"
                    }
                ]
            },
            {
                "pid": 630000,
                "id": 632700,
                "value": "632700",
                "label": "玉树藏族自治州",
                "children": [
                    {
                        "pid": 632700,
                        "id": 632701,
                        "value": "632701",
                        "label": "玉树市"
                    },
                    {
                        "pid": 632700,
                        "id": 632722,
                        "value": "632722",
                        "label": "杂多县"
                    },
                    {
                        "pid": 632700,
                        "id": 632723,
                        "value": "632723",
                        "label": "称多县"
                    },
                    {
                        "pid": 632700,
                        "id": 632724,
                        "value": "632724",
                        "label": "治多县"
                    },
                    {
                        "pid": 632700,
                        "id": 632725,
                        "value": "632725",
                        "label": "囊谦县"
                    },
                    {
                        "pid": 632700,
                        "id": 632726,
                        "value": "632726",
                        "label": "曲麻莱县"
                    }
                ]
            },
            {
                "pid": 630000,
                "id": 632800,
                "value": "632800",
                "label": "海西蒙古族藏族自治州",
                "children": [
                    {
                        "pid": 632800,
                        "id": 632801,
                        "value": "632801",
                        "label": "格尔木市"
                    },
                    {
                        "pid": 632800,
                        "id": 632802,
                        "value": "632802",
                        "label": "德令哈市"
                    },
                    {
                        "pid": 632800,
                        "id": 632803,
                        "value": "632803",
                        "label": "茫崖市"
                    },
                    {
                        "pid": 632800,
                        "id": 632821,
                        "value": "632821",
                        "label": "乌兰县"
                    },
                    {
                        "pid": 632800,
                        "id": 632822,
                        "value": "632822",
                        "label": "都兰县"
                    },
                    {
                        "pid": 632800,
                        "id": 632823,
                        "value": "632823",
                        "label": "天峻县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 640000,
        "value": "640000",
        "label": "宁夏回族自治区",
        "children": [
            {
                "pid": 640000,
                "id": 640100,
                "value": "640100",
                "label": "银川市",
                "children": [
                    {
                        "pid": 640100,
                        "id": 640104,
                        "value": "640104",
                        "label": "兴庆区"
                    },
                    {
                        "pid": 640100,
                        "id": 640105,
                        "value": "640105",
                        "label": "西夏区"
                    },
                    {
                        "pid": 640100,
                        "id": 640106,
                        "value": "640106",
                        "label": "金凤区"
                    },
                    {
                        "pid": 640100,
                        "id": 640121,
                        "value": "640121",
                        "label": "永宁县"
                    },
                    {
                        "pid": 640100,
                        "id": 640122,
                        "value": "640122",
                        "label": "贺兰县"
                    },
                    {
                        "pid": 640100,
                        "id": 640181,
                        "value": "640181",
                        "label": "灵武市"
                    }
                ]
            },
            {
                "pid": 640000,
                "id": 640200,
                "value": "640200",
                "label": "石嘴山市",
                "children": [
                    {
                        "pid": 640200,
                        "id": 640202,
                        "value": "640202",
                        "label": "大武口区"
                    },
                    {
                        "pid": 640200,
                        "id": 640205,
                        "value": "640205",
                        "label": "惠农区"
                    },
                    {
                        "pid": 640200,
                        "id": 640221,
                        "value": "640221",
                        "label": "平罗县"
                    }
                ]
            },
            {
                "pid": 640000,
                "id": 640300,
                "value": "640300",
                "label": "吴忠市",
                "children": [
                    {
                        "pid": 640300,
                        "id": 640302,
                        "value": "640302",
                        "label": "利通区"
                    },
                    {
                        "pid": 640300,
                        "id": 640303,
                        "value": "640303",
                        "label": "红寺堡区"
                    },
                    {
                        "pid": 640300,
                        "id": 640323,
                        "value": "640323",
                        "label": "盐池县"
                    },
                    {
                        "pid": 640300,
                        "id": 640324,
                        "value": "640324",
                        "label": "同心县"
                    },
                    {
                        "pid": 640300,
                        "id": 640381,
                        "value": "640381",
                        "label": "青铜峡市"
                    }
                ]
            },
            {
                "pid": 640000,
                "id": 640400,
                "value": "640400",
                "label": "固原市",
                "children": [
                    {
                        "pid": 640400,
                        "id": 640402,
                        "value": "640402",
                        "label": "原州区"
                    },
                    {
                        "pid": 640400,
                        "id": 640422,
                        "value": "640422",
                        "label": "西吉县"
                    },
                    {
                        "pid": 640400,
                        "id": 640423,
                        "value": "640423",
                        "label": "隆德县"
                    },
                    {
                        "pid": 640400,
                        "id": 640424,
                        "value": "640424",
                        "label": "泾源县"
                    },
                    {
                        "pid": 640400,
                        "id": 640425,
                        "value": "640425",
                        "label": "彭阳县"
                    }
                ]
            },
            {
                "pid": 640000,
                "id": 640500,
                "value": "640500",
                "label": "中卫市",
                "children": [
                    {
                        "pid": 640500,
                        "id": 640502,
                        "value": "640502",
                        "label": "沙坡头区"
                    },
                    {
                        "pid": 640500,
                        "id": 640521,
                        "value": "640521",
                        "label": "中宁县"
                    },
                    {
                        "pid": 640500,
                        "id": 640522,
                        "value": "640522",
                        "label": "海原县"
                    }
                ]
            }
        ]
    },
    {
        "pid": -1,
        "id": 650000,
        "value": "650000",
        "label": "新疆维吾尔自治区",
        "children": [
            {
                "pid": 650000,
                "id": 650100,
                "value": "650100",
                "label": "乌鲁木齐市",
                "children": [
                    {
                        "pid": 650100,
                        "id": 650102,
                        "value": "650102",
                        "label": "天山区"
                    },
                    {
                        "pid": 650100,
                        "id": 650103,
                        "value": "650103",
                        "label": "沙依巴克区"
                    },
                    {
                        "pid": 650100,
                        "id": 650104,
                        "value": "650104",
                        "label": "新市区"
                    },
                    {
                        "pid": 650100,
                        "id": 650105,
                        "value": "650105",
                        "label": "水磨沟区"
                    },
                    {
                        "pid": 650100,
                        "id": 650106,
                        "value": "650106",
                        "label": "头屯河区"
                    },
                    {
                        "pid": 650100,
                        "id": 650107,
                        "value": "650107",
                        "label": "达坂城区"
                    },
                    {
                        "pid": 650100,
                        "id": 650109,
                        "value": "650109",
                        "label": "米东区"
                    },
                    {
                        "pid": 650100,
                        "id": 650121,
                        "value": "650121",
                        "label": "乌鲁木齐县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 650200,
                "value": "650200",
                "label": "克拉玛依市",
                "children": [
                    {
                        "pid": 650200,
                        "id": 650202,
                        "value": "650202",
                        "label": "独山子区"
                    },
                    {
                        "pid": 650200,
                        "id": 650203,
                        "value": "650203",
                        "label": "克拉玛依区"
                    },
                    {
                        "pid": 650200,
                        "id": 650204,
                        "value": "650204",
                        "label": "白碱滩区"
                    },
                    {
                        "pid": 650200,
                        "id": 650205,
                        "value": "650205",
                        "label": "乌尔禾区"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 650400,
                "value": "650400",
                "label": "吐鲁番市",
                "children": [
                    {
                        "pid": 650400,
                        "id": 650402,
                        "value": "650402",
                        "label": "高昌区"
                    },
                    {
                        "pid": 650400,
                        "id": 650421,
                        "value": "650421",
                        "label": "鄯善县"
                    },
                    {
                        "pid": 650400,
                        "id": 650422,
                        "value": "650422",
                        "label": "托克逊县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 650500,
                "value": "650500",
                "label": "哈密市",
                "children": [
                    {
                        "pid": 650500,
                        "id": 650502,
                        "value": "650502",
                        "label": "伊州区"
                    },
                    {
                        "pid": 650500,
                        "id": 650521,
                        "value": "650521",
                        "label": "巴里坤哈萨克自治县"
                    },
                    {
                        "pid": 650500,
                        "id": 650522,
                        "value": "650522",
                        "label": "伊吾县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 652300,
                "value": "652300",
                "label": "昌吉回族自治州",
                "children": [
                    {
                        "pid": 652300,
                        "id": 652301,
                        "value": "652301",
                        "label": "昌吉市"
                    },
                    {
                        "pid": 652300,
                        "id": 652302,
                        "value": "652302",
                        "label": "阜康市"
                    },
                    {
                        "pid": 652300,
                        "id": 652323,
                        "value": "652323",
                        "label": "呼图壁县"
                    },
                    {
                        "pid": 652300,
                        "id": 652324,
                        "value": "652324",
                        "label": "玛纳斯县"
                    },
                    {
                        "pid": 652300,
                        "id": 652325,
                        "value": "652325",
                        "label": "奇台县"
                    },
                    {
                        "pid": 652300,
                        "id": 652327,
                        "value": "652327",
                        "label": "吉木萨尔县"
                    },
                    {
                        "pid": 652300,
                        "id": 652328,
                        "value": "652328",
                        "label": "木垒哈萨克自治县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 652700,
                "value": "652700",
                "label": "博尔塔拉蒙古自治州",
                "children": [
                    {
                        "pid": 652700,
                        "id": 652701,
                        "value": "652701",
                        "label": "博乐市"
                    },
                    {
                        "pid": 652700,
                        "id": 652702,
                        "value": "652702",
                        "label": "阿拉山口市"
                    },
                    {
                        "pid": 652700,
                        "id": 652722,
                        "value": "652722",
                        "label": "精河县"
                    },
                    {
                        "pid": 652700,
                        "id": 652723,
                        "value": "652723",
                        "label": "温泉县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 652800,
                "value": "652800",
                "label": "巴音郭楞蒙古自治州",
                "children": [
                    {
                        "pid": 652800,
                        "id": 652801,
                        "value": "652801",
                        "label": "库尔勒市"
                    },
                    {
                        "pid": 652800,
                        "id": 652822,
                        "value": "652822",
                        "label": "轮台县"
                    },
                    {
                        "pid": 652800,
                        "id": 652823,
                        "value": "652823",
                        "label": "尉犁县"
                    },
                    {
                        "pid": 652800,
                        "id": 652824,
                        "value": "652824",
                        "label": "若羌县"
                    },
                    {
                        "pid": 652800,
                        "id": 652825,
                        "value": "652825",
                        "label": "且末县"
                    },
                    {
                        "pid": 652800,
                        "id": 652826,
                        "value": "652826",
                        "label": "焉耆回族自治县"
                    },
                    {
                        "pid": 652800,
                        "id": 652827,
                        "value": "652827",
                        "label": "和静县"
                    },
                    {
                        "pid": 652800,
                        "id": 652828,
                        "value": "652828",
                        "label": "和硕县"
                    },
                    {
                        "pid": 652800,
                        "id": 652829,
                        "value": "652829",
                        "label": "博湖县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 652900,
                "value": "652900",
                "label": "阿克苏地区",
                "children": [
                    {
                        "pid": 652900,
                        "id": 652901,
                        "value": "652901",
                        "label": "阿克苏市"
                    },
                    {
                        "pid": 652900,
                        "id": 652902,
                        "value": "652902",
                        "label": "库车市"
                    },
                    {
                        "pid": 652900,
                        "id": 652922,
                        "value": "652922",
                        "label": "温宿县"
                    },
                    {
                        "pid": 652900,
                        "id": 652924,
                        "value": "652924",
                        "label": "沙雅县"
                    },
                    {
                        "pid": 652900,
                        "id": 652925,
                        "value": "652925",
                        "label": "新和县"
                    },
                    {
                        "pid": 652900,
                        "id": 652926,
                        "value": "652926",
                        "label": "拜城县"
                    },
                    {
                        "pid": 652900,
                        "id": 652927,
                        "value": "652927",
                        "label": "乌什县"
                    },
                    {
                        "pid": 652900,
                        "id": 652928,
                        "value": "652928",
                        "label": "阿瓦提县"
                    },
                    {
                        "pid": 652900,
                        "id": 652929,
                        "value": "652929",
                        "label": "柯坪县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 653000,
                "value": "653000",
                "label": "克孜勒苏柯尔克孜自治州",
                "children": [
                    {
                        "pid": 653000,
                        "id": 653001,
                        "value": "653001",
                        "label": "阿图什市"
                    },
                    {
                        "pid": 653000,
                        "id": 653022,
                        "value": "653022",
                        "label": "阿克陶县"
                    },
                    {
                        "pid": 653000,
                        "id": 653023,
                        "value": "653023",
                        "label": "阿合奇县"
                    },
                    {
                        "pid": 653000,
                        "id": 653024,
                        "value": "653024",
                        "label": "乌恰县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 653100,
                "value": "653100",
                "label": "喀什地区",
                "children": [
                    {
                        "pid": 653100,
                        "id": 653101,
                        "value": "653101",
                        "label": "喀什市"
                    },
                    {
                        "pid": 653100,
                        "id": 653121,
                        "value": "653121",
                        "label": "疏附县"
                    },
                    {
                        "pid": 653100,
                        "id": 653122,
                        "value": "653122",
                        "label": "疏勒县"
                    },
                    {
                        "pid": 653100,
                        "id": 653123,
                        "value": "653123",
                        "label": "英吉沙县"
                    },
                    {
                        "pid": 653100,
                        "id": 653124,
                        "value": "653124",
                        "label": "泽普县"
                    },
                    {
                        "pid": 653100,
                        "id": 653125,
                        "value": "653125",
                        "label": "莎车县"
                    },
                    {
                        "pid": 653100,
                        "id": 653126,
                        "value": "653126",
                        "label": "叶城县"
                    },
                    {
                        "pid": 653100,
                        "id": 653127,
                        "value": "653127",
                        "label": "麦盖提县"
                    },
                    {
                        "pid": 653100,
                        "id": 653128,
                        "value": "653128",
                        "label": "岳普湖县"
                    },
                    {
                        "pid": 653100,
                        "id": 653129,
                        "value": "653129",
                        "label": "伽师县"
                    },
                    {
                        "pid": 653100,
                        "id": 653130,
                        "value": "653130",
                        "label": "巴楚县"
                    },
                    {
                        "pid": 653100,
                        "id": 653131,
                        "value": "653131",
                        "label": "塔什库尔干塔吉克自治县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 653200,
                "value": "653200",
                "label": "和田地区",
                "children": [
                    {
                        "pid": 653200,
                        "id": 653201,
                        "value": "653201",
                        "label": "和田市"
                    },
                    {
                        "pid": 653200,
                        "id": 653221,
                        "value": "653221",
                        "label": "和田县"
                    },
                    {
                        "pid": 653200,
                        "id": 653222,
                        "value": "653222",
                        "label": "墨玉县"
                    },
                    {
                        "pid": 653200,
                        "id": 653223,
                        "value": "653223",
                        "label": "皮山县"
                    },
                    {
                        "pid": 653200,
                        "id": 653224,
                        "value": "653224",
                        "label": "洛浦县"
                    },
                    {
                        "pid": 653200,
                        "id": 653225,
                        "value": "653225",
                        "label": "策勒县"
                    },
                    {
                        "pid": 653200,
                        "id": 653226,
                        "value": "653226",
                        "label": "于田县"
                    },
                    {
                        "pid": 653200,
                        "id": 653227,
                        "value": "653227",
                        "label": "民丰县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 654000,
                "value": "654000",
                "label": "伊犁哈萨克自治州",
                "children": [
                    {
                        "pid": 654000,
                        "id": 654002,
                        "value": "654002",
                        "label": "伊宁市"
                    },
                    {
                        "pid": 654000,
                        "id": 654003,
                        "value": "654003",
                        "label": "奎屯市"
                    },
                    {
                        "pid": 654000,
                        "id": 654004,
                        "value": "654004",
                        "label": "霍尔果斯市"
                    },
                    {
                        "pid": 654000,
                        "id": 654021,
                        "value": "654021",
                        "label": "伊宁县"
                    },
                    {
                        "pid": 654000,
                        "id": 654022,
                        "value": "654022",
                        "label": "察布查尔锡伯自治县"
                    },
                    {
                        "pid": 654000,
                        "id": 654023,
                        "value": "654023",
                        "label": "霍城县"
                    },
                    {
                        "pid": 654000,
                        "id": 654024,
                        "value": "654024",
                        "label": "巩留县"
                    },
                    {
                        "pid": 654000,
                        "id": 654025,
                        "value": "654025",
                        "label": "新源县"
                    },
                    {
                        "pid": 654000,
                        "id": 654026,
                        "value": "654026",
                        "label": "昭苏县"
                    },
                    {
                        "pid": 654000,
                        "id": 654027,
                        "value": "654027",
                        "label": "特克斯县"
                    },
                    {
                        "pid": 654000,
                        "id": 654028,
                        "value": "654028",
                        "label": "尼勒克县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 654200,
                "value": "654200",
                "label": "塔城地区",
                "children": [
                    {
                        "pid": 654200,
                        "id": 654201,
                        "value": "654201",
                        "label": "塔城市"
                    },
                    {
                        "pid": 654200,
                        "id": 654202,
                        "value": "654202",
                        "label": "乌苏市"
                    },
                    {
                        "pid": 654200,
                        "id": 654221,
                        "value": "654221",
                        "label": "额敏县"
                    },
                    {
                        "pid": 654200,
                        "id": 654223,
                        "value": "654223",
                        "label": "沙湾县"
                    },
                    {
                        "pid": 654200,
                        "id": 654224,
                        "value": "654224",
                        "label": "托里县"
                    },
                    {
                        "pid": 654200,
                        "id": 654225,
                        "value": "654225",
                        "label": "裕民县"
                    },
                    {
                        "pid": 654200,
                        "id": 654226,
                        "value": "654226",
                        "label": "和布克赛尔蒙古自治县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 654300,
                "value": "654300",
                "label": "阿勒泰地区",
                "children": [
                    {
                        "pid": 654300,
                        "id": 654301,
                        "value": "654301",
                        "label": "阿勒泰市"
                    },
                    {
                        "pid": 654300,
                        "id": 654321,
                        "value": "654321",
                        "label": "布尔津县"
                    },
                    {
                        "pid": 654300,
                        "id": 654322,
                        "value": "654322",
                        "label": "富蕴县"
                    },
                    {
                        "pid": 654300,
                        "id": 654323,
                        "value": "654323",
                        "label": "福海县"
                    },
                    {
                        "pid": 654300,
                        "id": 654324,
                        "value": "654324",
                        "label": "哈巴河县"
                    },
                    {
                        "pid": 654300,
                        "id": 654325,
                        "value": "654325",
                        "label": "青河县"
                    },
                    {
                        "pid": 654300,
                        "id": 654326,
                        "value": "654326",
                        "label": "吉木乃县"
                    }
                ]
            },
            {
                "pid": 650000,
                "id": 659001,
                "value": "659001",
                "label": "石河子市"
            },
            {
                "pid": 650000,
                "id": 659002,
                "value": "659002",
                "label": "阿拉尔市"
            },
            {
                "pid": 650000,
                "id": 659003,
                "value": "659003",
                "label": "图木舒克市"
            },
            {
                "pid": 650000,
                "id": 659004,
                "value": "659004",
                "label": "五家渠市"
            },
            {
                "pid": 650000,
                "id": 659005,
                "value": "659005",
                "label": "北屯市"
            },
            {
                "pid": 650000,
                "id": 659006,
                "value": "659006",
                "label": "铁门关市"
            },
            {
                "pid": 650000,
                "id": 659007,
                "value": "659007",
                "label": "双河市"
            },
            {
                "pid": 650000,
                "id": 659008,
                "value": "659008",
                "label": "可克达拉市"
            },
            {
                "pid": 650000,
                "id": 659009,
                "value": "659009",
                "label": "昆玉市"
            },
            {
                "pid": 650000,
                "id": 659010,
                "value": "659010",
                "label": "胡杨河市"
            }
        ]
    },
    {
        "pid": -1,
        "id": 710000,
        "value": "710000",
        "label": "台湾省"
    },
    {
        "pid": -1,
        "id": 810000,
        "value": "810000",
        "label": "香港特别行政区",
        "children": [
            {
                "pid": 810000,
                "id": 810101,
                "value": "810101",
                "label": "中西区"
            },
            {
                "pid": 810000,
                "id": 810102,
                "value": "810102",
                "label": "湾仔区"
            },
            {
                "pid": 810000,
                "id": 810103,
                "value": "810103",
                "label": "东区"
            },
            {
                "pid": 810000,
                "id": 810104,
                "value": "810104",
                "label": "南区"
            },
            {
                "pid": 810000,
                "id": 810105,
                "value": "810105",
                "label": "油尖旺区"
            },
            {
                "pid": 810000,
                "id": 810106,
                "value": "810106",
                "label": "深水埗区"
            },
            {
                "pid": 810000,
                "id": 810107,
                "value": "810107",
                "label": "九龙城区"
            },
            {
                "pid": 810000,
                "id": 810108,
                "value": "810108",
                "label": "黄大仙区"
            },
            {
                "pid": 810000,
                "id": 810109,
                "value": "810109",
                "label": "观塘区"
            },
            {
                "pid": 810000,
                "id": 810110,
                "value": "810110",
                "label": "北区"
            },
            {
                "pid": 810000,
                "id": 810111,
                "value": "810111",
                "label": "大埔区"
            },
            {
                "pid": 810000,
                "id": 810112,
                "value": "810112",
                "label": "沙田区"
            },
            {
                "pid": 810000,
                "id": 810113,
                "value": "810113",
                "label": "西贡区"
            },
            {
                "pid": 810000,
                "id": 810114,
                "value": "810114",
                "label": "荃湾区"
            },
            {
                "pid": 810000,
                "id": 810115,
                "value": "810115",
                "label": "屯门区"
            },
            {
                "pid": 810000,
                "id": 810116,
                "value": "810116",
                "label": "元朗区"
            },
            {
                "pid": 810000,
                "id": 810117,
                "value": "810117",
                "label": "葵青区"
            },
            {
                "pid": 810000,
                "id": 810118,
                "value": "810118",
                "label": "离岛区"
            }
        ]
    },
    {
        "pid": -1,
        "id": 820000,
        "value": "820000",
        "label": "澳门特别行政区",
        "children": [
            {
                "pid": 820000,
                "id": 820101,
                "value": "820101",
                "label": "花地玛堂区"
            },
            {
                "pid": 820000,
                "id": 820102,
                "value": "820102",
                "label": "圣安多尼堂区"
            },
            {
                "pid": 820000,
                "id": 820103,
                "value": "820103",
                "label": "大堂区"
            },
            {
                "pid": 820000,
                "id": 820104,
                "value": "820104",
                "label": "望德堂区"
            },
            {
                "pid": 820000,
                "id": 820105,
                "value": "820105",
                "label": "风顺堂区"
            },
            {
                "pid": 820000,
                "id": 820106,
                "value": "820106",
                "label": "嘉模堂区"
            },
            {
                "pid": 820000,
                "id": 820107,
                "value": "820107",
                "label": "圣方济各堂区"
            },
            {
                "pid": 820000,
                "id": 820108,
                "value": "820108",
                "label": "路氹城"
            },
            {
                "pid": 820000,
                "id": 820109,
                "value": "820109",
                "label": "澳门新城"
            }
        ]
    }
];
